<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>
</title>
</head>
<body>
<table>
<tbody>
<tr>	<td>
<p>
<b>Guide de l'utilisateur de la biblioth&egrave;que num&eacute;rique Greenstone</b>
</p>
<p>
<b>Ian H. Witten, Stefan Boddie et John Thompson</b>
</p>
<p>
<i>D&eacute;partement d'informatique,
Universit&eacute; de Waikato, Nouvelle-Z&eacute;lande</i>
</p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/index.html">Retourner &agrave; l'indexe du dessus</a> </p>
<p>Greenstone est une suite logicielle destin&eacute;e &agrave; la construction et &agrave; la distribution de collections de biblioth&egrave;ques num&eacute;riques. Cette suite fournit une nouvelle mani&egrave;re d'organiser l'information et de la publier sur l'Internet ou sur un c&eacute;d&eacute;rom. Greenstone est produit par le projet de biblioth&egrave;que num&eacute;rique de Nouvelle-Z&eacute;lande (d&eacute;pendant de l'universit&eacute; de Waikato), et distribu&eacute; en coop&eacute;ration avec l'UNESCO et le projet de biblioth&egrave;ques pour l'humanit&eacute;. C'est un logiciel Open Source, qu'on peut obtenir &agrave; l'URL http://greenstone.org, et qui est diffus&eacute; selon les termes de la licence publique g&eacute;n&eacute;rale de GNU.</p>
<p>Nous souhaitons nous assurer que ce logiciel fonctionne bien pour vous.
Faites-nous part, en anglais, de tout probl&egrave;me &agrave; l'adresse &eacute;lectronique greenstone@cs.waikato.ac.nz.</p>
<p>
<b>Greenstone gsdl-2.70</b>&nbsp;&nbsp;Mars 2006</p>
<p>
</p>
<p>
<b>&Agrave; propos de ce manuel</b>
</p>
<p>Ce manuel fournit une description compl&egrave;te de la mani&egrave;re d'utiliser le logiciel Greenstone pour acc&eacute;der &agrave; et construire des collections de biblioth&egrave;ques num&eacute;riques.</p>
<p>La section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">1</a> donne une vue d'ensemble des possibilit&eacute;s du logiciel. La section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">2</a> explique comment utiliser les collections de Greenstone. L'interface parle d'elle-m&ecirc;me&nbsp;--&nbsp;la meilleure fa&ccedil;on d'apprendre est d'essayer&nbsp;--&nbsp;et cette section correspond aux informations d'aide en ligne fournies pour une collection typique. La section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a> explique la proc&eacute;dure de cr&eacute;ation d'une biblioth&egrave;que propre de collections en utilisant le "Greenstone Librarian Interface" (l'Interface Biblioth&eacute;caire de Greenstone). La section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">4</a> introduit l'outil d'administration, qui permet &agrave; l'administrateur syst&egrave;me de surveiller ce qui se passe, et de contr&ocirc;ler les droits de construction de collections.</p>
<p>Les annexes listent les fonctionnalit&eacute;s du logiciel Greenstone, et donnent un glossaire des termes utilis&eacute;s dans la documentation de Greenstone.</p>
<p>
<b>Documents d'accompagnement</b>
</p>
<p>L'ensemble des documents de Greenstone comprend quatre volumes:</p>
<p>Guide d'installation de la biblioth&egrave;que num&eacute;rique Greenstone </p>
<p>Guide de l'utilisateur de la biblioth&egrave;que num&eacute;rique Greenstone (<i>ce document-ci</i>) </p>
<p>Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone </p>
<p>Biblioth&egrave;que num&eacute;rique Greenstone: du papier &agrave; la collection </p>
<p>
<b>Copyright</b>
</p>
<p>Copyright &copy; 2002 2003 2004 2005 2006 2007 by the <a href="http://www.nzdl.org">New Zealand Digital Library Project</a> at <a href="http://www.waikato.ac.nz">the University of Waikato</a>, New Zealand.</p>
<p>Permission is granted to copy, distribute and/or modify this document under the terms of the <a href="http://www.gnu.org/licenses/fdl.html">GNU Free Documentation License</a>, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled <a href="http://greenstonewiki.cs.waikato.ac.nz/wiki/gsdoc/GNUFDL.html">&ldquo;GNU Free Documentation License.&rdquo;</a> </p>
<p>
<b>Remerciements</b>
</p>
<p>Le logiciel Greenstone a vu le jour gr&acirc;ce &agrave; un effort de collaboration entre de nombreuses personnes. Rodger McNab et Stefan Boddie en sont les principaux architectes et d&eacute;veloppeurs. Des contributions ont &eacute;t&eacute; faites par David Bainbridge, George Buchanan, Hong Chen, Michael Dewsnip, Katherine Don, Elke Duncker, Carl Gutwin, Geoff Holmes, Dana McKay, John McPherson, Craig Nevill-Manning, Dynal Patel, Gordon Paynter, Bernhard Pfahringer, Todd Reed, Bill Rogers, John Thompson, et Stuart Yeates. D'autres membres du Projet de biblioth&egrave;que num&eacute;rique de Nouvelle-Z&eacute;lande ont &eacute;galement donn&eacute; des conseils et inspir&eacute; les concepteurs du syst&egrave;me: Mark Apperley, Sally Jo Cunningham, Steve Jones, Te Taka Keegan, Michel Loots, Malika Mahoui, et Lloyd Smith. Nous remercions aussi tous ceux qui ont contribu&eacute; au d&eacute;veloppement des modules sous licence GNU GPL qui font partie de cette distribution: MG, GDBM, PDFTOHTML, PERL, WGET, WVWARE, XLHTML.</p>
<p>
<b>Contents</b>
</p>
<p>Vue d'ensemble de Greenstone </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Les collections</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Trouver l'information</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Les formats de documents</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Documents multim&eacute;dia et multilingues</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Distribuer Greenstone</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Utilisation des collections Greenstone</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Utilisation d'un c&eacute;d&eacute;rom de Greenstone</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Trouver l'information</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Changer les pr&eacute;f&eacute;rences</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Cr&eacute;er une collection Greenstone</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">l'Interface du Biblioth&eacute;caire</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">L'interface biblioth&eacute;caire du Guide d'Utilisateur</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Le balisage des fichiers de documents</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Le Collector</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Administration</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Fichiers de configuration</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Journaux</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Gestion des utilisateurs</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Informations techniques</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Fonctionnalit&eacute;s du logiciel</a> </p>
<p>
<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">Glossaire des termes</a> </p>
<p>
<b>1&nbsp;Vue d'ensemble de Greenstone</b>
</p>
<p>Greenstone est un syst&egrave;me complet pour construire et pr&eacute;senter des collections de milliers ou de millions de documents, comprenant du texte, des images, des contenus audio et vid&eacute;o.</p>
<p>
<a name="Section_collections"/>
<b>1.1&nbsp;Les collections</b>
</p>
<p>La biblioth&egrave;que num&eacute;rique typique construite avec Greenstone contient de nombreuses collections, organis&eacute;es individuellement&nbsp;--&nbsp;m&ecirc;me si elles ont un air de famille prononc&eacute;. Elles sont faciles &agrave; maintenir, et on peut facilement y ajouter du contenu et les reconstruire automatiquement.</p>
<p>Il existe plusieurs mani&egrave;res de retrouver de l'information dans la plupart des collections Greenstone. On peut par exemple<i>rechercher des mots particuliers</i>apparaissant dans le corps du texte ou dans une section du document. On peut aussi<i>consulter des documents par leur titre</i>: il suffit alors de cliquer sur un livre pour le lire. On peut encore<i>consulter des documents par th&egrave;me</i>. Les th&egrave;mes repr&eacute;sentent les &eacute;tag&egrave;res de la biblioth&egrave;que: il suffit de cliquer sur une &eacute;tag&egrave;re pour en voir les livres. Quand cela a un sens, les documents sont fournis avec une table des mati&egrave;res: on peut alors cliquer sur un chapitre ou sur une sous-section pour en lire le contenu, on peut d&eacute;velopper toute la table des mati&egrave;res, ou encore d&eacute;velopper tout le document dans la fen&ecirc;tre de son navigateur (ce qui est utile pour imprimer). Le site web de la biblioth&egrave;que num&eacute;rique de Nouvelle-Z&eacute;lande (nzdl.org) propose de nombreux exemples de collections.</p>
<p>La page de garde de chaque collection pr&eacute;sente l'objectif et la couverture de la collection, et en explique l'organisation. On peut consulter la plupart des collections en y <i>recherchant</i>des mots-clefs ou en y<i>naviguant</i>. Lors de recherches, le logiciel Greenstone examine l'ensemble du texte de tous les documents de la collection (ce qui s'appelle une &laquo;recherche dans le corps du texte&raquo;). Dans la plupart des collections l'utilisateur peut choisir entre plusieurs index, construits &agrave; partir de diff&eacute;rentes portions des documents. Certaines collections disposent d'un index des documents complets, d'un index des paragraphes, et d'un index des titres, dans lesquels on peut rechercher des mots ou des groupes de mots particuliers. On peut de cette mani&egrave;re retrouver tous les documents contenant un ensemble de mots pr&eacute;cis (les mots pouvant s'&eacute;taler sur tout le document), tous les paragraphes qui contiennent ce m&ecirc;me ensemble de mots (les mots doivent alors tous appara&icirc;tre dans le m&ecirc;me paragraphe), ou tous les documents dont les titres contiennent les mots recherch&eacute;s (les mots doivent alors se trouver dans les titres du document). On peut rencontrer d'autres index, comme par exemple un index des sections, ou encore un index des en-t&ecirc;tes de sections. Lors de navigations, l'utilisateur examine des listes: liste des auteurs, liste des titres, liste des dates, structures de classification hi&eacute;rarchiques, etc. Diff&eacute;rentes collections proposeront diff&eacute;rentes mani&egrave;res de naviguer.</p>
<p>
<a name="Section_finding_information"/>
<b>1.2&nbsp;Trouver l'information</b>
</p>
<p>Greenstone construit des index portant sur le corps du texte &agrave; partir des contenus textuels du document&nbsp;--&nbsp;ce sont des index qui permettent de rechercher tout mot apparaissant dans le texte du document. On peut rechercher dans les index des mots particuliers, des ensembles ou des groupes de mots, et les r&eacute;sultats sont ordonn&eacute;s en fonction de leur pertinence par rapport &agrave; la requ&ecirc;te.</p>
<p>Dans la plupart des collections, des donn&eacute;es descriptives telles que l'auteur, la date, des mots-clefs, etc., sont associ&eacute;es &agrave; chaque document. On appelle ces informations &laquo;m&eacute;ta-donn&eacute;es&raquo;. De nombreuses collections de documents contiennent &eacute;galement des index portant sur le texte de certains types de m&eacute;ta-donn&eacute;es. De nombreuses collections proposent par exemple un index de recherche dans les titres des documents.</p>
<p>Les utilisateurs peuvent naviguer de mani&egrave;re interactive &agrave; travers des listes et des structures hi&eacute;rarchiques qui sont engendr&eacute;es &agrave; partir des m&eacute;ta-donn&eacute;es associ&eacute;es &agrave; chaque document de la collection. Les m&eacute;ta-donn&eacute;es forment la mati&egrave;re premi&egrave;re de la navigation: elles doivent &ecirc;tre explicitement fournies, ou bien il doit &ecirc;tre possible de les obtenir automatiquement &agrave; partir des documents eux-m&ecirc;mes. Diff&eacute;rentes collections proposeront diff&eacute;rentes mani&egrave;res de naviguer. Les index de recherche et de navigation sont cr&eacute;&eacute;s lors d'un processus de &laquo;construction&raquo;, en se basant sur les informations fournies dans le fichier de configuration de la collection.</p>
<p>Greenstone cr&eacute;e toutes ses structures d'index automatiquement &agrave; partir des documents et des fichiers qui les accompagnent: rien n'est fait manuellement. Si de nouveaux documents du m&ecirc;me format sont disponibles, ils peuvent &ecirc;tre automatiquement fusionn&eacute;s au reste de la collection. En fait, pour la plupart des collections, tout ceci est pris en charge par des processus qui s'ex&eacute;cutent r&eacute;guli&egrave;rement, partent &agrave; la recherche de nouveaux contenus, et reconstruisent les index&nbsp;--&nbsp;le tout sans aucune intervention manuelle.</p>
<p>
<a name="Section_document_formats"/>
<b>1.3&nbsp;Les formats de documents</b>
</p>
<p>Les documents originaux sont dans un grand nombre de formats, et sont traduits sous une forme XML standard &agrave; l'aide de &laquo;greffons&raquo; (plugins). Les greffons distribu&eacute;s avec Greenstone sont capables de traiter des documents aux formats texte brut, HTML, Word, PDF, et les messages &eacute;lectroniques (de courrier ou de groupes de discussion). On peut &eacute;crire de nouveaux greffons pour de nouveaux types de documents (pour ce faire, il faudra pr&eacute;alablement &eacute;tudier le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone). Pour construire des structures de navigation &agrave; partir de m&eacute;ta-donn&eacute;es, on utilise de m&ecirc;me un syst&egrave;me de &laquo;classificateurs&raquo;. Ces derniers cr&eacute;ent des index de navigation de divers types: listes d&eacute;roulantes, s&eacute;lecteurs alphab&eacute;tiques, dates et autres hi&eacute;rarchies arbitraires. Ici encore, des programmeurs Greenstone peuvent cr&eacute;er de nouvelles structures de navigation.</p>
<p>
<a name="Section_multimedia_and_multilingual_docu"/>
<b>1.4&nbsp;Documents multim&eacute;dia et multilingues</b>
</p>
<p>Les collections peuvent comprendre du texte, des images, des contenus audio et vid&eacute;o. Les contenus non textuels peuvent &ecirc;tre reli&eacute;s aux documents textuels ou accompagn&eacute;s de descriptions textuelles (telles que les l&eacute;gendes des figures) pour pouvoir &ecirc;tre accessibles depuis une recherche dans le corps du texte ou la navigation.</p>
<p>Greenstone utilise partout Unicode, qui est un syst&egrave;me standard pour repr&eacute;senter les jeux de caract&egrave;res des langues du monde. Ceci permet de traiter et de repr&eacute;senter toutes les langues de mani&egrave;re consistante. On a construit des collections avec de l'anglais, de l'arabe, du chinois, de l'espagnol, du fran&ccedil;ais, et du maori. Les collections multilingues int&egrave;grent une reconnaissance automatique de la langue, et l'interface est disponible dans toutes les langues mentionn&eacute;es ci-dessus (entre autres).</p>
<p>
<a name="Section_distributing_greenstone"/>
<b>1.5&nbsp;Distribuer Greenstone</b>
</p>
<p>Les collections sont mises &agrave; disposition sur l'Internet ou publi&eacute;es, sous une forme exactement semblable, sur un c&eacute;d&eacute;rom qui s'installe automatiquement sous Windows. Les textes et les index sont compact&eacute;s, et un protocole CORBA permet de g&eacute;rer les collections distribu&eacute;es et les interfaces de requ&ecirc;tes graphiques.</p>
<p>La biblioth&egrave;que num&eacute;rique de Nouvelle-Z&eacute;lande (nzdl.org) fournit de nombreux exemples de collections, y compris des documents historiques, des informations humanitaires et de d&eacute;veloppement, des rapports techniques et des bibliographies, des 1#1uvres litt&eacute;raires, et des magazines.</p>
<p>Sa nature Open Source fait de Greenstone un logiciel facile &agrave; compl&eacute;ter, et il b&eacute;n&eacute;ficie de l'inclusion de modules sous licence publique g&eacute;n&eacute;rale de GNU pour la recherche dans le corps du texte, la gestion des bases de donn&eacute;es, et l'extraction de texte depuis des formats de documents propri&eacute;taires. Seule une coop&eacute;ration internationale permettra aux logiciels de biblioth&egrave;que num&eacute;rique de devenir suffisamment complets et de satisfaire les besoins des utilisateurs en richesse comme en souplesse.</p>
<p>
<b>2&nbsp;Utilisation des collections Greenstone</b>
</p>
<p>Le logiciel Greenstone a &eacute;t&eacute; con&ccedil;u dans un souci d'ergonomie. Les interfaces des collections sont identiques, sur le web comme sur des c&eacute;d&eacute;roms. L'installation de Greenstone &agrave; partir du c&eacute;d&eacute;rom est une op&eacute;ration tr&egrave;s simple, sur tout ordinateur &eacute;quip&eacute; de Windows ou de Linux: un programme d'installation standard compl&egrave;te des binaires pr&eacute;-compil&eacute;s. On peut utiliser une collection localement, sur l'ordinateur o&ugrave; elle est install&eacute;e; on peut aussi, si cet ordinateur est reli&eacute; &agrave; un r&eacute;seau, autoriser de mani&egrave;re automatique et transparente l'acc&egrave;s &agrave; cette collection depuis tous les autres ordinateurs du r&eacute;seau.</p>
<p>La section suivante d&eacute;crit l'installation d'un c&eacute;d&eacute;rom de Greenstone. Nous examinerons ensuite les possibilit&eacute;s de recherche et de navigation offertes par une collection Greenstone repr&eacute;sentative: la collection &laquo;Demo&raquo;, fournie avec Greenstone. D'autres collections pr&eacute;senteront des fonctionnalit&eacute;s semblables: savoir en manipuler une, c'est savoir les manipuler toutes. Vient ensuite une explication sur la mani&egrave;re d'adapter l'interface &agrave; vos propres besoins &agrave; l'aide de la page de pr&eacute;f&eacute;rences.</p>
<p>
<a name="Section_utilisation_d'using_a_greenstone"/>
<b>2.1&nbsp;Utilisation d'un c&eacute;d&eacute;rom de Greenstone</b>
</p>
<p>Le logiciel de biblioth&egrave;que num&eacute;rique Greenstone lui-m&ecirc;me est distribu&eacute; sur un c&eacute;d&eacute;rom, et votre administrateur syst&egrave;me ou vous l'avez d&eacute;j&agrave; install&eacute; sur votre syst&egrave;me, en suivant les instructions du Guide d'installation de la biblioth&egrave;que num&eacute;rique Greenstone. Si telle est bien votre situation, Greenstone est d&eacute;j&agrave; install&eacute; sur votre ordinateur et vous pouvez n&eacute;gliger de lire le reste de la pr&eacute;sente section et passer directement &agrave; la suivante.</p>
<p>Certaines collections Greenstone sont distribu&eacute;es sur un c&eacute;d&eacute;rom minimal, qui contient juste assez du logiciel pour n'utiliser que cette collection. Pour utiliser un tel c&eacute;d&eacute;rom, il suffit de l'ins&eacute;rer dans le lecteur de c&eacute;d&eacute;rom sur tout ordinateur personnel &eacute;quip&eacute; de Windows. Dans la plupart des cas (si le programme autorun est activ&eacute;), une fen&ecirc;tre appara&icirc;tra, qui vous invitera &agrave; installer le logiciel Greenstone. Dans le cas contraire, trouvez le lecteur de c&eacute;d&eacute;rom (sur les syst&egrave;mes Windows actuels, on y parvient en double-cliquant sur l'icone Mon ordinateur, situ&eacute;e sur le bureau), et double-cliquez dessus, puis sur le fichier Setup.exe qu'elle contient. Le programme Setup de Greenstone sera alors ex&eacute;cut&eacute; et vous guidera tout au long de la proc&eacute;dure d'installation. La plupart des gens se contentent de r&eacute;pondre oui (yes) &agrave; toutes les questions.</p>
<p>&Agrave; la fin de la proc&eacute;dure d'installation, vous trouverez la biblioth&egrave;que dans le sous-menu Programmes du menu D&eacute;marrer de Windows, et elle portera le nom de la collection, comme par exemple, Humanity Libraries (&laquo;biblioth&egrave;ques pour l'humanit&eacute;) ou United Nations University (&laquo;universit&eacute; des Nations-Unies&raquo;).</p>
<p>Une fois que le logiciel a &eacute;t&eacute; install&eacute;, vous entrerez automatiquement dans la biblioth&egrave;que &agrave; chaque insertion du c&eacute;d&eacute;rom, si le programme autorun est activ&eacute;.</p>
<p>
<a name="Section_finding_information_1"/>
<b>2.2&nbsp;Trouver l'information</b>
</p>
<p>La meilleure mani&egrave;re d'apprendre &agrave; utiliser une collection Greenstone est de pratiquer. Pas d'inqui&eacute;tude&nbsp;--&nbsp;vous ne pouvez rien casser. Cliquez partout et sans crainte: la plupart des images qui appara&icirc;tront sur votre &eacute;cran r&eacute;agissent aux clics. Si vous maintenez le pointeur de la souris au-dessus d'une image, la plupart des navigateurs afficheront un message qui vous expliquera ce qui se passera si vous cliquez.</p>
<p>Faites l'exp&eacute;rience! Choisissez des mots communs tels que &laquo;le&raquo; (the) ou &laquo;et&raquo; (and) en tant que crit&egrave;res de recherche&nbsp;--&nbsp;voil&agrave; qui devrait fournir des r&eacute;ponses, et vous ne pourrez rien casser.</p>
<p>Les biblioth&egrave;ques num&eacute;riques Greenstone comprennent souvent plusieurs collections distinctes&nbsp;--&nbsp;par exemple, des rapports scientifiques et techniques, des 1#1uvres litt&eacute;raires, des FAQ de l'Internet, des magazines. Le syst&egrave;me de biblioth&egrave;que num&eacute;rique disposera d'une page d'accueil qui vous permettra d'acc&eacute;der &agrave; toute collection publiquement accessible; de plus, chaque collection dispose de sa propre page &laquo;&agrave; propos&raquo; qui vous fournira toutes les informations relatives &agrave; l'organisation de la collection et aux principes guidant ce qui y est inclus. Pour retrouver cette page &agrave; tout moment, cliquez simplement sur l'icone de &laquo;collection&raquo; qui appara&icirc;t dans le coin sup&eacute;rieur gauche de toutes les pages de recherche et de navigation.</p>
<p>La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">1</a> pr&eacute;sente une copie d'&eacute;cran de la collection &laquo;Demo&raquo;, fournie avec le logiciel Greenstone, et qui repr&eacute;sente un tout petit sous-ensemble de la collection de biblioth&egrave;que de d&eacute;veloppement pour l'humanit&eacute;; nous l'utiliserons comme r&eacute;f&eacute;rence pour la description des diff&eacute;rentes mani&egrave;res de trouver de l'information. Si vous ne trouvez pas la collection &laquo;Demo&raquo;, utilisez &agrave; la place la biblioth&egrave;que de d&eacute;veloppement pour l'humanit&eacute;: elle lui ressemble en tous points. D'abord, on peut cliquer sur presque toutes les icones. Plusieurs icones apparaissent au sommet de la plupart des pages; le tableau&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">1</a> explique leur signification.</p>
<p>
<b>Figure&nbsp;1&nbsp; Utilisation de la collection &laquo;Demo&raquo;</b> </p>
<p>
<img src="embedded:image1.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_1.png"/>
</p>
<p>

</p>
<p>
<b>Table&nbsp;1&nbsp; Signification des icones situ&eacute;es au sommet de chaque page </b>
</p>
<table>
<tbody>
<tr>	<td>
<p>
<img src="embedded:image2.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_1.png"/>
</p>
</td>	<td>
<p>Vous emm&egrave;ne sur la page &laquo;&agrave; propos&raquo;</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image3.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_2.png"/>
</p>
</td>	<td>
<p>Vous emm&egrave;ne sur la page d'accueil de la biblioth&egrave;que num&eacute;rique, depuis laquelle vous pourrez choisir une autre collection</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image4.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_3.png"/>
</p>
</td>	<td>
<p>Fournit un texte d'aide similaire au pr&eacute;sent </p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image5.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_4.png"/>
</p>
</td>	<td>
<p>Vous permet de mettre en place des options d'interface utilisateur et de recherche qui seront d&egrave;s lors s&eacute;lectionn&eacute;es</p>
</td>
</tr>
</tbody>
</table>
<p>
</p>
<p>La barre situ&eacute;e juste dessous, intitul&eacute;e &laquo;recherche ... th&egrave;mes ... titres a-z ... organisation ... comment faire&raquo; vous donne acc&egrave;s aux fonctionnalit&eacute;s de recherche et de navigation. Le bouton le plus &agrave; gauche sert aux recherches, et les autres boutons&nbsp;--&nbsp;au nombre de quatre dans la cette collection&nbsp;--&nbsp;&eacute;voquent plusieurs types de navigation. Ces quatre derniers boutons peuvent varier d'une collection &agrave; l'autre.</p>
<p>
<a name="Subsection_how_to_find_information"/>
<b>Comment trouver de l'information</b>
</p>
<p>Le tableau&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">2</a> montre les cinq mani&egrave;res de trouver de l'information dans la collection &laquo;Demo&raquo;.</p>
<p>
<b>Table&nbsp;2&nbsp; Signification des icones de la barre de recherche/navigation </b>
</p>
<table>
<tbody>
<tr>	<td>
<p>
<img src="embedded:image6.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_5.png"/>
</p>
</td>	<td>
<p>Recherche de mots-clefs particuliers</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image7.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_6.png"/>
</p>
</td>	<td>
<p>Acc&egrave;s aux publications par th&egrave;me</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image8.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_7.png"/>
</p>
</td>	<td>
<p>Acc&egrave;s aux publications par titre</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image9.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_8.png"/>
</p>
</td>	<td>
<p>Acc&egrave;s aux publications par organisation</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image10.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_9.png"/>
</p>
</td>	<td>
<p>Acc&egrave;s aux publications par listes de &laquo;comment faire&raquo;</p>
</td>
</tr>
</tbody>
</table>
<p>
</p>
<p>Vous pouvez <i>rechercher des mots-clefs particuliers</i>dans le corps du texte &agrave; partir de la page de &laquo;recherche&raquo; (semblable en tous points &agrave; la page &laquo;&agrave; propos&raquo; pr&eacute;sent&eacute;e dans la figure <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">1</a>, &agrave; ceci pr&egrave;s qu'elle ne contient pas la mention &agrave; propos de cette collection). On atteint la page de recherche en cliquant sur le bouton Rechercher. Vous pouvez<i>acc&eacute;der aux publications par th&egrave;me</i>en cliquant sur le bouton Th&egrave;mes. Ceci affiche une liste de th&egrave;mes, repr&eacute;sent&eacute;s par des &eacute;tag&egrave;res qu'on peut ensuite d&eacute;velopper en cliquant dessus. Vous pouvez<i>acc&eacute;der aux publications par titre</i>en cliquant sur le bouton titres a-z. Ceci affiche une liste de livres par ordre alphab&eacute;tique. Vous pouvez<i>acc&eacute;der aux publications par organisation</i>en cliquant sur le bouton organisation. Ceci affiche une liste d'organisations. Vous pouvez<i>acc&eacute;der aux publications par liste de &laquo;comment faire&raquo;</i>en cliquant sur le bouton comment faire. Ceci affiche une liste de &laquo;comment faire&raquo;. Tous ces boutons sont visibles dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">1</a>.</p>
<p>
<a name="Subsection_how_to_read_the_documents"/>
<b>Comment lire les documents</b>
</p>
<p>Dans la collection &laquo;Demo&raquo;, on sait qu'on est arriv&eacute; &agrave; un livre particulier quand on voit appara&icirc;tre la photographie de sa couverture (comme sur la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">2</a>). Une table des mati&egrave;res jouxte cette image: la ligne en gras marque l'endroit courant, qui est dans le cas pr&eacute;sent Introduction and Summary (&laquo;introduction et r&eacute;sum&eacute;&raquo;), c'est-&agrave;-dire la premi&egrave;re section du livre consid&eacute;r&eacute;. On peut d&eacute;velopper cette table des mati&egrave;res: cliquer sur les dossiers aura pour effet de les ouvrir ou de les fermer. Cliquer sur le livre ouvert au sommet le fermera.</p>
<p>Vient ensuite le texte de la section courante (The international demand for tropical butterflies...&nbsp;--&nbsp;&laquo;la demande internationale en papillons tropicaux...&raquo; dans l'exemple cit&eacute;, juste sous l'illustration). &Agrave; la fin de la lecture, des fl&egrave;ches vous proposeront de passer &agrave; la section suivante ou de revenir sur la section pr&eacute;c&eacute;dente.</p>
<p>Sous la photographie, on trouve quatre boutons. Cliquer sur D&eacute;tacher cr&eacute;era une nouvelle fen&ecirc;tre de navigateur pour ce seul livre (ce qui est utile si on souhaite comparer des livres, ou en lire plusieurs &agrave; la fois). Si vous avez atteint ce livre suite &agrave; une op&eacute;ration de recherche, les termes de la recherche seront mis en valeur: le bouton Supprimer la mise en &eacute;vidence d&eacute;sactive cette fonctionnalit&eacute;. Cliquer sur D&eacute;velopper le texte d&eacute;veloppera tout le texte de la section ou du livre en cours. Cliquer sur D&eacute;velopper le contenu pr&eacute;sentera toute la table des mati&egrave;res du livre, de sorte que vous pourrez voir les titres de tous les chapitres et sous-sections.</p>
<p>Dans certaines collections, les documents ne disposent pas d'une telle structure hi&eacute;rarchique. Dans ce cas, aucune table des mati&egrave;res n'est affich&eacute;e lorsque l'on parvient sur un document particulier&nbsp;--&nbsp;on ne dispose alors que du texte du document. Dans certains cas, le document est divis&eacute; en pages, qu'on peut alors lire dans l'ordre, ou passer d'une page &agrave; une autre.</p>
<p>
<b>Figure&nbsp;2&nbsp; Un livre de la collection &laquo;Demo&raquo;</b> </p>
<p>
<img src="embedded:image11.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_2.png"/>
</p>
<p>
<a name="Subsection_what_the_icons_mean"/>

</p>
<p>
<b>Signification des icones</b>
</p>
<p>Lorsque vous naviguerez dans la collection, vous trouverez les &eacute;l&eacute;ments pr&eacute;sent&eacute;s au tableau&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a>.</p>
<p>
<a name="Subsection_how_to_search_for_particular_"/>
<b>Comment rechercher des mots-clefs particuliers</b>
</p>
<p>&Agrave; partir de la page de recherche, suivez les &eacute;tapes suivantes pour effectuer une requ&ecirc;te:</p>
<p>Sp&eacute;cifiez les unit&eacute;s concern&eacute;es par la recherche: dans la collection &laquo;Demo&raquo; vous pouvez effectuer des recherches dans les titres des sections ou dans le corps du texte des livres. </p>
<p>Pr&eacute;cisez si vous souhaitez rechercher tout ou partie des mots-clefs indiqu&eacute;s. </p>
<p>Tapez les mots que vous souhaitez rechercher dans la bo&icirc;te de requ&ecirc;te. </p>
<p>Cliquez sur le bouton D&eacute;buter la recherche. </p>
<p>Lorsque vous effectuez une requ&ecirc;te, les titres des documents correspondants seront pr&eacute;sent&eacute;s par paquets de 20 au maximum. Un bouton situ&eacute; &agrave; la fin vous emm&eacute;nera aux 20 suivants, d'o&ugrave; d'autres boutons vous emm&eacute;neront aux 20 suivants, ou vous permettront de revenir 20 premiers, et ainsi de suite. Cependant, des soucis d'efficacit&eacute; ont dict&eacute; le choix d'un maximum de 100 documents renvoy&eacute;s pour toute requ&ecirc;te. Vous pourrez changer ces nombres en cliquant sur le bouton pr&eacute;f&eacute;rences situ&eacute; au sommet de la page.</p>
<p>
<b>Table&nbsp;3&nbsp; Icones que vous rencontrerez lors de la navigation </b>
</p>
<table>
<tbody>
<tr>	<td>
<p>
<img src="embedded:image12.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_10.png"/>
</p>
</td>	<td>
<p>Cliquez sur l'icone d'un livre pour lire le livre correspondant</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image13.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_11.png"/>
</p>
</td>	<td>
<p>Cliquez sur une &eacute;tag&egrave;re pour examiner les livres relatifs &agrave; ce th&egrave;me</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image14.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_12.png"/>
</p>
</td>	<td>
<p>Visualiser ce document</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image15.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_13.png"/>
</p>
</td>	<td>
<p>Ouvrir ce dossier et visualiser son contenu</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image16.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_14.png"/>
</p>
</td>	<td>
<p>Cliquez sur cette icone pour fermer le livre</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image17.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_15.png"/>
</p>
</td>	<td>
<p>Cliquez sur cette icone pour fermer le dossier</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image18.gif" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_16.gif"/>
</p>
</td>	<td>
<p>Cliquez sur la fl&egrave;che pour continuer vers la prochaine section...</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image19.gif" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_17.gif"/>
</p>
</td>	<td>
<p>...ou pour revenir &agrave; la section pr&eacute;c&eacute;dente</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image20.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_18.png"/>
</p>
</td>	<td>
<p>Ouvrir cette page dans une nouvelle fen&ecirc;tre</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image21.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_19.png"/>
</p>
</td>	<td>
<p>D&eacute;velopper la table des mati&egrave;res</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image22.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_20.png"/>
</p>
</td>	<td>
<p>Afficher tout le texte</p>
</td>
</tr>
<tr>	<td>
<p>
<img src="embedded:image23.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Icon_21.png"/>
</p>
</td>	<td>
<p>Mettre en valeur les termes de la recherche</p>
</td>
</tr>
</tbody>
</table>
<p>
</p>
<p>Cliquer sur le titre de tout document ou sur la petite icone qui le jouxte aura pour effet de l'ouvrir. L'icone peut repr&eacute;senter un livre, un dossier, ou une page: ce sera un livre si vous recherchez parmi des livres; dans le cas contraire, si vous recherchez parmi des sections, ce sera une icone de dossier ou de page selon que la section trouv&eacute;e dispose ou non de sous-sections.</p>
<p>
<b>
<i>Termes de la recherche </i>
</b>
</p>
<p>Ce que vous taperez dans la bo&icirc;te de requ&ecirc;te sera interpr&eacute;t&eacute; comme une liste de mots appel&eacute;e &laquo;termes de la recherche&raquo;. Chaque terme de la recherche ne peut contenir que des lettres de l'alphabet ou des chiffres, et les termes sont s&eacute;par&eacute;s par des blancs. Tous les autres caract&egrave;res apparaissant, tels que des signes de ponctuation, seront interpr&eacute;t&eacute;s comme des s&eacute;parateurs de termes, exactement comme les blancs. Ils ne seront donc pas pris en compte: vous ne pouvez pas rechercher des mots incluant des signes de ponctuation.</p>
<p>Par exemple, la requ&ecirc;te:</p>
<p>Agro-forestry in the Pacific Islands: Systems for Sustainability (1993)
(&laquo;agriculture-et-for&ecirc;t dans les &icirc;les du Pacifique: syst&egrave;mes de durabilit&eacute; (1993)&raquo;)</p>
<p>sera trait&eacute;e exactement comme:</p>
<p>Agro forestry in the Pacific Islands Systems for Sustainability 1993
(&laquo;agriculture et for&ecirc;t dans les &icirc;les du Pacifique syst&egrave;mes de durabilit&eacute; 1993&raquo;)</p>
<p>
<b>
<i>Types de requ&ecirc;tes </i>
</b>
</p>
<p>On trouve deux types de requ&ecirc;tes:</p>
<p>Des requ&ecirc;tes sur tous les termes. Ces requ&ecirc;tes recherchent des documents (ou des chapitres, ou des titres) qui contiennent tous les termes sp&eacute;cifi&eacute;s. Les documents qui satisfont la requ&ecirc;te sont affich&eacute;s. </p>
<p>Des requ&ecirc;tes sur certains termes. Contentez-vous de lister des termes susceptibles d'appara&icirc;tre dans les documents que vous recherchez. Les documents sont affich&eacute;s par ordre de degr&eacute; de satisfaction de la requ&ecirc;te. Lors du calcul du degr&eacute; de satisfaction d'une requ&ecirc;te: </p>
<p>plus un document contient de termes de recherche, mieux il correspond; </p>
<p>les termes rares sont plus importants que les termes communs; </p>
<p>les documents courts re&ccedil;oivent un score plus &eacute;lev&eacute; que les documents volumineux. </p>
<p>Utilisez autant de termes de recherche que vous le d&eacute;sirez&nbsp;--&nbsp;une phrase compl&egrave;te, ou m&ecirc;me un paragraphe complet. Si vous ne sp&eacute;cifiez qu'un seul terme, le choix d'une requ&ecirc;te sur tous les termes ou sur certains termes n'aura que peu d'importance, &agrave; ceci pr&egrave;s que dans le second cas, les r&eacute;sultats seront tri&eacute;s en fonction de la fr&eacute;quence d'apparition du terme de la recherche.</p>
<p>
<a name="Subsection_scope_of_queries"/>
<b>Port&eacute;e des requ&ecirc;tes</b>
</p>
<p>Dans la plupart des collections vous pourrez choisir parmi diff&eacute;rents index de recherche. On peut trouver par exemple des index des auteurs ou des titres, ou bien des chapitres ou des paragraphes. En g&eacute;n&eacute;ral, tout le document correspondant est renvoy&eacute;, quel que soit l'index de recherche utilis&eacute;.</p>
<p>Si les documents sont des livres, ils seront ouverts &agrave; l'endroit appropri&eacute;.</p>
<p>
<a name="Subsection_advanced_search_features"/>
<b>Fonctionnalit&eacute;s de recherche avanc&eacute;e</b>
</p>
<p>M&ecirc;me si la plupart des besoins de recherche sont satisfaits par ce qui est d&eacute;crit ci-dessus, Greenstone propose des fonctionnalit&eacute;s de recherche avanc&eacute;e. On les active &agrave; partir de la page de pr&eacute;f&eacute;rences, qu'on atteint en cliquant sur le bouton pr&eacute;f&eacute;rences, situ&eacute; au sommet de la page. Apr&egrave;s avoir modifi&eacute; vos pr&eacute;f&eacute;rences, ne revenez pas &laquo;en arri&egrave;re&raquo; dans votre navigateur&nbsp;--&nbsp;cela aurait pour effet d'annuler les modifications. Cliquez plut&ocirc;t sur n'importe lequel des boutons de la barre de recherche/navigation.</p>
<p>
<b>
<i>D&eacute;pendance &agrave; la casse et troncature </i>
</b>
</p>
<p>Lors de la sp&eacute;cification de termes de recherche, on peut d&eacute;cider si les majuscules et minuscules doivent correspondre entre la requ&ecirc;te et le document: c'est la &laquo;d&eacute;pendance &agrave; la casse&raquo;. On peut aussi choisir de ne prendre en compte que les racines des mots et d'ignorer les terminaisons: c'est la &laquo;troncature&raquo;.</p>
<p>Sous Options de recherche dans la page pr&eacute;f&eacute;rences, vous trouverez deux boutons libell&eacute;s ignorer la casse et les majuscules et les minuscules doivent correspondre; ces boutons contr&ocirc;lent la d&eacute;pendance &agrave; la casse. Suivent deux boutons libell&eacute;s ignorer la fin des mots et le mot entier doit correspondre: ils contr&ocirc;lent la troncature.</p>
<p>Si on s&eacute;lectionne par exemple les boutons ignorer la casse et ignorer la fin des mots, la requ&ecirc;te:</p>
<p>African building
(&laquo;Africaine construction&raquo;)</p>
<p>sera trait&eacute;e de la m&ecirc;me mani&egrave;re que:</p>
<p>africa builds
(&laquo;afrique construit&raquo;)</p>
<p>car la majuscule du mot &laquo;African&raquo; sera transform&eacute;e en minuscule, et car les suffixes &laquo;n&raquo; et &laquo;ing&raquo; seront respectivement &ocirc;t&eacute;s des mots &laquo;African&raquo; et &laquo;building&raquo; (de m&ecirc;me, le suffixe &laquo;s&raquo; serait &ocirc;t&eacute; du mot &laquo;builds&raquo;).</p>
<p>On conseille en g&eacute;n&eacute;ral d'ignorer la casse et les terminaisons sauf dans le cadre de recherches de mots ou d'acronymes particuliers.</p>
<p>
<b>
<i>Recherche de groupes de mots </i>
</b>
</p>
<p>Si votre requ&ecirc;te comprend un groupe de mots entre apostrophes doubles (""), seuls les documents contenant ce groupe de mots, exactement tel que saisi par vous, seront renvoy&eacute;s.</p>
<p>Si vous souhaitez utiliser la recherche de groupes de mots, il vous faut apprendre un peu son fonctionnement. Les groupes de mots sont trait&eacute;s par un examen post-recherche. D'abord, la requ&ecirc;te est effectu&eacute;e de la mani&egrave;re habituelle&nbsp;--&nbsp;tous les mots du groupe de mots sont inclus dans les termes de la recherche&nbsp;--&nbsp;puis les documents renvoy&eacute;s sont examin&eacute;s pour &eacute;liminer ceux o&ugrave; le groupe de mots pr&eacute;cis&eacute; n'appara&icirc;t pas.</p>
<p>Lors de l'examen post-recherche, les groupes de mots sont pris tels qu'ils sont, et ceci inclut tout signe de ponctuation. Par exemple, la requ&ecirc;te:</p>
<p>what's a "post-retrieval scan?"
(qu'est-ce qu'un &laquo;examen post-recherche&raquo;?)</p>
<p>rapatriera d'abord tous les documents correspondant aux mots:</p>
<p>what s a post retrieval scan</p>
<p>puis les documents renvoy&eacute;s seront examin&eacute;s &agrave; la recherche du groupe de mots:</p>
<p>post-retrieval scan?
(examen post-recherche?)</p>
<p>Les recherches de groupes de mots sont ind&eacute;pendantes de la casse si on a s&eacute;lectionn&eacute; le bouton ignorer la casse sur la page pr&eacute;f&eacute;rences.</p>
<p>
<b>
<i>Mode de requ&ecirc;te avanc&eacute; </i>
</b>
</p>
<p>Dans le mode de requ&ecirc;te avanc&eacute;, qu'on peut s&eacute;lectionner sur la page de pr&eacute;f&eacute;rences, les requ&ecirc;tes pour tous les mots, telles que d&eacute;crites ci-dessus, sont en r&eacute;alit&eacute; des requ&ecirc;tes bool&eacute;ennes. Elles consistent en une liste de termes reli&eacute;s par des op&eacute;rateurs logiques &laquo;<i>&amp;</i>&raquo; (et), &laquo;<i>|</i>&raquo; (ou), et &laquo;<i>!</i>&raquo; (non). Toute absence d'op&eacute;rateur entre des termes de recherche sera interpr&eacute;t&eacute;e comme un &laquo;<i>&amp;</i>&raquo; (et): c'est pourquoi une recherche ne pr&eacute;cisant aucun op&eacute;rateur renvoie des documents contenant tous les termes de la requ&ecirc;te.</p>
<p>Si les mots &laquo;AND&raquo;, &laquo;OR&raquo;, et &laquo;NOT&raquo; apparaissent dans votre requ&ecirc;te, ils sont trait&eacute;s comme des termes de recherche ordinaires, et non pas comme des op&eacute;rateurs. Pour utiliser les op&eacute;rateurs il faut pr&eacute;ciser &laquo;<i>&amp;</i>&raquo;, &laquo;<i>|</i>&raquo;, et &laquo;<i>!</i>&raquo;. On peut de plus utiliser des parenth&egrave;ses pour pr&eacute;ciser les priorit&eacute;s.</p>
<p>
<b>
<i>Utiliser l'historique de recherche </i>
</b>
</p>
<p>En activant la fonctionnalit&eacute; d'Historique de la recherche dans la page de pr&eacute;f&eacute;rences, vous aurez acc&egrave;s &agrave; vos derni&egrave;res recherches, ainsi qu'une vue synth&eacute;tique du nombre de r&eacute;sultats qu'elles ont fourni. Cliquez sur le bouton jouxtant l'une des recherches ant&eacute;rieures pour copier le texte de cette recherche dans la bo&icirc;te de requ&ecirc;te. Ceci facilite la r&eacute;p&eacute;tition de versions l&eacute;g&egrave;rement modifi&eacute;es de requ&ecirc;tes pr&eacute;c&eacute;dentes. </p>
<p>
<a name="Section_changing_the_preferences"/>
<b>2.3&nbsp;Changer les pr&eacute;f&eacute;rences</b>
</p>
<p>
<b>Figure&nbsp;3&nbsp; La page de &laquo;pr&eacute;f&eacute;rences&raquo;</b> </p>
<p>
<img src="embedded:image24.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_3.png"/>
</p>
<p>

</p>
<p>Cliquer sur le bouton pr&eacute;f&eacute;rences situ&eacute; en haut de la page vous permettra de modifier certains aspects de l'interface pour qu'elle corresponde mieux &agrave; vos propres souhaits. Les pr&eacute;f&eacute;rences sont propres &agrave; la collection; vous en trouverez un exemple dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a>. Lors de l'ajustement des pr&eacute;f&eacute;rences de recherche, il vaut mieux cliquer sur le bouton Appliquer (illustr&eacute; figure <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a>). Apr&egrave;s le positionnement des pr&eacute;f&eacute;rences, ne revenez pas &laquo;en arri&egrave;re&raquo; dans votre navigateur&nbsp;--&nbsp;cela aurait pour effet d'annuler les modifications. Cliquez plut&ocirc;t sur n'importe lequel des boutons de la barre d'acc&egrave;s, vers le haut de la page.</p>
<p>
<a name="Subsection_collection_preferences"/>
<b>Pr&eacute;f&eacute;rences de collection</b>
</p>
<p>Certaines collections comprennent plusieurs sous-collections, dans lesquelles on peut mener des recherches ind&eacute;pendantes ou group&eacute;es, comme si elles ne formaient qu'une unit&eacute;. Si c'est le cas, vous pouvez choisir quelles sous-collections inclure dans vos recherches dans la page de pr&eacute;f&eacute;rences.</p>
<p>
<a name="Subsection_language_preferences"/>
<b>Pr&eacute;f&eacute;rences de langue</b>
</p>
<p>Chaque collection dispose d'une langue de pr&eacute;sentation par d&eacute;faut, mais vous pouvez choisir une autre langue si tel est votre d&eacute;sir. Vous pouvez aussi modifier l'encodage utilis&eacute; par Greenstone en alimentation de votre navigateur&nbsp;--&nbsp;le logiciel a des valeurs par d&eacute;faut raisonnables, mais un autre encodage fournit de meilleurs r&eacute;sultats sur certains navigateurs. Toutes les collections permettent de passer d'une interface graphique standard &agrave; une interface textuelle. Ceci est particuli&egrave;rement utile pour les mal voyants utilisant de grosses polices &agrave; l'&eacute;cran, ou pour les personnes utilisant un synth&eacute;tiseur vocal sur leur ordinateur.</p>
<p>
<a name="Subsection_presentation_preferences"/>
<b>Pr&eacute;f&eacute;rences de pr&eacute;sentation</b>
</p>
<p>Selon les collections, on peut trouver d'autres options pour contr&ocirc;ler la pr&eacute;sentation. Les collections de pages web vous permettront de supprimer la barre de navigation de Greenstone au sommet de chaque page de document, de telle sorte qu'une recherche vous m&egrave;ne directement &agrave; la page web correspondante, sans en-t&ecirc;te Greenstone. Pour mener une autre recherche il vous faudra revenir &laquo;en arri&egrave;re&raquo; dans votre navigateur. Ces collections vous permettront &eacute;galement de supprimer le message d'avertissement de Greenstone lorsque vous cliquerez sur un lien qui vous m&eacute;nera hors de la collection de biblioth&egrave;ques num&eacute;riques, vers le web. Enfin, certaines collections web vous permettront de d&eacute;cider si les liens de la page de R&eacute;sultats de la recherche doivent vous mener directement vers l'URL concern&eacute;e, ou vers une copie de la page au niveau de la biblioth&egrave;que num&eacute;rique.</p>
<p>
<a name="Subsection_search_preferences"/>
<b>Pr&eacute;f&eacute;rences de recherche</b>
</p>
<p>Sous Pr&eacute;f&eacute;rences de recherche dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a>, les deux premiers boutons vous permettent d'obtenir une grosse bo&icirc;te de requ&ecirc;te, de mani&egrave;re &agrave; effectuer facilement des recherches de la taille d'un paragraphe. Dans Greenstone, il est &eacute;tonnamment rapide de rechercher des portions importantes de texte. Les deux paires de boutons suivantes contr&ocirc;lent le type de texte trouv&eacute; par les recherches effectu&eacute;es. Le premier groupe (libell&eacute; Respecter la casse:) contr&ocirc;le la distinction majuscules/minuscules. Le second groupe, La fin des mots:, contr&ocirc;le la prise en compte ou non des fins de mots.</p>
<p>Le prochain couple de boutons vous fera passer en mode de recherche &laquo;avanc&eacute;e&raquo;, tel que d&eacute;crit ci-dessus, ce qui vous permettra de sp&eacute;cifier des requ&ecirc;tes plus pr&eacute;cises en combinant des termes par les op&eacute;rations &laquo;et&raquo; (<i>&amp;</i>), &laquo;ou&raquo; (<i>|</i>), et &laquo;non&raquo; (<i>!</i>). Vous pouvez activer ou d&eacute;sactiver la fonctionnalit&eacute; d'historique de recherche, mentionn&eacute;e pr&eacute;c&eacute;demment. Enfin, vous pouvez contr&ocirc;ler le nombre de r&eacute;sultats renvoy&eacute;s, ainsi que le nombre de r&eacute;sultats pr&eacute;sent&eacute;s sur chaque &eacute;cran, gr&acirc;ce &agrave; la derni&egrave;re entr&eacute;e de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3</a>.</p>
<p>
<b>3&nbsp;Cr&eacute;er une collection Greenstone</b>
</p>
<p>La voie la plus simple pour cr&eacute;er de nouvelles biblioth&egrave;ques est d'utiliser "Greenstone Librarian Interface" (l'Interface Biblioth&eacute;caire de Greenstone), GLI. Cela vous permet de rassembler une s&eacute;rie de documents, importer ou assigner des m&eacute;ta-donn&eacute;es, de les int&eacute;grer dans une collection Greenstone. Elle permet cinq activit&eacute;s de base qui peuvent &ecirc;tre interpol&eacute;es mais qui sont normalement entreprises dans cet ordre:</p>
<p>Copier le document de l'espace fichiers de l'ordinateur, y compris les collections existantes, vers la nouvelle collection. Toute m&eacute;ta-donn&eacute; existante reste "attach&eacute;e" &agrave; ces documents. Des documents peuvent &ecirc;tre collect&eacute;s &agrave; partir du web par le biais d'une fonctionnalit&eacute; de mirroring incorpor&eacute;e. </p>
<p>Enrichir les documents en ajoutant des m&eacute;tadatas suppl&eacute;mentaires &agrave; des documents individuels ou des groupes de documents. </p>
<p>Concevoir la biblioth&egrave;que en d&eacute;terminant son aspect et les fonctionnalit&eacute;s d'acc&egrave;s qu'elle permet. </p>
<p>Mettre sur pied la biblioth&egrave;que en utilisant Greenstone. </p>
<p>Pr&eacute;visualiser la biblioth&egrave;que nouvellement cr&eacute;&eacute;e, qui aura &eacute;t&eacute; install&eacute;e dans votre page Greenstone en tant que collection ordinaire. </p>
<p>"Librarian Interface" (l'Interface Biblioth&eacute;caire) vous permet d'ajouter aux documents ce qu'on appelle m&eacute;ta-donn&eacute;es "externes", des m&eacute;ta-donn&eacute;es rattach&eacute;es au document dans son ensemble. Mais les documents ont souvent besoin d'&ecirc;tre structur&eacute;s en sections et sous sections, et des m&eacute;ta-donn&eacute;es "internes" peuvent &ecirc;tre associ&eacute;es &agrave; chaque partie. Dans Greenstone, des documents sources peuvent &ecirc;tre "marqu&eacute;s" avec cette information, ce qui sera expliqu&eacute; dans la section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3.3</a>.</p>
<p>Enfin, une autre alternative pour la cr&eacute;ation de collections est fournie par le Collecteur "Collector" qui aide &agrave; confectionner de nouvelles collections, de modifier ou d'ajouter des &eacute;l&eacute;ments &agrave; des collections existantes, ou de supprimer des collections. Dans la plupart des cas, le "Librarian Interface" (l'Interface Biblioth&eacute;caire), plus recent, devrait &ecirc;tre utilis&eacute; en lieu et place du collecteur. Ceci sera d&eacute;crit dans la section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">3.4</a>.</p>
<p>Pour utiliser la puissance enti&egrave;re de Greenstone pour construire des collections avanc&eacute;es il faut aussi lire chapitre <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/Develop_fr_all.html">2</a> du Guide de d&eacute;veloppeur.</p>
<p>
<a name="Section_the_librarian_interface"/>
<b>3.1&nbsp;l'Interface du Biblioth&eacute;caire</b>
</p>
<p>Examinons un exemple simple pour expliquer le fonctionnement de l'Interface du Biblioth&eacute;caire de greenstone. Les figures de <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">4</a> &agrave; <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">15</a> sont des captures d'&eacute;cran en divers points durant l'interaction. Cet exemple utilise les documents de la collection DLS "Development Library subset" qui est distribu&eacute;e avec Greenstone. Pour des besoins de l'expos&eacute;, la proc&eacute;dure prend la forme d'un passage simple &agrave; travers les &eacute;tapes &eacute;num&eacute;r&eacute;es ci-dessus. Un mod&egrave;le d'utilisation plus r&eacute;aliste pour les utilisateurs est de passer successivement de l'avant &agrave; l'arrii&egrave;re &agrave; travers les diff&eacute;rentes &eacute;tapes au fur et &agrave; mesure que l'ex&eacute;cution se poursuit.</p>
<p>L'interface biblioth&eacute;caire peut fonctionner dans un de 4 mode: Assistant Biblioth&eacute;caire, Biblioth&eacute;caire, Sp&eacute;cialiste des Systemes Biblioth&eacute;caires, et Expert. Ces modes cotrolent les niveaux de d&eacute;tails dans l'interface, et peut etre chang&eacute; &agrave; travers 'Pr&eacute;f&eacute;rences' par le menu 'Fichier'. Pour consulter cette partie, il faut que l'interface soit dans le mode pr&eacute;-construit, Biblioth&eacute;caire.</p>
<p>
<a name="Subsection_getting_started"/>
<b>D&eacute;marrage</b>
</p>
<p>Lancer le "Librarian Interface" (l'Interface Biblioth&eacute;caire) sous Windows en s&eacute;lectionnant "Greenstone Digital Library" (Biblioth&egrave;que num&eacute;rique de Greenstone) dans la section des Programmes du menu "D&eacute;marrer" et en choisissant "Librarian Interface". SI vous utilisez Unix, taper plut&ocirc;t:</p>
<p>cd ~/gsdl cd gli ./gli.sh</p>
<p>o&ugrave;&nbsp;/gsdl est le r&eacute;pertoire contenant le syst&egrave;me Greenstone. Pour commencer, on peut soit ouvrir une collection existante, soit en d&eacute;buter une nouvelle. La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">4</a> montre l'utilisateur en train de d&eacute;buter une nouvelle collection. Il a s&eacute;lectionn&eacute; "Nouveau" dans le menu Fichier et a commenc&eacute; &agrave; fournir les informations g&eacute;n&eacute;rales sur la collection&nbsp;--&nbsp;son titre, l'adresse &eacute;lectronique de la personne responsable et une description sommaire du contenu, dans une fen&ecirc;tre pop up. Le titre de la collection est une courte expression utilis&eacute;e dans la biblioth&egrave;que num&eacute;rique pour identifier le contenu de la collection : les collections existantes ont des noms tels que Biblioth&egrave;que de la nourriture et de l'alimentation, Biblioth&egrave;que de l'environnement Mondial et ainsi de suite. Lorsque vous tapez le titre, le syst&egrave;me attribue un identificateur mn&eacute;motechnique unique, le "nom" de la collection, pour un usage interne (Vous pouvez le changer si vous voulez). L'adresse &eacute;lectronique pr&eacute;cise le premier point de contact pour tout probl&egrave;me rencontr&eacute; avec la collection.</p>
<p>La description sommaire est une d&eacute;claration qui d&eacute;crit les principes qui gouvernent ce qui est inclus dans la collection. Il appara&icirc;t sous le titre "&Agrave; propos de cette collection" sur la page initiale de la collection.</p>
<p>
<b>Figure&nbsp;4&nbsp; Cr&eacute;ation d'une nouvelle collection</b> </p>
<p>
<img src="embedded:image25.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_4.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;5&nbsp; Exploration de l'espace de fichiers local</b> </p>
<p>
<img src="embedded:image26.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_5.png"/>
</p>
<p>

</p>
<p>A ce point, l'utilisateur d&eacute;cide soit de baser la nouvelle collection sur la structure d'une collection existante, soit de cr&eacute;er une collection d'un type totalement nouveau. Dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">4</a>, il a choisi de la baser sur la collection DLS " Development Library Subset ". Cela implique que la s&eacute;rie de m&eacute;ta-donn&eacute;es "DLS" qui est utilis&eacute;e dans cette collection sera utilis&eacute;e dans la nouvelle collection. (En fait, cette s&eacute;rie de m&eacute;ta-donn&eacute;es a &eacute;t&eacute; utilis&eacute;e pour mettre sur pied plusieurs collections Greenstone qui partagent une structure et une organisation communes mais avec un contenu diff&eacute;rent, comme les collections DLS "Development Library Subset" et la collection de d&eacute;monstration fournies comme mod&egrave;les avec Greenstone.</p>
<p>Le jeu de m&eacute;ta-donn&eacute;es de DLS contient les &eacute;l&eacute;ments suivants:</p>
<p>Titre </p>
<p>Sujet </p>
<p>Langue </p>
<p>Organisation </p>
<p>Mot-cl&eacute; (c.-&agrave;-d. "Howto") </p>
<p>(En plus, il y a un &eacute;l&eacute;ment de m&eacute;ta-donn&eacute;e appel&eacute; "AZList" qui est utilis&eacute; pour d&eacute;terminer la case de la liste alphab&eacute;tique qui contient le titre du document, avec des valeurs comme "A-B" ou "C-D-E". Ceci est utilis&eacute; pour avoir un contr&ocirc;le pr&eacute;cis sur les divisons &agrave; l'int&eacute;rieur de la liste. Pour la plupart des autres collections il est absent, et Greenstone attribue lui-m&ecirc;me les r&eacute;cipients.)</p>
<p>Si, au contraire, l'utilisateur avait choisi utilise "Nouvelle collection" &agrave; ce stade, il lui est demand&eacute; de s&eacute;lectionner jeux de m&eacute;ta-donn&eacute;es qui doivent &ecirc;tre utilis&eacute;s dans la nouvelle collection. Trois jeux standard sont pr&eacute;-fournis: "Dublin Core", le jeu de m&eacute;ta-donn&eacute;es DLS mentionn&eacute;e ci-dessus et un jeu qui comprend les &eacute;l&eacute;ments de m&eacute;ta-donn&eacute;es extraits automatiquement par Greenstone &agrave; partir des documents de la collection. L'utilisateur peut aussi cr&eacute;er de nouveaux jeux de m&eacute;ta-donn&eacute;es en utilisant un paneau popup activ&eacute; &agrave; travers le menu "metadata" (m&eacute;ta-donn&eacute;es).</p>
<p>Plusieurs jeux de m&eacute;ta-donn&eacute;es diff&eacute;rents peuvent &ecirc;tre associ&eacute;s &agrave; la m&ecirc;me collection; le syst&egrave;me les maintient distinctes (si bien que par exemple, des documents peuvent avoir &agrave; la fois un titre "Dublin Core" et un titre DLS). Les diff&eacute;rents jeux sont clairement distingu&eacute;es dans l'interface. Dans les coulisses, les jeux de m&eacute;ta-donn&eacute;es sont repr&eacute;sent&eacute;s en XML.</p>
<p>
<a name="Subsection_assembling_the_source_materia"/>
<b>Assemblage du mat&eacute;riel source</b>
</p>
<p>Apr&egrave;s avoir cliqu&eacute; sur le bouton "OK" du popup "Nouvelle collection", les parties restantes de l'interface, qui &eacute;taient grises avant, deviennent actives. Le panneau "Rassembler", s&eacute;lectionn&eacute; par l'onglet &eacute;ponyme en haut de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">4</a>, est initialement affich&eacute;. Ceci permet &agrave; l'utilisateur d'explorer l'espace de fichiers local et les collections existantes tout en rassemblant les documents choisis pour la nouvelle collection. Le panneau est divis&eacute; en deux sections, celle de gauche pour naviguer parmi les structures existantes et celle de droite pour les documents dans la collection.</p>
<p>Les op&eacute;rations disponibles &agrave; cette &eacute;tape sont:</p>
<p>Navigation dans la hi&eacute;rarchie de la structure existante des fichiers, et dans celle qui est en cours de cr&eacute;ation, de la mani&egrave;re usuelle. </p>
<p>"Glisser-coller" de fichiers dans la nouvelle collection. </p>
<p>S&eacute;lection multiple de fichiers. </p>
<p>"Glisser-coller" de sous-hi&eacute;rarchies enti&egrave;res. </p>
<p>Suppression de documents de la collection naissante. </p>
<p>Cr&eacute;ation de nouvelles sous-hi&eacute;rarchies &agrave; l'int&eacute;rieur de la collection. </p>
<p>Filtrage des fichiers visibles aussi bien dans le syst&egrave;me de fichiers local que dans la collection; filtrage bas&eacute; sur des groupes pr&eacute;d&eacute;termin&eacute;s ou sur des termes contenus dans des fichiers. </p>
<p>Invocation du programme appropri&eacute; pour afficher les contenus du fichier s&eacute;lectionn&eacute; en le double-cliquant. </p>
<p>Une attention particuli&egrave;re est prise pour traiter les collisions de noms identiques quand des fichiers de m&ecirc;me nom dans diff&eacute;rentes parties de la structure de r&eacute;pertoires de l'ordinateur sont copi&eacute;s dans le m&ecirc;me r&eacute;pertoire de la collection.</p>
<p>Dans la figure <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">5</a>, l'utilisateur utilise l'affichage interactif de l'arborescence des fichiers pour explorer le syst&egrave;me local de fichiers. A ce stade, la collection sur la droite est vide; l'utilisateur la remplit en op&eacute;rant un "glisser-coller" des fichiers d'int&eacute;r&ecirc;t du panneau de gauche vers le panneau de droite. De tels fichiers sont "copi&eacute;s" plut&ocirc;t que "d&eacute;places": de cette fa&ccedil;on, le syst&egrave;me de fichiers original n'est pas perturb&eacute;. Les techniques usuelles de s&eacute;lection multiple, de "glisser-coller", de structuration de la nouvelle collection en cr&eacute;ant des sous-r&eacute;pertoires et de suppression de fichiers en les d&eacute;pla&ccedil;ant vers la corbeille, sont toutes disponibles.</p>
<p>
<a name="fnref1"/>Les collections existantes sont repr&eacute;sent&eacute;es par un sous-r&eacute;pertoire &agrave; gauche appel&eacute; "Collections Greenstone", qui peut &ecirc;tre ouvert et explor&eacute; comme tout autre r&eacute;pertoire. Cependant, les documents qui s'y trouvent diff&egrave;rent des fichiers ordinaires parce qu'ils ont des m&eacute;ta-donn&eacute;es qui leurs sont attach&eacute;es et ceci est conserv&eacute; quand ils sont d&eacute;plac&eacute;s vers une nouvelle collection. Des conflits peuvent arriver lorsque des m&eacute;ta-donn&eacute;es ont &eacute;t&eacute; assign&eacute;es en utilisant un jeu de m&eacute;ta-donn&eacute;es diff&eacute;rent de celui en cours d'utilisation, et il revient &agrave; l'utilisateur de les r&eacute;soudre. Dans la figure <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">6</a>, l'utilisateur a s&eacute;lectionn&eacute; des documents &agrave; partir de la collection existante et les a ajout&eacute;s &agrave; la nouvelle collection. La fen&ecirc;tre pop up explique que l'organisation des &eacute;l&eacute;ments de m&eacute;ta-donn&eacute;es ne peut pas &ecirc;tre automatiquement import&eacute;e, et demande &agrave; l'utilisateur soit de s&eacute;lectionner un jeu de m&eacute;ta-donn&eacute;es et de cliquer sur "Ajouter" pour ajouter l'&eacute;l&eacute;ment de m&eacute;ta-donn&eacute;es &agrave; ce jeu[1], soit de choisir un jeu de m&eacute;ta-donn&eacute;es, puis un &eacute;l&eacute;ment et ensuite cliquer sur "Fusionner" pour renommer l'ancien &eacute;l&eacute;ment de m&eacute;ta-donn&eacute;e en l'&eacute;l&eacute;ment nouveau en fusionnant les deux. Les m&eacute;ta-donn&eacute;es dans les documents suivants de la m&ecirc;me collection subiront la m&ecirc;me manipulation.</p>
<p>Lorsque des ensembles importants de fichiers sont s&eacute;lectionn&eacute;s, d&eacute;pos&eacute;s par un "glisser-coller" dans la nouvelle collection, l'op&eacute;ration de copie peut prendre quelque temps surtout quand il y a conversion de m&eacute;ta-donn&eacute;es. Pour indiquer la progression de l'op&eacute;ration, l'interface montre le fichier qui est en train d'&ecirc;tre copi&eacute; et le pourcentage de fichiers d&eacute;j&agrave; trait&eacute;s.</p>
<p>Des fonctionnalit&eacute;s sp&eacute;ciales sont fournies pour le traitement de gros jeux de fichiers. Par exemple, l'utilisateur peut choisir de filtrer l'arborescence des fichiers pour afficher seulement certains fichiers, en utilisant un menu d&eacute;roulant de types de fichier affich&eacute; en dessous des arborescences. Dans la figure <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">7</a>, on montre seulement les fichiers HTM et HTML (et seuls ces fichiers seront copi&eacute;s par l'op&eacute;ration "glisser-coller".</p>
<p>
<a name="Subsection_enriching_the_documents"/>
<b>Enrichir les documents</b>
</p>
<p>La prochaine &eacute;tape dans la construction d'une collection consiste &agrave; enrichir les documents en y ajoutant des m&eacute;ta-donn&eacute;es. L'onglet "Enrichir" affiche un nouveau panneau d'information (figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">8</a>), qui montre l'arborescence de documents repr&eacute;sentant la collection sur la gauche, et permet, sur la droite, l'ajout de m&eacute;ta-donn&eacute;es datas &agrave; des documents individuels ou des groupes de documents.</p>
<p>Les documents qui sont copi&eacute;s durant la premi&egrave;re &eacute;tape viennent avec des m&eacute;ta-donn&eacute;es quelcoques qui leurs sont associ&eacute;es. Si un document est une partie de la collection Greenstone, des m&eacute;ta-donn&eacute;es pr&eacute;c&eacute;demment d&eacute;finies sont transf&eacute;r&eacute;es vers la nouvelle collection. Il est &eacute;vident que la nouvelle collection peut avoir un jeu diff&eacute;rente de m&eacute;ta-donn&eacute;es ou, peut &ecirc;tre tout juste un sous-ensemble des m&eacute;ta-donn&eacute;es d&eacute;finies, et seules les m&eacute;ta-donn&eacute;es qui appartiennent au jeu de la nouvelle collection sont transf&eacute;r&eacute;es. La r&eacute;solution de tels conflits peut n&eacute;cessiter l'intervention de l'utilisateur par le biais d'un dialogue suppl&eacute;mentaire (figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">6</a>). Tous les choix faits sont enregistr&eacute;s et appliqu&eacute;s pour des copies de fichiers ult&eacute;rieures.</p>
<p>Le panneau Enrich permet l'assignation de valeurs de meta-donn&eacute;es aux documents de la collection. Par exemple, de nouvelles valeurs peuvent &ecirc;tre ajout&eacute;es au jeu de valeurs d&eacute;j&agrave; existantes pour un &eacute;l&eacute;ment. Si les valeurs de l'&eacute;l&eacute;ment ont une structure hi&eacute;rarchique, la structure peut &ecirc;tre &eacute;tendue de la m&ecirc;me mani&egrave;re.</p>
<p>
<b>Figure&nbsp;6&nbsp; Importation de m&eacute;ta-donn&eacute;es existantes</b> </p>
<p>
<img src="embedded:image27.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_6.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;7&nbsp; Filtrage des arborescences de fichiers</b> </p>
<p>
<img src="embedded:image28.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_7.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;8&nbsp; Assignation de m&eacute;ta-donn&eacute;es en utilisant "Enrich"</b> </p>
<p>
<img src="embedded:image29.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_8.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;9&nbsp; Affichage de toutes les m&eacute;ta-donn&eacute;es pour des fichiers s&eacute;lectionn&eacute;s</b> </p>
<p>
<img src="embedded:image30.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_9.png"/>
</p>
<p>

</p>
<p>Des valeurs de m&eacute;ta-donn&eacute;e peuvent aussi &ecirc;tre assign&eacute;s &agrave; des r&eacute;pertoires, exactement de la m&ecirc;me mani&egrave;re. Les documents dans ces r&eacute;pertoires pour lesquels cette m&eacute;ta-donn&eacute;e n'est pas sp&eacute;cifi&eacute;e, h&eacute;ritent les valeurs de la m&eacute;ta-donn&eacute;e. Cependant, elles peuvent &ecirc;tre &eacute;cras&eacute;es par la suite en fournissant des valeurs diff&eacute;rentes pour ces documents.</p>
<p>Les op&eacute;rations &agrave; ce stade comprennent:</p>
<p>Assignation de valeurs de m&eacute;ta-donn&eacute;es nouvelles ou existente aux documents. </p>
<p>Assignation de m&eacute;ta-donn&eacute;e &agrave; un document individuel. </p>
<p>Assignation de m&eacute;ta-donn&eacute;e &agrave; un r&eacute;pertoire ( ceci est h&eacute;rit&eacute; par tous les documents dans le r&eacute;pertoire, y compris ceux qui sont des sous-r&eacute;pertoires. </p>
<p>Assignation de m&eacute;ta-donn&eacute;e hi&eacute;rarchique dont la structure peut &ecirc;tre mise &agrave; jour de fa&ccedil;on dynamique si cela est n&eacute;cessaire. </p>
<p>Edition et mise &agrave; jour de m&eacute;ta-donn&eacute;e assign&eacute;e. </p>
<p>Revue de m&eacute;ta-donn&eacute;es assign&eacute;es &agrave; une s&eacute;lection de fichiers et r&eacute;pertoires. </p>
<p>Pour notre exemple, dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">8</a> l'utilisateur a s&eacute;lectionn&eacute; le dossier ec121e et a assign&eacute; "Ec courier" comme son organisation de m&eacute;ta-donn&eacute;es. Les boutons pour mettre &agrave; jour et supprimer les m&eacute;ta-donn&eacute;es sont activ&eacute;es suivant les s&eacute;lections effectu&eacute;es.</p>
<p>Durant cette phase d'enrichissement, en fait &agrave; n'importe quel autre moment, l'utilisateur peut choisir d'afficher toutes les m&eacute;ta-donn&eacute;es qui ont &eacute;t&eacute; assign&eacute;es aux documents de la collection. Ceci est fait en s&eacute;lectionnant une s&eacute;rie de documents et en choisissant "M&eacute;ta-donn&eacute;es assign&eacute;es" &agrave; partir du menu des jeux de m&eacute;ta-donn&eacute;es, ce qui ouvre une fen&ecirc;tre popup comme celle de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">9</a> qui montre les m&eacute;ta-donn&eacute;es sous forme d'un tableau. Pour les grandes collections, il est utile de pouvoir afficher les m&eacute;ta-donn&eacute;es associ&eacute;es &agrave; certains types de documents seulement, et quand l'utilisateur a sp&eacute;cifi&eacute; un filtre de fichiers comme mentionn&eacute; ci-dessus, seuls les documents s&eacute;lectionn&eacute;s sont visibles dans l'affichage des m&eacute;ta-donn&eacute;es.</p>
<p>Le panneau dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">10</a> permet &agrave; l'utilisateur d'&eacute;diter les jeux de m&eacute;ta-donn&eacute;es. Ici, l'utilisateur regarde l'&eacute;l&eacute;ment "Subject" du jeu DLS. Les valeurs de cet &eacute;l&eacute;ment forment une hi&eacute;rarchie, et l'utilisateur est en train d'examiner et peut &ecirc;tre de changer la liste des valeurs qui lui sont assign&eacute;es. Le m&ecirc;me panneau permet de changer le "profil" pour la mise en correspondance des &eacute;l&eacute;ments d'un jeu de m&eacute;ta-donn&eacute;es l'autre. Ce profil est cr&eacute;&eacute; au cours de l'importation de documents &agrave; partir de collections qui ont des m&eacute;ta-donn&eacute;es pr&eacute;-assign&eacute;es.</p>
<p>
<b>Figure&nbsp;10&nbsp; Edition deu jeu de m&eacute;ta-donn&eacute;es</b> </p>
<p>
<img src="embedded:image31.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_10.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;11&nbsp; Conception de la collection</b> </p>
<p>
<img src="embedded:image32.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_11.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;12&nbsp; Sp&eacute;cification des plugins &agrave; utiliser</b> </p>
<p>
<img src="embedded:image33.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_12.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;13&nbsp; Configuration des arguments de plugin</b> </p>
<p>
<img src="embedded:image34.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_13.png"/>
</p>
<p>
<a name="Subsection_conception_de_la_collection"/>

</p>
<p>
<b>Conception de la collection</b>
</p>
<p>Le panneau de conception (figure&nbsp;&mdash;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">13</a>) permet la sp&eacute;cification de la structure, l'organisation et la pr&eacute;sentation de la collection qui est en train d'&ecirc;tre cr&eacute;&eacute;e. Comme d&eacute;j&agrave; not&eacute;, le r&eacute;sultat de ce processus est enregistr&eacute; dans le fichier de configuration de la collection "collection configuration file", qui est le moyen pour Greenstone d'exprimer les fonctionnalit&eacute;s requises par une collection. Cette &eacute;tape comprend une s&eacute;rie d'&eacute;crans d'interaction s&eacute;par&eacute;s, chacun traitant un aspect de la conception de la collection. En effet, il sert d'&eacute;quivalent graphique &agrave; l'op&eacute;ration usuelle d'&eacute;dition manuelle du fichier de configuration.</p>
<p>Les op&eacute;rations comprennent:</p>
<p>Revue et &eacute;dition de m&eacute;ta-donn&eacute;es de niveau collection, telles que titre, auteur et acc&egrave;s public &agrave; la collection. </p>
<p>D&eacute;finition des indexes de texte complet &agrave; construire. </p>
<p>Cr&eacute;ation de sous-collections et construction d'indexes &agrave; leur allouer. </p>
<p>Ajout ou suppression de support de langues d'interface pr&eacute;d&eacute;finies. </p>
<p>Construction d'une liste de plugins &agrave; utiliser, et leurs arguments. </p>
<p>Pr&eacute;sentation de la liste &agrave; l'utilisateur pour revue et modification. </p>
<p>Configuration de plugins individuels. </p>
<p>Construction d'une liste de "classificateurs", leurs arguments, affectation et configuration. </p>
<p>Affectation de cha&icirc;nes de formatage &agrave; divers contr&ocirc;les de la collection, en vue de changer son apparence. </p>
<p>Revue des jeux de m&eacute;ta-donn&eacute;es utilis&eacute;s dans la collection ainsi que leurs &eacute;l&eacute;ments. </p>
<p>Dans la figure&nbsp;, l'utilisateur a cliqu&eacute; sur l'onglet "Conception" et &eacute;tudie les informations g&eacute;n&eacute;rales sur la collection, entr&eacute;es lors de la cr&eacute;ation de la nouvelle collection. A gauche, sont list&eacute;s les diff&eacute;rentes facettes que l'utilisateur peut configurer : G&eacute;n&eacute;ral, Plug-ins de document , Type de recherche, Indexes de recherche, Indexes de partition, Recherche inter-collection, Classificateurs de navigation, Fonctionnalit&eacute;s de formatage, Traduction de texte, Jeux de m&eacute;ta-donn&eacute;es. L'apparence et la fonctionnalit&eacute; varient entre celles-ci. Par exemple, en cliquant sur Plug-in, on a l'&eacute;cran de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">12</a> qui vous permet d'ajouter, de supprimer ou de configurer des plugins, et de changer l'ordre dans lequel les plugins sont appliqu&eacute;s aux documents.</p>
<p>Les plugins et les classificateurs disposent de plusieurs arguments ou "Options" que l'utilisateur peut fournir. La bo&icirc;te de dialogue dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">13</a> montre l'utilisateur pr&eacute;cisant des arguments &agrave; certains plugins. Les champs gris&eacute;s deviennent actifs quand l'utilisateur ajoute l'option en cliquant sur la case &agrave; cocher se trouvant &agrave; c&ocirc;t&eacute;. Puisque Greenstone est un syst&egrave;me open-source en croissance continuelle, le nombre d'options tend &agrave; augmenter au fur et &agrave; mesure que les d&eacute;veloppeurs ajoutent de nouvelles fonctionnalit&eacute;s. Pour aider &agrave; y faire face, Greenstone a un programme fonctionnel "Plug-in information " qui liste les options disponibles pour chaque plugin, et le "Librarian Interface" (l'Interface Biblioth&eacute;caire) l'invoque automatiquement pour d&eacute;terminer quelle option montrer. Ceci permet &agrave; l'interface interactive de l'utilisateur de suivre automatiquement les d&eacute;veloppements dans le logiciel.</p>
<p>
<b>Figure&nbsp;14&nbsp; Pr&ecirc;t pour cr&eacute;er la nouvelle collection</b> </p>
<p>
<img src="embedded:image35.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_14.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;15&nbsp; Aper&ccedil;u de la collection nouvellement cr&eacute;&eacute;e</b> </p>
<p>
<img src="embedded:image36.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_15.png"/>
</p>
<p>
<a name="Subsection_building_the_collection"/>

</p>
<p>
<b>Construction de la collection</b>
</p>
<p>Le panneau "Cr&eacute;er" (figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">14</a>) est utilis&eacute; pour construire une collection bas&eacute;e sur les documents et d'assigner des m&eacute;ta-donn&eacute;es. Le plus gros du travail est fait par le code Greenstone lui-m&ecirc;me. L'utilisateur contr&ocirc;le le d&eacute;roulement externe &agrave; travers une s&eacute;rie d'&eacute;crans interactifs, chacun traitant les arguments fournis &agrave; une certaine &eacute;tape du processus de cr&eacute;ation.</p>
<p>L'utilisateur observe la construction en cours &agrave; travers une fen&ecirc;tre qui montre non seulement le texte g&eacute;n&egrave;r&eacute; par les scripts d'importation et de construction d'index, mais aussi par les barres de progression qui indiquent le degr&eacute; global d'ex&eacute;cution de chaque script.</p>
<p>La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">14</a> montre le "Create View" (Affichage Cr&eacute;er). Des options, pouvant &ecirc;tre appliqu&eacute;es pendant la cr&eacute;ation de ce processus, sont montr&eacute;es en haut. L'utilisateur s&eacute;lectionne les valeurs appropri&eacute;es pour les options. La figure illustre un popup "tool tip" (bo&icirc;te &agrave; outils) qui est disponible &agrave; travers l'interface pour expliquer la fonction de chaque argument.</p>
<p>Lorsqu'il est satisfait avec ces arguments, l'utilisateur clique "Construire collection". Greenstone affiche continuellement un texte qui indique le d&eacute;roulement et ceci est montr&eacute; par le biais d'une barre de progression plus informative.</p>
<p>
<a name="Subsection_previewing"/>
<b>Aper&ccedil;u</b>
</p>
<p>Le bouton "Pr&eacute;visualiser la Collection" (figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">14</a>) est utilis&eacute; pour visualiser la collection qui a &eacute;t&eacute; cr&eacute;&eacute;e. L'appui sur ce bouton initiera la page web hebergeant cette collection (figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">15</a>). En pratique, l'aper&ccedil;u montre souvent des d&eacute;fauts dans la conception de la collection ou sur les valeurs individuelles de m&eacute;ta-donn&eacute;es, et l'utilisateur retourne souvent aux &eacute;tapes pr&eacute;c&eacute;dentes pour les corriger. Ce bouton devient actif une fois que la collection a &eacute;t&eacute; cr&eacute;&eacute;e. La collection nouvellement cr&eacute;&eacute;e sera aussi install&eacute;e dans votre page d'accueil Greenstone comme une des collections normales.</p>
<p>
<a name="Subsection_help"/>
<b>Aide</b>
</p>
<p>L'aide en ligne est toujours disponible et elle est obtenue en utilisant l'&eacute;l&eacute;ment "Aide" situ&eacute; &agrave; droite de la principale barre de menu, en haut de chacune des figures. Ceci ouvre un fichier hi&eacute;rarchiquement structur&eacute; du texte d'aide, et il est tenu compte du contexte courant de l'utilisateur pour mettre en relief la section qui est appropri&eacute;e &agrave; l'&eacute;tape actuelle de l'interaction. En plus, comme not&eacute; ci-dessus, &agrave; chaque fois que la souris est maintenue sur tout objet interactif, une petite fen&ecirc;tre popup appara&icirc;t afin de donner un "tool tip" textuel comme illustr&eacute; vers le bas de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">14</a>.</p>
<p>
<a name="Section_librarian_interface_user_guide"/>
<b>3.2&nbsp;L'interface biblioth&eacute;caire du Guide d'Utilisateur</b>
</p>
<p>
<a name="Subsection_startingoff"/>
<b>D&eacute;marrage</b>
</p>
<p>Cette section explique comment cr&eacute;er, charger, enregistrer et supprimer des collections.</p>
<p>
<b>
<i>Cr&eacute;er une nouvelle collection </i>
</b>
</p>
<p>Pour cr&eacute;er la nouvelle collection, ouvrir le menu "Fichier" et choisir "Nouveau". Plusieurs champs doivent &ecirc;tre remplis -- mais leurs valeurs sont susceptibles d'&ecirc;tre modifi&eacute;es &agrave; souhait dans l'affichage de la conception.</p>
<p>"Titre de la collection" est le texte affich&eacute; en haut de la page d'accueil de votre collection. Sa longueur peut &ecirc;tre quelconque.</p>
<p>"Description du contenu" doit d&eacute;crire avec le plus de d&eacute;tails possibles ce que la collection est. Utiliser la touche [Entr&eacute;e] pour la diviser en paragraphes.</p>
<p>On doit enfin sp&eacute;cifier soit que la nouvelle collection aura la m&ecirc;me forme et les m&ecirc;mes jeux de m&eacute;ta-donn&eacute;es que la collection existante, soit qu'elle est initi&eacute;e "Nouvelle collection" par d&eacute;faut.</p>
<p>Cliquer sur "OK" pour cr&eacute;er la collection. Si on choisit "Nouvelle collection", les jeux de m&eacute;ta-donn&eacute;es disponibles sont affich&eacute;es. On peut en choisir plus d'une et en ajouter d'autres ult&eacute;rieurement.</p>
<p>Le clic sur "Annuler" ram&egrave;ne imm&eacute;diatement l'&eacute;cran principal.</p>
<p>
<b>
<i>Enregistrer la Collection </i>
</b>
</p>
<p>Enregistrer r&eacute;guli&egrave;rement votre travail en choisissant "Enregistrer" dans le fichier "Menu". Enregistrer une collection ne signifie pas la rendre pr&ecirc;te &agrave; l'utilisation dans Greenstone (voir "Pour produire votre collection").</p>
<p>L'Interface Biblith&eacute;caire prot&egrave;ge votre travail en l'enregistrant &agrave; la fermeture du programme ou &agrave; l'ouverture d'une autre collection.</p>
<p>Les collections sont enregistr&eacute;es en un fichier choisi pour la collection avec une extension ".col", localis&eacute; dans un r&eacute;pertoire de m&ecirc;me nom &agrave; l'int&eacute;rieur du dossier "collect" de l'installation de Greenstone.</p>
<p>
<b>
<i>Ouvrir une collection existante </i>
</b>
</p>
<p>Pour ouvrir une collection existante, choisir "ouvrir" &agrave; partir du menu "Fichier" pour obtenir le "Pr&ecirc;t &agrave; l'ouverture de la collection". Une liste de vos collections Greenstone appara&icirc;t. En s&eacute;lectionner une pour voir sa description, et cliquer sur "Ouvrir" pour la charger. Si l'on cherche une collection qui est hors du dossier "Collect" de Greenstone, cliquer sur "Parcourir" pour un dialogue avec le syst&egrave;me de fichiers concern&eacute;.</p>
<p>Dans le cas o&ugrave; plusieurs programmes d'Interface Biblioth&eacute;caire de Greenstone sont ex&eacute;cut&eacute;s simultan&eacute;ment, les r&eacute;pertoires concern&eacute;s sont v&eacute;rouill&eacute;s pour pr&eacute;venir une interf&eacute;rence. A l'ouverture d'une collection, un petit fichier de verrouillage temporaire est cr&eacute;&eacute; dans son dossier. Avant d'ouvrir une collection, l'interface Biblioth&eacute;caire v&eacute;rifie qu'aucun fichier de verrouillage n'existe d&eacute;j&agrave;. Le verrouillage d'une collection est indiqu&eacute; par la couleur de son ic&ocirc;ne: verte pour une collection normale, rouge quand elle est v&eacute;rouill&eacute;e. Cependant, quand l'on quitte l'Interface Biblioth&eacute;caire pr&eacute;matur&eacute;ment, le fichier de verrouillage est parfois laiss&eacute; en place. Quand une telle collection est ouverte, l'Interface Biblioth&eacute;caire demande si l'on veut se d&eacute;faire de son contr&ocirc;le. Ne jamais sosutraire une collection en cours d'utilisation par un autre.</p>
<p>Lorsque vous ouvrez une collection qui n'a pas &eacute;t&eacute; cr&eacute;&eacute;e par Greenstone Librarian Interface, on vous demande de s&eacute;lectionner un ou plusieurs jeux de m&eacute;ta-donn&eacute;es. Si vous n'en s&eacute;lectionnez aucun, les m&eacute;ta-donn&eacute;es existantes seront ignor&eacute;es. Dans le cas contraire, les m&eacute;ta-donn&eacute;es seront import&eacute;es comme lorsque vous cliquez et glisser dans des fichiers contenant des m&eacute;ta-donn&eacute;es. Ce processus est d&eacute;crit dans la section "Importer des M&eacute;ta-donn&eacute;es Pr&eacute;-assign&eacute;es".</p>
<p>
<b>
<i>Suppression des collections </i>
</b>
</p>
<p>Pour supprimer d&eacute;finitivement des collections de votre installation Greenstone, choisir "Supprimer..." dans le menu "Fichier". Une liste de vos collections Greenstone appara&icirc;t. Selectionner une collection pour vior sa description, puis cocher la case en bas du dialogue et clicquez "Supprimer" pour supprimer la collection. Cette operation est irr&eacute;versible, v&eacute;rifiez bien que vous n'avez plus besoin de cette collection avant de supprimer!</p>
<p>
<a name="Subsection_downloadingfiles"/>
<b>T&eacute;l&eacute;chargement de fichiers de lIinternet</b>
</p>
<p>La vue "T&eacute;l&eacute;chargement" vous permet de t&eacute;l&eacute;charger des resources de l'internet. Cette section explique le processus de miroir de l'interface biblioth&eacute;caire.</p>
<p>
<b>
<i>La vue T&eacute;l&eacute;chargement </i>
</b>
</p>
<p>Cette section d&eacute;crit comment on configure une tache de t&eacute;l&eacute;chargement et comment on contr&ocirc;le le t&eacute;l&eacute;chargement. Acc&eacute;dez &agrave; la vue "T&eacute;l&eacute;chargement" en cliquant son index. La moiti&eacute; sup&eacute;rieure de l'&eacute;cran montre le contr&ocirc;le des t&eacute;l&eacute;chargements. La moiti&eacute; inf&eacute;rieure est initialement vide, mais montrera la liste des t&eacute;l&eacute;chargements en attente et r&eacute;alis&eacute;s.</p>
<p>Les fichiers sont t&eacute;l&eacute;charg&eacute;s dans un dossier de l'espace de travail appel&eacute; &laquo;&nbsp;Fichiers T&eacute;l&eacute;charg&eacute;s&nbsp;&raquo;, et peut &ecirc;tre utilis&eacute; pour toutes les collections construites avec l'interface biblioth&eacute;caire. Les fichiers dans cette zone portent comme nom leur URL en entier. Un nouveau dossier est cr&eacute;&eacute; pour chaque site h&ocirc;te, suivi par d'autres dossiers pour chaque &eacute;l&eacute;ment du chemin. Cela permet de s'assurer que chaque fichier a un nom distinct.</p>
<p>Utilisez le premier des contr&ocirc;les de la configuration de t&eacute;l&eacute;chargement, &laquo; Source URL &raquo;, pour entrer l'URL de la ressource cible. Utilisez le contr&ocirc;le &laquo; Profondeur de T&eacute;l&eacute;chargement &raquo; pour limiter le nombre de liens hypertextes &agrave; suivre pour le t&eacute;l&eacute;chargement : utiliser 0 pour t&eacute;l&eacute;charger une seule page ; utiliser 1 pour t&eacute;l&eacute;charger la page et toutes les pages r&eacute;f&eacute;renc&eacute;es par des liens hypertextes. La profondeur limite est ignor&eacute;e lors du t&eacute;l&eacute;chargement de m&eacute;dia autres que des pages html. Ensuite il y a plusieurs cases &agrave; cocher qui peuvent &ecirc;tre coch&eacute;es pour activer l'option sp&eacute;cifi&eacute;e. Une fois la configuration pr&ecirc;te, cliquez &laquo; T&eacute;l&eacute;charger &raquo; pour d&eacute;marrer l'op&eacute;ration de t&eacute;l&eacute;chargement. Il y a deux autres boutons de contr&ocirc;le : &laquo; Pr&eacute;f&eacute;rences &raquo;, qui renvoie &agrave; la section connexion de Pr&eacute;f&eacute;rences ou les param&egrave;tre du proxy peuvent &ecirc;tre &eacute;dit&eacute;s ; et &laquo; Effacer la cache &raquo; qui supprimes tous les fichiers t&eacute;l&eacute;charg&eacute;s pr&eacute;c&eacute;demment.</p>
<p>La liste de t&eacute;l&eacute;chargement a une entr&eacute;e pour chaque t&eacute;l&eacute;chargement de page Web. Chaque entr&eacute;e a une r&eacute;gion de textes qui donne les d&eacute;tails de la t&acirc;che avec une barre de progr&egrave;s montrant l'activit&eacute; courante. Trois boutons apparaissent &agrave; la gauche de chaque entr&eacute;e. "Pause" est employ&eacute; pour pauser une t&acirc;che en cours de t&eacute;l&eacute;chargement. "Voir le r&eacute;sum&eacute;" ouvre une fen&ecirc;tre montrant l'historique du t&eacute;l&eacute;chargement. "Fermer" termine le t&eacute;l&eacute;chargement et enl&egrave;ve la t&acirc;che de la liste.</p>
<p>La section "Pr&eacute;f&eacute;rences" explique comment &eacute;tablir une connection Internet &agrave; travers un proxy. Si l'authentification est n&eacute;cessaire, le proxy server demande l'identification et le mot de passe. L'interface biblioth&eacute;caire n'enregistre pas les mots de passe entre les sessions.</p>
<p>
<a name="Subsection_collectingfiles"/>
<b>Collecter les fichiers pour la Collection</b>
</p>
<p>D&egrave;s lors que l'on dispose d'une nouvelle collection, la n&eacute;cessit&eacute; se fait sentir de la doter de fichiers. Ils peuvent provenir de votre espace fichier ordinaire ou d'autres collections Greenstone. Quelques uns peuvent avoir des m&eacute;ta-donn&eacute;es attach&eacute;es.Cette section d&eacute;crit comment importer des fichiers.</p>
<p>
<b>
<i>L'affichage Rassembler </i>
</b>
</p>
<p>cette section introduit la zone Rassembler utilis&eacute;e pour selectionner les fichiers &agrave; inclure dans la collection &agrave; cr&eacute;er. L'Interface Biblioth&eacute;caire d&eacute;marre avec l'affichage "Rassembler". Pour revenir ult&eacute;rieurement &agrave; celui-ci, cliquer directement sur l'onglet "Rassembler" au bas de la barre des menus.</p>
<p>Les deux vastes zones intitul&eacute;es "Espace de travail" et "Collection" servent au transfert des fichiers vers la collection. Elles contiennent des arborescences de fichiers, des structures graphiques qui repr&eacute;sentent des fichiers et des dossiers.</p>
<p>Choisir un &eacute;l&eacute;ment dans l'arborescence en cliquant dessus. (d'autres mani&egrave;res de le faire existent; voir ci-dessous). Double-cliquer sur un dossier, ou cliquer simplement sur le symbole de commutateur plac&eacute; &agrave; c&ocirc;t&eacute; de lui, pour d&eacute;velopper (ou r&eacute;duire) son contenu. Double-cliquer sur un fichier pour l'ouvrir en utilisant un programme d'application associ&eacute; (voir "Associations de fichiers").</p>
<p>L'arbre des fichiers de l'espace de travail montre les sources de donn&eacute;es disponibles pour l'interface biblioth&eacute;caire -- le syst&egrave;me de fichiers local (ainsi que les unit&eacute;s de disques et Cd-rom), le contenu des collection Greenstone, et la cache des fichiers t&eacute;l&eacute;charg&eacute;s. Vous pouvez copier et afficher ces fichiers mais vous ne pouvez pas les d&eacute;placer, supprimer ou &eacute;diter, &agrave; l'exception des fichiers t&eacute;l&eacute;charg&eacute;s qui peuvent &ecirc;tre supprim&eacute;. Vous pouvez naviguer &agrave; l'int&eacute;rieur de cet espace pour trouver les documents que vous souhaitez ajouter &agrave; la collection.</p>
<p>L'arborescence des fichiers de la Collection ne repr&eacute;sente jusque-l&agrave; que le contenu de la collection. Elle est initialement vide.</p>
<p>On peut redimensionner les espaces en positionnant la souris sur la barre grise qui s&eacute;pare les arborescences (le pointeur change de forme) et en la faisant glisser.</p>
<p>En bas de la fen&ecirc;tre, il y a une barre d'&eacute;tat qui montre l'&eacute;volution des op&eacute;rations sur les fichiers (copie, d&eacute;placement et suppression). Ces op&eacute;rations peuvent &ecirc;tre longues. Le bouton "Stop" arr&ecirc;te toute t&acirc;che en cours.</p>
<p>Deux grands boutons occupent le coin droit inf&eacute;rieur de l'&eacute;cran. "Nouveau dossier", avec une image d'un dossier, cr&eacute;e de nouveaux dossiers (voir "Cr&eacute;er des dossiers"). "Supprimer", avec une corbeille, supprime les fichiers. Cliquer sur le bouton "Supprimer" d&eacute;truit tous les fichiers s&eacute;lectionn&eacute;s de l'arborescence de fichiers de la collection. On peut de m&ecirc;me r&eacute;aliser cette suppression de fichiers en les faisant glisser jusqu'au bouton "Supprimer". </p>
<p>Pour s&eacute;lectionner plusieurs s&eacute;quences d'&eacute;l&eacute;ments, s&eacute;lectionner le premier, maintenir appuy&eacute;e la touche [Maj] et cliquer sur le dernier &eacute;l&eacute;ment de la s&eacute;quence -- la s&eacute;lection comprendra tous les &eacute;l&eacute;ments compris entre les deux. Pour la s&eacute;lection de fichiers qui ne se suivent pas, maintenir la touche [Ctrl] appuy&eacute;e en cliquant sur chacun d'eux. Ces deux m&eacute;thodes peuvent &ecirc;tre utilis&eacute;es ensemble pour la s&eacute;lection de jeux d'&eacute;l&eacute;ments non adjacents.</p>
<p>Certains dossiers -- tel que celui contenant vos propres pages Web -- ont parfois une signification sp&eacute;ciale. L'Interface Biblioth&eacute;caire peut appliquer de tels dossiers au premier niveau de l'arborescence de fichiers. Pour ce faire double-cliquer droite sur le dossier vis&eacute;. Choisir "Cr&eacute;er un Raccourci", saisir le nom du dossier. Pour enlever un &eacute;l&eacute;ment, cliquer-droite sur le fichier concern&eacute; et s&eacute;lectionner "Supprimer Raccourci".</p>
<p>
<b>
<i>Cr&eacute;er des dossiers </i>
</b>
</p>
<p>Utiliser les dossiers de l'arborescence de fichiers de la collection pour rejeur les fichiers et les rendre ais&eacute;ment accessibles. Des dossiers peuvent &ecirc;tre plac&eacute;s &agrave; l'int&eacute;rieur d'autres dossiers. Aucune limite, virtuellement parlant, ni au nombre de dossiers dont on peut disposer ni &agrave; la complexit&eacute; de leur agencement.</p>
<p>Pour cr&eacute;er un nouveau dossier, on peut opter pour un dossier existant et cliquer sur le bouton Nouveau Dossier. Le nouveau dossier appara&icirc;t &agrave; l'int&eacute;rieur de celui choisi, ou au niveau sup&eacute;rieur si aucun n'est choisi. Le nom de ce dossier est r&eacute;clam&eacute; ( &agrave; d&eacute;faut, il sera nomm&eacute; "Nouveau Dossier").</p>
<p>Les dossiers peuvent aussi &ecirc;tre cr&eacute;&eacute;s en cliquant sur le dossier avec le bouton droit, et en choisissant "Nouveau Dossier" et proc&eacute;der comme ci-dessus.</p>
<p>
<b>
<i>Ajouter des fichiers </i>
</b>
</p>
<p>Les fichiers peuvent &ecirc;tre copi&eacute;s dans la collection par glisser-d&eacute;placer. Le pointeur &eacute;pouse la forme de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; (ou, si la s&eacute;lection comprend plus d'un, leur nombre). D&eacute;poser la s&eacute;lection dans l'arborescence de la collection pour les y copier (si la source est l'arborescence de l'espace de travail) ou les d&eacute;placer &agrave; l'int&eacute;rieur de la collection (si la source est l'arborescence de la collection).</p>
<p>Lorsque des fichiers multiples sont copi&eacute;s, ils sont tous plac&eacute; dans le dossier cible au m&ecirc;me niveau, quelle que soit la structure du dossier qui les contenait avant. Si vous copier un second fichier avec le m&ecirc;me nom dans le m&ecirc;me dossier, la question de savoir si le premier fichier doit &ecirc;tre &eacute;cras&eacute; est pos&eacute;e. Si la r&eacute;ponse est non, le fichier ne sera pas copi&eacute;, mais les autres le seront. Pour annuler toutes les autre t&acirc;ches de copie, cliquer sur le bouton "Stop".</p>
<p>Seuls les &eacute;l&eacute;ments situ&eacute;s au-dessus dans la s&eacute;lection sont d&eacute;plac&eacute;s. Un dossier est plus &eacute;lev&eacute; que son contenu. On ne peut s&eacute;lectionner en m&ecirc;me temps l'int&eacute;rieur d'un dossier et le dossier lui-m&ecirc;me.</p>
<p>Lorsqu'un fichier est ajout&eacute;, l'Interface Biblioth&eacute;caire cherche les dossiers sources de fichiers auxiliaires contenant une m&eacute;ta-donn&eacute;e qui lui originellement assign&eacute;es et, s'il en trouve, commence &agrave; les importer. Au fur et &agrave; mesure que l'op&eacute;ration se poursuit, une confirmation est faite (peut-&ecirc;tre plusieurs fois) de fournir des informations compl&eacute;mentaires pour ajuster la m&eacute;ta-donn&eacute;e aux jeux de m&eacute;ta-donn&eacute;es de la collection. Ces confirmations sont d&eacute;crites dans la section "Importer des M&eacute;ta-donn&eacute;es Pr&eacute;-assign&eacute;es". Pour une explication plus d&eacute;taill&eacute;e de l'association de m&eacute;ta-donn&eacute;es avec les fichiers, lire le chapitre 2 du Guide de d&eacute;veloppement de Greenstone -- "Exploitez vos documents au maximum".</p>
<p>
<b>
<i>Supprimer des Fichiers </i>
</b>
</p>
<p>Il existe plusieurs m&eacute;thodes pour supprimer des fichiers et des dossiers. On doit d'abord indiquer les &eacute;l&eacute;ments &agrave; supprimer en s&eacute;lectionnant un ou plusieurs fichiers et dossiers comme d&eacute;crit dans "L'affichage Rassembler".</p>
<p>D&egrave;s lors que les fichiers sont s&eacute;lectionn&eacute;s, cliquer sur le bouton "Supprimer" pour les d&eacute;truire, ou appuyer sur la touche [Delete] de votre clavier, ou les glisser-d&eacute;placer de la collection vers le bouton "Supprimer" et les y d&eacute;poser.</p>
<p>
<b>
<i>Filtrer l'arborescence </i>
</b>
</p>
<p>Le "Filtrage" de l'arborescence de la collection permet de r&eacute;duire la recherche de fichiers particuliers.</p>
<p>Le menu d&eacute;roulant des "Montrer Fichiers" ("Show Files") au bas de chaque arborescence montre une liste de filtres pr&eacute;d&eacute;finis, tels "Images". Son choix cache temporairement tous les autres fichiers de l'arborescence. Pour restorer celle-ci, changer le filtre en "Tous Fichiers". Ces op&eacute;rations n'alt&egrave;rent ni la collection, ni n'affectent les dossiers dans l'arborescence.</p>
<p>On peut sp&eacute;cifier un filtre usuel en saisissant un mod&egrave;le assorti aux fichiers vis&eacute;s (syst&egrave;mes Librairiens Sp&eacute;cialistes et modes Experts seulement). Utiliser un syst&egrave;me standard d'abr&eacute;viations de fichiers telles que "*.*" ou "*.doc" (*. concerne tous les caract&egrave;res).</p>
<p>
<a name="Subsection_enrichingacollection"/>
<b>Enrichir la Collection avec des m&eacute;ta-donn&eacute;es</b>
</p>
<p>Apr&egrave;s avoir rassembl&eacute; plusieurs fichiers dans la collection, on les enrichit d'une information compl&eacute;mentaire appel&eacute;e "m&eacute;ta-donn&eacute;e". Cette section explique comment une m&eacute;tadonn&eacute;e est cr&eacute;&eacute;e, &eacute;dit&eacute;e, assign&eacute;e ou retir&eacute;e, et comment utiliser les sources de m&eacute;ta-donn&eacute;es externes (voir aussi le chapitre 2 du Guide de d&eacute;veloppement de Greenstone -- "Exploitez vos documents au maximum").</p>
<p>
<b>
<i>L'affichage Enrichir </i>
</b>
</p>
<p>Utiliser l'affichage Enrichir pour assigner une m&eacute;ta-donn&eacute;e aux documents de la collection. Une m&eacute;ta-donn&eacute;e est une donn&eacute;e sur une donn&eacute;e -- de fa&ccedil;on typique titre, auteur, date de cr&eacute;ation, et ainsi de suite. Chaque &eacute;l&eacute;ment de m&eacute;ta-donn&eacute;e a deux parties: "el&eacute;ment" indique le type d'&eacute;l&eacute;ment (par exemple auteur), "valeur" qui donne la valeur de cette m&eacute;ta-donn&eacute;e &eacute;l&eacute;ment (par exemple le nom de l'auteur).</p>
<p>Sur la gauche de l'affichage "Enrichir" est l'arborescence de la collection. A sa droite, la Table de M&eacute;ta-donn&eacute;es, qui montre les m&eacute;ta-donn&eacute;es pour tous les fichiers et dossiers s&eacute;lectionn&eacute;es de l'arborescence de la collection. Les colonnes sont indiqu&eacute;es en gris en haut, et peuvent &ecirc;tre redimensionn&eacute;es en faisant glisser la ligne de s&eacute;paration. Si plusieurs fichiers sont s&eacute;lectionn&eacute;s, un texte en noir indique que la valeur est commune &agrave; tous les fichiers s&eacute;lectionn&eacute;s, tandis qu'un texte en gris en indique le contraire. les valeurs en noir peuvent &ecirc;tre mises &agrave; jour ou supprim&eacute;es, tandis que celles en gris peuvent &ecirc;tre supprim&eacute;es de ceux qui l'ont, ou ajout&eacute;es aux autres.</p>
<p>Une ic&ocirc;ne de dossier peut appara&icirc;tre &agrave; c&ocirc;t&eacute; de certaines entr&eacute;es de m&eacute;ta-donn&eacute;es. Ceci indique que les valeurs ont &eacute;t&eacute; h&eacute;rit&eacute;es d'un dossier parent. Les m&eacute;ta-donn&eacute;es h&eacute;rit&eacute;es ne peuvent &ecirc;tre &eacute;dit&eacute;es ou supprim&eacute;es, mais seulement ajout&eacute;es ou &eacute;cras&eacute;es. Cliquer sur l'ic&ocirc;ne du dossier pour aller imm&eacute;diatement au dossier o&ugrave; la m&eacute;ta-donn&eacute;e est assign&eacute;e.</p>
<p>Si vous cliquez sur un l'&eacute;l&eacute;ment de metadata du tableau, celui-ci affichera les valeurs existantes pour l' &eacute;l&eacute;ment dans le domaine "Valeurs existantes pour..." en dessous du tableau. Celle-ci, d&eacute;veloppe et comprime. C'est une liste qui, de fa&ccedil;on usuelle, montre toutes les valeurs pr&eacute;c&eacute;demment saisies pour un &eacute;l&eacute;ment s&eacute;lectionn&eacute;. Le clic sur une entr&eacute;e la place automatiquement dans le champ valeur. Inversement, la saisie dans le champ texte s&eacute;lectionne l'entr&eacute;e de l'Arborescence Valeur qui d&eacute;bute avec les caract&egrave;res saisis. Appuyer sur [Tab] compl&egrave;te automatiquement la saisie de la valeur s&eacute;lectionn&eacute;e.</p>
<p>Les valeurs de m&eacute;ta-donn&eacute;e peuvent &ecirc;tre organis&eacute;es en une hi&eacute;rarchie.Ceci est montr&eacute; dans l'Arborescence Valeur utilisant des dossiers de niveau interne. Les valeurs hi&eacute;rarchiques peuvent &ecirc;tre saisies en utilisant le caract&egrave;re "|" pour s&eacute;parer les niveaux. Par exemple, "Cards|Red|Diamonds|Seven" peut &ecirc;tre utilis&eacute; dans une hi&eacute;rarchie qui repr&eacute;sente un jeu de cartes. Cela permet le rejeument des valeurs. Les jeux peuvent aussi &ecirc;trre assign&eacute;s comme m&eacute;ta-donn&eacute;e.</p>
<p>Greenstone extrait automatiquement des m&eacute;ta-donn&eacute;es &agrave; partir des documents en un jeu de m&eacute;ta-donn&eacute;es dont les &eacute;l&eacute;ments sont pr&eacute;fix&eacute;s "ex.". Ceci n'a aucune valeur et ne peut &ecirc;tre &eacute;dit&eacute;.</p>
<p>
<b>
<i>S&eacute;lectionner les jeux de m&eacute;ta-donn&eacute;es </i>
</b>
</p>
<p>Les s&eacute;ries d'&eacute;l&eacute;ments de m&eacute;ta-donn&eacute;es pr&eacute;d&eacute;finis sont connus comme "jeux de M&eacute;ta-donn&eacute;es". "Dublin Core" en est un exemple. Quand on ajoute un Groupe de M&eacute;ta-donn&eacute;es &agrave; la collection, ses &eacute;l&eacute;ments peuvent &ecirc;tre s&eacute;lectionn&eacute;s. On peut avoir plus d'un jeu de m&eacute;ta-donn&eacute;es ; pour &eacute;viter des t&eacute;lescopages de nom, un identificateur abr&eacute;g&eacute; qui identifie le jeu de m&eacute;ta-donn&eacute;es est suspendu au nom de l'&eacute;l&eacute;ment. Par exemple l'&eacute;lement cr&eacute;ateur de Dublin Core devient "dc.Creator". Les jeux de m&eacute;ta-donn&eacute;es sont sauv&eacute;gard&eacute;s dans le dossier de m&eacute;ta-donn&eacute;es de l'Interface Biblioth&eacute;caire et ont le sufixe ".mds".</p>
<p>Pour contr&ocirc;ler les jeux de m&eacute;ta-donn&eacute;es utilis&eacute;s dans une collection, utilisez l'entr&eacute;e "Jeux M&eacute;ta-Donn&eacute;es" sur la vue "Conception".</p>
<p>
<b>
<i>Ajout de Nouvelles M&eacute;ta-donn&eacute;es </i>
</b>
</p>
<p>On ajoute un &eacute;l&eacute;ment m&eacute;ta-donn&eacute;e -- &eacute;l&eacute;ment et valeur &agrave; la fois -- &agrave; un fichier. S&eacute;lectionner d'abord le fichier &agrave; partir de l'arborescence de fichier de la collection situ&eacute;e &agrave; gauche. Cette action entra&icirc;ne l'apparition de toute m&eacute;ta-donn&eacute;e pr&eacute;-assign&eacute;e dans le tableau de droite. </p>
<p>S&eacute;lectionner ensuite l'&eacute;l&eacute;ment m&eacute;ta-donn&eacute;e &agrave; ajouter en cliquant sur sa rang&eacute;e dans le tableau.</p>
<p>Taper la valeur dans le champ valeur. Utilisez le charact&egrave;re "|" pour rapporter une structure, comme d&eacute;crit dans "". Vous pouvez sauver l' information metadata en pressant les touches [Up] ou [Down] et bouger ainsi la s&eacute;lection convenablement. En pressant la touche [Enter] l'information metadata sera sauv&eacute;e et une nouvelle entr&eacute;e vide sera cr&eacute;&eacute;e pour l' &eacute;l&eacute;ment metadata, vous permettant d&eacute;signer multiples valeurs pour un &eacute;l&eacute;ment de metadata.</p>
<p>Vous pouvez aussi ajouter des m&eacute;ta-donn&eacute;es &agrave; un dossier, ou &agrave; plusieurs fichiers s&eacute;lectionn&eacute;s &agrave; la fois. Elle est ajout&eacute;e &agrave; tous les fichiers ou &agrave; l'int&eacute;rieur du dossier ou de la s&eacute;l&eacute;ction, et aux sous-dossiers. Garder &agrave; l'esprit que si des m&eacute;ta-donn&eacute;es sont ajout&eacute;es &agrave; un dossier tous les nouveaux fichiers en son sein h&eacute;rite automatiquement des valeurs du dossier.</p>
<p>
<b>
<i>Ajouter des M&eacute;ta-donn&eacute;es pr&eacute;d&eacute;finies </i>
</b>
</p>
<p>Pour ajouter une m&eacute;ta-donn&eacute;e ayant une valeur existante, s&eacute;lectionner d'abord le fichier, et ensuite la valeur requise &agrave; partir de l'arborescence des valeurs, en d&eacute;veloppant si n&eacute;cessaire les dossiers de hi&eacute;rarchie. La valeur de l'entr&eacute;e s&eacute;lectionn&eacute;e appara&icirc;t automatiquement dans le champ texte Valeur. (Utiliser alternativement la valeur auto-select de l'arborescence et les caract&eacute;ristiques auto-compl&egrave;tes. </p>
<p>La proc&eacute;dure d'ajouter m&eacute;ta-donn&eacute;es avec des valeurs d&eacute;j&agrave; existantes aux dossiers ou aux fichiers multiples est tout &agrave; fait identique.</p>
<p>
<b>
<i>Editant ou &Eacute;liminant M&eacute;ta-donn&eacute;es </i>
</b>
</p>
<p>Pour &eacute;diter ou &eacute;liminer une partie de metadata, premi&egrave;rement selectionnez un fichier convenable, en suite la valeur de la metadata du tableau. Editer la valeur de champ supprimant tout le texte si vous d&eacute;sirez &eacute;liminer la metadata.</p>
<p>Le processus est identique pour la mise &agrave; jour d'un dossier avec des sous-dossiers ou plusieurs fichiers, mais vous pouvez seulement mettre &agrave; jour les m&eacute;ta-donn&eacute;es qui sont communes &agrave; tous les fichiers/dossiers s&eacute;lectionn&eacute;s.</p>
<p>L' arbre de valeurs montre toutes les valeurs actuellement assign&eacute;es de m&ecirc;me que les valeurs pr&eacute;c&eacute;dentes pour la pr&eacute;sente session, toutes les valeurs &eacute;dit&eacute;s ou &eacute;limin&eacute;e seront donc pr&eacute;sentes dans l' arbre. Fermant la collection et la ouvrant encore une fois &eacute;liminera les valeurs qui ne sont plus d&eacute;sign&eacute;es.</p>
<p>
<b>
<i>Passer en revue les M&eacute;ta-donn&eacute;es assign&eacute;es </i>
</b>
</p>
<p>On &eacute;prouve parfois le besoin de voir, &agrave; la fois, les m&eacute;ta-donn&eacute;es affect&eacute;es &agrave; plusieurs ou &agrave; tous les fichiers -- par exemple, pour d&eacute;terminer combien de fichiers sont en cours d'utilisation ou pour avoir une id&eacute;e de la chronologie. </p>
<p>S&eacute;lectionnez les fichiers que vous souhaitez examiner, puis clicquez sur le bouton droit et choisissez "M&eacute;ta-donn&eacute;es Associ&eacute;es...". Une fen&ecirc;tre appel&eacute;e "Toutes les M&eacute;ta-donn&eacute;es", sous forme d'un grand tableau avec plusieurs colonnes, appara&icirc;t. La premi&egrave;re colonne montre les noms de fichiers; les lignes montrent toutes les valeurs de m&eacute;ta-donn&eacute;es assign&eacute;es &agrave; ces fichiers.</p>
<p>Dessiner le tableau peut prendre quelque temps si plusieurs fichiers sont s&eacute;lectionn&eacute;s. On peut continuer &agrave; utiliser l'Interface Biblioth&eacute;caire pendant que la fen&ecirc;tre "Toutes M&eacute;ta-donn&eacute;es" est ouverte.</p>
<p>Quand il devient trop large, on peut filtrer le tableau "Toutes M&eacute;ta-donn&eacute;es" en appliquant des filtres aux colonnes. Alors que de nouveaux filtres sont ajout&eacute;s, seules les lignes qui concernent restent visibles. Pour installer, modifier ou effacer un filtre, cliquez sur l'&icirc;cone "Funnel" situ&eacute; en haut de la colonne. Une information sur le filtre est r&eacute;clam&eacute;e. Une fois le filtre install&eacute;, l'en-t&ecirc;te de la colonne change de couleur.</p>
<p>La confirmation poss&egrave;de un onglet "simple" et " advanc&eacute;". La version simple filtre les colonnes afin qu'elles ne montrent que des lignes qui contiennent une certaine valeur de m&eacute;ta-donn&eacute;e ("*" concerne toutes les valeurs). On peut s&eacute;lectionner des valeurs de m&eacute;ta-donn&eacute;es &agrave; partir d'une liste d&eacute;roulante. La version advanc&eacute;e permet diff&eacute;rentes op&eacute;rations d'harmonisation: doit commencer avec, ne contient pas, alphab&eacute;tiquement et est &eacute;gal &agrave;. La valeur &agrave; harmoniser peut &ecirc;tre &eacute;dit&eacute;e et prise sous forme d'une cha&icirc;ne quelconque (y compris "*"), et on peut opter pour une harmonisation insensible aux caract&egrave;res. Enfin, on peut sp&eacute;cifier une deuxi&egrave;me condition d'harmonisation pr&eacute;cisant une gamme de valeurs (en s&eacute;lectionnant AND) ou des valeurs alternatives (en selectionnant OR). En dessous de cette zone, une bo&icirc;te qui permet de changer l'ordre de tri (ascendant ou descendant) est plac&eacute;e. Enfin, cliquer sur "Installer Filtre" pour appliquer le nouveau filtre &agrave; la colonne. Cliquer sur "Effacer Filtre" pour enlever le filtre courant. Notez que les d&eacute;tails du filtre sont retenus m&ecirc;me si le filtre est effac&eacute;.</p>
<p>Par exemple, pour trier le tableau "Toutes M&eacute;ta-donn&eacute;es" , choisir une colonne, s&eacute;lectionner le cadre du filtre par d&eacute;faut (Un filtre simple sur "*") et choisir un ordre ascendant ou descendant.</p>
<p>
<b>
<i>Importer des M&eacute;ta-donn&eacute;es Pr&eacute;-assign&eacute;es </i>
</b>
</p>
<p>Cette section explique comment importer des m&eacute;ta-donn&eacute;es affect&eacute;es pr&eacute;c&eacute;demment; m&eacute;ta-donn&eacute;es affect&eacute;es avant d'&ecirc;tre ajout&eacute;es &agrave; la collection.</p>
<p>Si la m&eacute;ta-donn&eacute;e dans une forme reconnue par l'Interface Biblioth&eacute;caire a &eacute;t&eacute; pr&eacute;alablement assign&eacute;e &agrave; un fichier, -- par exemple, quand on choisit des documents dans une collection Greenstone existante -- elle est import&eacute;e automatiquement quand on ajoute le fichier. Pour ce faire, la m&eacute;ta-donn&eacute;e doit &ecirc;tre ajust&eacute;e au jeu de m&eacute;ta-donn&eacute;es disponibles dans la collection.</p>
<p>L'Interface Biblioth&eacute;caire confirme l'information n&eacute;cessaire. confirmation sous forme d'instructions br&egrave;ves et qui montre ensuite le nom de l'&eacute;l&eacute;ment m&eacute;ta-donn&eacute;e qui est import&eacute;e, comme il appara&icirc;t dans le fichier source. Ce champ ne peut &ecirc;tre ni &eacute;dit&eacute; ni chang&eacute;. Ensuite on choisit sur quel jeu de m&eacute;ta-donn&eacute;e le nouveau &eacute;l&eacute;ment devrait &ecirc;tre calqu&eacute; et enfin l'&eacute;l&eacute;ment m&eacute;ta-donn&eacute;e appropri&eacute;. Le syt&egrave;me selectionne automatiquement le meilleur ajustement, en terme de jeu et d'&eacute;l&eacute;ment pour la nouvelle m&eacute;ta-donn&eacute;e.</p>
<p>Apr&egrave;s cela,on peut choisir "Ajouter" pour ajouter le nouvel &eacute;l&eacute;ment m&eacute;ta-donn&eacute;e au jeu de m&eacute;ta-donn&eacute;es choisi. (Ceci n'est possible que si aucun &eacute;lement de m&ecirc;me nom n'est pr&eacute;sent &agrave; l'interieur du jeu choisi.) "Fusionner" applique le nouvel &eacute;lement &agrave; celui choisi par l'utilisateur. Enfin, "Ignorer" n'importe aucune m&eacute;ta-donn&eacute;e avec ce nom d'&eacute;lement. Une fois pr&eacute;cis&eacute;e la mani&egrave;re d'importer un certain &eacute;l&eacute;ment de m&eacute;ta-donn&eacute;e, l'information d'application est retenue pour la dur&eacute;e de vie de la collection.</p>
<p>Pour des d&eacute;tails concenant les fichiers m&eacute;ta-donn&eacute;e.xml que Greenstone utilise pour sauvegarder les m&eacute;ta-donn&eacute;es, il faut vous ref&eacute;rer au chapitre 2 du guide du D&eacute;veloppeur de Greenstone -- "Exploitez vos documents au maximum".</p>
<p>
<a name="Subsection_designingacollection"/>
<b>D&eacute;coration de l'apparence de votre collection</b>
</p>
<p>Une fois les fichiers marqu&eacute;s avec les m&eacute;ta-donn&eacute;es, on peut d&eacute;cider comment ils devraient appara&icirc;tre aux utilisateurs comme une collection Greenstone. Quel type d'information peut &ecirc;tre recherch&eacute;? Quels sont les moyens qui sont fournis pour naviguer &agrave; travers les documents? Quels sont les langages support&eacute;s? o&ugrave; apparaissent les boutons sur la page? ces choses peuvent &ecirc;tre adapt&eacute;es; cette section d&eacute;crit comment proc&eacute;der.</p>
<p>
<b>
<i>L'Affichage conception </i>
</b>
</p>
<p>Cette section pr&eacute;sente l'affichage de conception et explique comment on navigue entre les diff&eacute;rents affichages &agrave; l'int&eacute;rieur de cette vitrine. </p>
<p>Avec l'Interface Biblioth&eacute;caire, on peut configurer la fa&ccedil;on dont la collection va appara&icirc;tre &agrave; l'utilisateur. Les options de configuration sont divis&eacute;es en diff&eacute;rentes sections, chacune associ&eacute;e &agrave; une &eacute;tape particuli&egrave;re de navigation ou de pr&eacute;sentation d'information.</p>
<p>Sur la gauche est plac&eacute;e une liste de diff&eacute;rents affichages et &agrave; droite les commandes associ&eacute;es &agrave; celles en cours. Pour passer &agrave; un affichage diff&eacute;rent, cliquer son nom dans la liste.</p>
<p>Pour comprendre les diff&eacute;rentes &eacute;tapes et les termes implmiqu&eacute;s dans la conception d'une collection, lire les chapitres 1 et 2 de Greenstone's Developer's Guide. </p>
<p>
<b>
<i>G&eacute;n&eacute;ral </i>
</b>
</p>
<p>Cette section explique comment passer en revue et changer les r&eacute;glages g&eacute;neraux associ&eacute;s &agrave; la collection. D'abord, sous "Design section" cliquer "General".</p>
<p>Les valeurs fournies ici peuvent &ecirc;tre modifi&eacute;es au cours de la cr&eacute;ation de la collection.</p>
<p>D'abord, les contacts E-mail du cr&eacute;ateur et mainteneur de la collection. Le champ suivant permet le changement de titre de la collection. Le dossier dans lequel est enregistr&eacute; la collection est affich&eacute; ensuite, mais ne peut &ecirc;tre &eacute;dit&eacute;. Celui qui suit sp&eacute;cifie (sous forme d'URL) l'&icirc;cone &agrave; montrer &agrave; l'extr&eacute;mit&eacute; sup&eacute;rieure gauche de la page "About" de la collection et la suivante est l'&icirc;cone utilis&eacute;e dans la page de la biblioth&eacute;que Greenstone &agrave; lier &agrave; la collection. Puis, une case permet de contr&ocirc;ler si la collection est accessible au public. Enfin, la zone texte de "la description de la Collection" comme d&eacute;crit "Cr&eacute;er une nouvelle collection".</p>
<p>
<b>
<i>Plugiciels de Document </i>
</b>
</p>
<p>Cette section d&eacute;crit comment faire la configuration des plugiciels des documents que la collection utilise. Elle explique comment sp&eacute;cifier les plugiciels utilis&eacute;s, quels param&egrave;tres leur passer et dans quel ordre ils se d&eacute;roulent. Sous "Sections de conception", cliquer "Plugiciels de document".</p>
<p>Pour ajouter un plugiciel, s&eacute;lectionner-le sur la liste d&eacute;roulante de "Choisir le plugiciel &agrave; ajouter" situ&eacute;e &agrave; c&ocirc;t&eacute; du bouton et ensuite cliquer "Ajouter plugiciel". Une fen&ecirc;tre d&eacute;nomm&eacute;e "Configurer les arguments" appara&icirc;t; elle est d&eacute;crite plus loin. Une fois la configuration du nouveau plugiciel achev&eacute;e, il est ajout&eacute; &agrave; la fin de la liste "Plugiciels couramment assign&eacute;s". Veuillez noter que, &agrave; l'exception de UnknownPlug, chaque plugin ne peut appara&icirc;tre qu'une seule fois dans la liste.</p>
<p>Pour enlever un plugiciel, s&eacute;lectionner-le sur la liste et cliquer sur "Enlever plugiciel".</p>
<p>Les plugiciels sont configur&eacute;s en fournissant des arguments. Pour les changer, il faut s&eacute;lectionner le plugiciel &agrave; partir de la liste et cliquer "Configurer plugiciel" (Ou double-cliquer sur le plugiciel). Un dialogue "Configuration des arguments" appara&icirc;t avec diff&eacute;rent cont&ocirc;les pour sp&eacute;cifier les arguments.</p>
<p>Il existe plusieurs types de contr&ocirc;les. Certains sont des bo&icirc;tes de dialogue et cliquer sur l'une ajoute l'option appropri&eacute;e au plugiciel. Les autres sont des cha&icirc;nes de textes avec une bo&icirc;te de dialogue et un champ texte. Cliquer sur la bo&icirc;te pour activer l'argument, ensuite saisir le texte appropri&eacute; dans la bo&icirc;te (expression normale, chemin de fichier etc). Les autres sont des menus d&eacute;roulants &agrave; partir desquels on peut s&eacute;lectionner &agrave; partir d'une s&eacute;rie de valeurs d&eacute;termin&eacute;es. Pour apprendre ce qu'un argument peut faire, promener la souris planer sur son nom pendant un instant une description appara&icirc;tra.</p>
<p>Pour changer la configuration, cliquer sur "OK" pour valider et fermer la bo&icirc;te de dialogue, ou "Annuler" pour fermer la bo&icirc;te de dialogue sans changer les arguments du plugiciel.</p>
<p>Les plugiciels dans la liste sont execut&eacute;s en ordre et l'ordre est parfois important. L' ordre des classificateurs ne peut &ecirc;tre chang&eacute; que dans la Librairie de Syst&egrave;mes Sp&eacute;cialistes et modes Experts (voir "Pr&eacute;f&eacute;rences").</p>
<p>
<b>
<i>Types de recherche </i>
</b>
</p>
<p>cette section explique comment modifier une nouvelle caract&eacute;ristique de conception dans Greenstone, Types de recherche, qui permet une recherche de champ. Les types de recherche sp&eacute;cifient le type d'interface de recherche &agrave; fournir: formulaire, recherche par champs et/ou recherche simple. Sous "Sections de conception", cliquer sur "Types de recherche".</p>
<p>Lorsqu'on p&eacute;n&egrave;tre dans l'affichage Types de recherche, v&eacute;rifier d'abord "Activer recherches avanc&eacute;es", qui active les autres contr&ocirc;les. Ceci change la collection &agrave; utiliser un m&eacute;chanisme d' indexage qui permet une recherche de champs. La sp&eacute;cification de l' indexe est l&eacute;g&egrave;rement diff&eacute;rente dans ce mode. (Quand &eacute;changeant entre une recherche classique ou avanc&eacute;e, le GLI essaye de convertir la sp&eacute;cification de l' indexe, mais peut ne pas le faire correctement.)</p>
<p>pour ajouter un type de recherche, s&eacute;lectionner-le &agrave; partir de la liste "Types de recherche" et cliquer sur "Ajouter Type de recherche". Chaque type n'appara&icirc;t qu'une fois sur la liste. La premi&egrave;re recherche sera de type d&eacute;faut et appar&ecirc;tra dans la page de recherche de la conection &eacute;tablie. Tout les autres pourons &ecirc;tre s&eacute;lection&eacute;s dans la page de pr&eacute;f&eacute;rences.</p>
<p>Pour enlever un type de recherche, il faut le selectionner &agrave; partir de la liste "Currently Assigned Search type" et cliquer sur "Enlever type de recheche". La liste doit contenir au moins un type de recherche.</p>
<p>
<b>
<i>Index de recherche </i>
</b>
</p>
<p>Les index pr&eacute;cisent les parties de la collection qui doivent &ecirc;tre recherch&eacute;es. Cette section explique comment ajouter et enlever des index et fixer un index par d&eacute;faut. Sous "Sections de conception", cliquer sur "Rechercher Index".</p>
<p>Pour ajouter un index, taper un nom choisi dans le champ "Nom de l'Index". Selectionner les sources d'information &agrave; indexer en cliquant les bo&icirc;tes de dialogue &agrave; c&ocirc;t&eacute; d'eux. La liste montre aussi bien tous les &eacute;l&eacute;ments de m&eacute;ta-donn&eacute;es assign&eacute;s, que le texte entier. Apr&egrave;s avoir s&eacute;lectionn&eacute; les sources de donn&eacute;es, choisir la granularit&eacute; de l'index en utilisant le menu "Au niveau". Une fois ces d&eacute;tails complet&eacute;s, "Ajouter Index" devient actif (&agrave; moins qu'il n'ait un index existant avec les m&ecirc;mes param&egrave;tres). Cliquez pour ajouter un nouvel index.</p>
<p>Pour &eacute;diter un index, s&eacute;lectionnez-le et changez les d&eacute;tails de l'index, puis clicquez sur "Remplacer l'index".</p>
<p>Pour enlever un index, il faut le s&eacute;lectionner sur la liste d'index assign&eacute;s et cliquer "Enlever index". </p>
<p>Pour cr&eacute;er un indexe couvrant texte et toute metadata, cliquez sur "Ajouter Tout".</p>
<p>L'index par d&eacute;faut, celui qui est utilis&eacute; dans la page de recherche de la collection est labell&eacute; parc "[Index par d&eacute;faut]" dans la liste "Index assign&eacute;s".</p>
<p>Si la recherche avanc&eacute;e est activ&eacute;e (voir Affichage des types de recherche), les contr&ocirc;les d'index sont diff&eacute;rents. Il existe une nouvelle pseudo-source de donn&eacute;es "Tous champs" qui fournit une recherche &agrave; travers tous les index sp&eacute;cifi&eacute;s &agrave; la fois. Des niveaux ne sont pas assign&eacute;s &agrave; un index sp&eacute;cifique, mais s'applique &agrave; tous les index: ainsi index et niveaux sont ajout&eacute;s s&eacute;parement. "Ajouter Tout" cr&eacute;e un indexe s&eacute;par&eacute; pour chaque champ de metadata dans ce mode.</p>
<p>Le nom de chaque index sera en d&eacute;faut pour le nom de source. Pour changer le nom, S&eacute;lectionner un index, changer ses d&eacute;tails et cliquez "Remplacer Index". </p>
<p>
<b>
<i>Index de Partition </i>
</b>
</p>
<p>Les index sont construits sur un texte particulier ou des sources M&eacute;ta-donn&eacute;es. L'espace de recherche peut &ecirc;tre plus tard contr&ocirc;l&eacute; en morcelant l'index soit par langage ou par filtre choisi &agrave; l'avance. Cette section en d&eacute;crit la proc&eacute;dure. Sous "Sections de conception", cliquer "Index de Partition". </p>
<p>L'affichage "Index de Partition" poss&egrave;de trois onglets: "D&eacute;finir les Filtres", "Assigner une partition" et "Assigner des langages". Pour en savoir davantage sur les partitions, lire sur les sous collections et les sous index au chapitre 2 de Greenstone developer's guide.</p>
<p>La fen&ecirc;tre des Indexes de Partition est seulement &eacute;tablie dans la Librairie de Syst&egrave;mes Sp&eacute;cialistes et modes Experts (voir "Pr&eacute;f&eacute;rences"). Notez que le nombre total de partitions g&eacute;n&eacute;r&eacute;es est une combinaison de tous les indexes, des filtres de sous colection et des langues choisis. Deux indexes avec deux filtres de sous-collections dans deux langues donnent huit partitions d'index.</p>
<p>
<b>
<i>D&eacute;finir les Filtres </i>
</b>
</p>
<p>Les filtres permettent de jeur en sous-collection tous les documents dans un index pour laquelle une valeur m&eacute;ta-donn&eacute;e correspond &agrave; un type donn&eacute;.</p>
<p>Pour cr&eacute;er un filtre, cliquer sur le bouton "D&eacute;finir les Filtres" et entrer un nom pour le nouveau filtre dans le champ "Nom du filtre de sous collection". Ensuite choisir un attribut de document &agrave; faire correspondre soit avec l'&eacute;l&eacute;ment de m&eacute;ta-donn&eacute;e soit avec le nom du fichier en question. Saisir une expression courante qu'il faut utiliser durant la correspondance. Vous pouvez choisir entre "Inclure" les documents qui correspondent au fichier ou les "Exclure". Enfin, on peut sp&eacute;cifier l'un quelconque des drapeaux standard PERL d'expression courante qu'il faut utiliser pour la correspondance (par exemple "i" pour les correspondances ne tenant pas compte des caract&egrave;res.) Pour finir, cliquez sur "Ajouter un Filtre" pour ajouter le filtre &agrave; la liste "Filtres de sous collection d&eacute;finis". </p>
<p>Pour enlever un filtre, s&eacute;lectionner-le sur la liste et cliquer sur "Enlever Filtre".</p>
<p>Pour changer un filtre, s&eacute;lectionner-le sur la liste, changer l'une quelconque des valeurs apparaissant dans les contr&ocirc;les d'&eacute;dition et cliquer sur "Remplacer Filtre" pour valider les modifications.</p>
<p>
<b>
<i>Assigner des Partitions </i>
</b>
</p>
<p>Apr&egrave;s avoir d&eacute;fini un filtre de sous-collection, utiliser l'onglet "Assigner des Partitions" pour construire ses indexes (ou ceux pour un jeu de filtres.) S&eacute;lectionner le filtre (ou les filtres) de votre choix &agrave; partir de la liste "D&eacute;finir des Filtres de Sous-collection", entrer un nom pour la partition dans le champ "Nom de Partition Name", et cliquer sur "Ajouter Partition". </p>
<p>Pour supprimer une partition, s&eacute;lectionner-la &agrave; partir de la liste et cliquer sur "Enlever Partition".</p>
<p>Pour faire d'une partition celle par d&eacute;faut, s&eacute;lectionner-la &agrave; partir de la liste et cliquer sur "Par D&eacute;faut".</p>
<p>
<b>
<i>Assigner Langages </i>
</b>
</p>
<p>Cette section donne les d&eacute;tails de la mani&egrave;re de restreindre les index &agrave; des langages particuliers. On le fait en g&eacute;n&eacute;rant une partition par le biais de l'onglet "Assigner Langages" de l'Affichage "Index de Partition".</p>
<p>Pour ajouter un nouveau langage, dont la partition par le biais de l'onglet "Assigner langues" conf&egrave;re un index, S&eacute;lectionner le langage souhait&eacute; &agrave; partir de la liste "Langage &agrave; ajouter" et cliquer sur "Ajouter langue".</p>
<p>Pour supprimer une langue, s&eacute;lectionner-la &agrave; partir de la liste "S&eacute;lection de Langage" et cliquer sur "Enlever Langage". </p>
<p>Pour installer un language par d&eacute;faut, s&eacute;lectionner-la dans la liste et cliquez sur "Par d&eacute;faut".</p>
<p>
<b>
<i>Recherches &agrave; travers collections </i>
</b>
</p>
<p>Greenstone peut rechercher dans plusieurs collections comme si elles n'en constituaient qu'une. Ceci est fait en sp&eacute;cifiant une liste d' une autre collection &agrave; rechercher au m&ecirc;me temps que celle en recherche. Sous "Sections de conception", cliquez sur "Recherche unique &agrave; travers plusieurs collections".</p>
<p>L'Affichage de Recherche unique &agrave; travers des collections montre une liste de collections disponibles. La collection courante est coch&eacute;e et ne peut &ecirc;tre d&eacute;-s&eacute;lectionn&eacute;e. Pour ajouter une autre collection qu'on peut rechercher parall&egrave;lement, cliquer sur une collection dans la liste (cliquer une deuxi&egrave;me fois pour l'enlever). Lorsqu'une seule collection est s&eacute;lectionn&eacute;e, aucune recherche &agrave; travers collections n'est possible.</p>
<p>Si les collections individuelles n'ont pas les m&ecirc;mes indexes (y compris les les partitions de sous-collection et les partitions de language), la recherche ne pourra pas fonctionner. L'utilisateur ne pourra alors qu'effectuer des recherches en utilisant les indexes communs &agrave; toutes les collections.</p>
<p>Pour plus de d&eacute;tails, voir Chapitre 1 du Guide du D&eacute;veloppeur Greenstone.</p>
<p>
<b>
<i>Classificateurs de navigation </i>
</b>
</p>
<p>Cette section explique comment assigner &agrave; une collection des "classificateurs" qui sont utilis&eacute;s pour naviguer. Sous la section "Sections de conception", cliquer sur "Classificateurs de navigation".</p>
<p>Pour ajouter un classificateur, s&eacute;lectionner-le en utilisant la liste d&eacute;roulante "Choisir classificateur &agrave; ajouter" et cliquer sur "Ajouter Classificateur". une fen&ecirc;tre qui s'intitule "Configurer Arguments" appara&icirc;t ; les instructions concernant ce dialogue sont les m&ecirc;mes que pour les plugiciels (voir "Plugiciels de Document"). Une fois le nouveau classificateur configur&eacute;, il s'ajoute &agrave; la fin de la liste des "Classificateurs couramment Assign&eacute;s". </p>
<p>Pour supprimer un classificateur, s&eacute;lectionner-le dans la liste et cliquez sur "Supprimer Classificateur".</p>
<p>Pour changer les arguments d'un classificateur, s&eacute;lectionner-le sur la liste et cliquer sur "Configurer Classificateur" (ou double-cliquer sur le classificateur sur la liste.) </p>
<p>Le tri des classificateurs dans la barre de navigation de la collection est fourni ici dans l'ordre des classificateurs. Pour le changer, s&eacute;lectionner le classificateur &agrave; d&eacute;placer et cliquer sur "D&eacute;placer vers le haut" ou "D&eacute;placer vers le bas".</p>
<p>Pour plus d'informations sur les classificateurs lisez le chapitre 2 du Guide du D&eacute;veloppeur Greenstone -- Exploitez vos documents au maximum.</p>
<p>
<b>
<i>Caract&eacute;ristiques de Format </i>
</b>
</p>
<p>Les pages web que vous voyez en utilisant Greenstone ne sont pas pr&eacute;-stock&eacute;s mais sont g&eacute;n&eacute;r&eacute;es '&agrave; la vol&eacute;e' au fur et &agrave; mesure qu'on en fait appel. Les commandes de format sont utilis&eacute;es pour changer l'apparence de ces pages g&eacute;n&eacute;r&eacute;es. Ils influencent le lieu d'apparition des boutons lorsqu'un document est affich&eacute;, et d&eacute;terminent les liens qui sont affich&eacute;s par le classificateur DateList. Les commandes de format ne sont pas faciles &agrave; concevoir, et la lecture du chapitre 2 de Greenstone Developer's Guide est recommand&eacute;e. Cette section concerne les cadres de format, et indique comment l'Interface Biblioth&eacute;caire en fournit l'acc&egrave;s. Sous "Sections de conception", cliquer sur "Caract&eacute;ristiques de Format".</p>
<p>On peut appliquer une commande de format &agrave; n'importe quoi dans la liste d&eacute;roulante "Choisir Caract&eacute;ristique" qui comprend tous les classificateurs de m&ecirc;me qu'une liste pr&eacute;d&eacute;finie de caract&eacute;ristiques. Deux types de contr&ocirc;les existent lorsqu'on s&eacute;lectionne une caract&eacute;ristique: Certaines caract&eacute;ristiques sont simplement activ&eacute;es ou d&eacute;sactiv&eacute;es, et le contr&ocirc;le se fait gr&acirc;ce &agrave; une liste de v&eacute;rification. D'autres requi&egrave;rent qu'on sp&eacute;cifie une cha&icirc;ne de format. Pour ces caract&eacute;ristiques, il existe une liste de retrait ("Composante Affect&eacute;e") pour la s&eacute;lection des parties de la caraxt&eacute;ristique o&ugrave; s'applique la cha&icirc;ne (si n&eacute;cessaire), une zone de texte ("Cha&icirc;ne de Format HTML") o&ugrave; on saisit la cha&icirc;ne, et une s&eacute;lection de "Variables" pr&eacute;d&eacute;finies. Pour ins&eacute;rer une variable dans la position courante dans la cha&icirc;ne de format, s&eacute;lectionner la &agrave; partir de la liste de retrait et cliquer sur "Ins&eacute;rer". </p>
<p>Vous pouvez sp&eacute;cifier un format par d&eacute;faut pour une composante particuli&egrave;re en s&eacute;lectionnant la caract&eacute;ristique vierge.Ce format est alors appliqu&eacute; &agrave; toutes les caract&eacute;ristiques applicables sauf instruction contraire. </p>
<p>Pour ajouter une nouvelle commande de format, remplir l'information comme indiqu&eacute;e plus haut et cliquer sur "Ajouter Format". La nouvelle commande de Format appara&icirc;t dans la liste des "Commandes de Format fr&eacute;quemment Assign&eacute;es". Seule une commande de format peut &ecirc;tre assign&eacute;e pour chaque combinaison caract&eacute;ristique/composante.</p>
<p>Pour enlever une commande de format, s&eacute;lectionner-la sur la liste et cliquer "Enlever Format".</p>
<p>Pour modifier une commande de format, s&eacute;lectionner-la sur la liste et cliquer sur "Remplacer Format". </p>
<p>Pour de plus amples informations sur les variables et les composantes de caract&eacute;ristiques, lire le chapitre 2 du Guide du D&eacute;veloppeur de Greenstone. </p>
<p>Si la bo&icirc;te de v&eacute;rification "Permettre options &eacute;tendues" est coch&eacute;e, certaines options avanc&eacute;es de formatage sont activ&eacute;es. La liste des caract&eacute;ristiques pouvant &ecirc;tre format&eacute;es est l&eacute;g&egrave;rement chang&eacute;e, et plusieurs variables sont disponibles dans la commande de format, offrant un contr&ocirc;le plus grand sur la mise en forme. </p>
<p>
<b>
<i>Traduire Texte </i>
</b>
</p>
<p>Cette section d&eacute;crit l'Affichage de traduction, o&ugrave; on peut d&eacute;finir des fragments de texte sp&eacute;cifiques &agrave; un langage pour des parties de l'interface de la collection. Sous "Sections de conception", cliquer sur "Traduire Texte".</p>
<p>Choisir d'abord une entr&eacute;e dans la liste "Caract&eacute;ristiques". Les cha&icirc;nes sp&eacute;cifiques &agrave; un langage associ&eacute;es &agrave; la caract&eacute;ristiques apparaissent en bas. Utiliser la liste d&eacute;roulante de "Traduction de Langage" pour s&eacute;lectionner le langage cible, et saisir le texte traduit dans la zone de texte, en se ref&eacute;rant &agrave; "Fragment de Texte Initial" si n&eacute;cessaire. Cliquez sur "Ajouter Traduction" &agrave; la fin de l'op&eacute;ration. </p>
<p>Pour supprimer une traduction existante, s&eacute;lectionner-la &agrave; partir du tableau "Traduction Assign&eacute;e" et cliquer sur "Enlever Traduction". </p>
<p>Pour &eacute;diter une traduction, s&eacute;lectionner-la et &eacute;diter-la dans la zone de texte "Texte Traduit", et cliquer sur "Remplacer Traduction". </p>
<p>
<b>
<i>jeux de M&eacute;ta-donn&eacute;es </i>
</b>
</p>
<p>Cette section explique le panel de visualisation du jeu de m&eacute;ta-donn&eacute;es. Sous "Sections de conception", cliquer sur "jeux de M&eacute;ta-donn&eacute;es". </p>
<p>Cette fen&ecirc;tre sert &agrave; la revue des jeux de m&eacute;ta-donn&eacute;es utilis&eacute;s dans la collection, et les &eacute;l&eacute;ments qui sont disponibles dans chaque jeu. Choisir dans la liste de "jeux de m&eacute;ta-donn&eacute;es disponibles" pour voir des informations d&eacute;taill&eacute;es &agrave; ces &eacute;l&eacute;ments.</p>
<p>Pour utiliser un autre jeu de m&eacute;ta-donn&eacute;es avec la collection charg&eacute;e, clicquez sur "Ajouter un jeu de m&eacute;ta-donn&eacute;es" et s&eacute;lectionnez le fichier m&eacute;ta-donn&eacute;es (.mds) pour le nouveau jeu m&eacute;ta-donn&eacute;es.</p>
<p>L'&eacute;dition de jeux m&eacute;ta-donn&eacute;es se fait avec l'&eacute;diteur Greenstone de m&eacute;ta-donn&eacute;es (GEMS). En clicquant sur le bouton "&Eacute;diter un jeux m&eacute;ta-donn&eacute;es" vous obtiendrez des informations sur l'utilisation de GEMS.</p>
<p>Si vous n'avez plus besoin d'un jeu m&eacute;ta-donn&eacute;es, s&eacute;lectionnez le et clickez sur "Suppression du jeu m&eacute;ta-donn&eacute;es" pour l'enlever. Si vous avez affectt&eacute; des m&eacute;ta-donn&eacute;es aux &eacute;l&eacute;ments du jeu supprim&eacute;, on vous demandera ce que vous voulez en faire lorsque vous allez ouvrir &agrave; nouveau cette collection.</p>
<p>
<a name="Subsection_producingthecollection"/>
<b>Pour produire votre collection</b>
</p>
<p>Apr&egrave;s avoir rassembl&eacute; les documents de la collection, les avoir annot&eacute;s avec les m&eacute;ta-donn&eacute;es, et d&eacute;fini comment la collection va appara&icirc;tre, la production de la collection en utilisant Greenstone est alors possible. Cette section vous en explique la mani&egrave;re.</p>
<p>
<b>
<i>L'Affichage Cr&eacute;er </i>
</b>
</p>
<p>L'Affichage Cr&eacute;er est utilis&eacute; pour cr&eacute;er la collection en mettant en oeuvre les scripts Greenstone relatifs &agrave; cette op&eacute;ration. En cliquant sur "Construire Collection", on initie le processus de construction de la collection. Sa dur&eacute;e d&eacute;pend de la taille de la collection et du nombre d'index &agrave; cr&eacute;er (pour les grandes collections cela peut prendre des heures). Une barre d'&eacute;tat indique ou on en est dans le processus. Pour annuler le processus &agrave; tout moment, cliquer sur "Annuler Construction".</p>
<p>Quand la collection est construite, appuyant "Preview Collection" initiera la page web hebergeant la collection.</p>
<p>En mode expert, vous pouvez utiliser l'entr&eacute;e "Message Log" &agrave; gauche pour revoir les tentatives pr&eacute;c&eacute;dentes de construction de la collection avec ou san succ&eacute;s. S&eacute;lectionnez le journal souhait&eacute; en cliquant sur la date correspondante dans la liste "Historique du Journal".</p>
<p>
<b>
<i>Param&egrave;tres d'Importation et de Construction </i>
</b>
</p>
<p>Cette section explique comment acc&eacute;der aux diff&eacute;rents param&egrave;tres de construction et d'importation. Pour plus d'informations sur l'importation et la construction lire le chapitre 1 du Guide du D&eacute;veloppeur de Greenstone -- Comprendre le processus de construction de la collection.</p>
<p>Le contr&ocirc;le des diff&eacute;rents param&egrave;tres se fait de fa&ccedil;on identique &agrave; la fen&ecirc;tre "Configurer Arguments" d&eacute;crit dans la section "Plugiciels de Document". Certains champs requi&egrave;rent des arguments num&eacute;riques, et on peut: soit les incorporer en les saisissant, soit utiliser les fl&egrave;ches Haut et Bas pour augmenter ou diminuer la valeur pr&eacute;sente (dans certains cas, l'interface limite la classe qu'on peut entrer.) D'autres sont activ&eacute;s en cliquant sur une case de v&eacute;rification (re-cliquer pour d&eacute;sactiver.)</p>
<p>
<a name="Subsection_miscellaneous"/>
<b>Miscellaneous</b>
</p>
<p>Cette section d&eacute;crit les caract&eacute;ristiques de l'Interface Biblioth&eacute;caire qui ne sont pas associ&eacute;es &agrave; une fen&ecirc;tre d'affichage particuli&egrave;re.</p>
<p>
<b>
<i>Pr&eacute;f&eacute;rences </i>
</b>
</p>
<p>Cette section explique le dialogue des pr&eacute;f&eacute;rences, auquel on acc&egrave;de en ouvrant "Fichier" -&gt; "Pr&eacute;f&eacute;rences". </p>
<p>La premi&egrave;re option "General" est un champ texte pour saisir votre adresse courriel. Ceci sera utilis&eacute; pour les &eacute;l&eacute;ments m&eacute;ta-donn&eacute;es "cr&eacute;ateur" et "Mainteneur" de la collection. L'option suivante est un liste d&eacute;roulante des langues dans lesquelles l'interface bibioth&egrave;quaire peut &ecirc;tre affich&eacute;e. Si on change le dictionnaire par le choix d'un autre sur la liste, on doit red&eacute;marrer l'Interface Biblioth&eacute;caire pour charger les cha&icirc;nes du nouveau langage &agrave; partir du dictionnaire.</p>
<p>Si on coche "Affichage M&eacute;ta-donn&eacute;es &eacute;tendues", les diff&eacute;rents contr&ocirc;les relatifs aux m&eacute;ta-donn&eacute;es affichent toujours toutes les m&eacute;ta-donn&eacute;es qui ont &eacute;t&eacute; extraites automatiquement des documents. Lorsqu'on le d&eacute;s&eacute;lectionne, ces m&eacute;ta-donn&eacute;es sont cach&eacute;es (bien qu'elles restent disponibles pendant la conception de la collection, et dans la collection Greenstone finale.) Si on coche "Montrer les tailles des fichiers", la taille du fichier appara&icirc;t &agrave; c&ocirc;t&eacute; de chaque fichier dans l'espace de travail et dans les arborescences de fichiers de la collection dans les Affichages Rassembler et Enrichir.</p>
<p>Le panneau "Mode" est utilis&eacute; pour contr&ocirc;ler le niveau du d&eacute;tail dans l'interface. Dans sa configuration la plus basse, "Librarian Assistant", la vue de d&eacute;coration, est d&eacute;sactiv&eacute;e, les arguments qui requi&egrave;rent des expressions ordinaires sont cach&eacute;s, et la construction de la collection produit un enregistrement minimal d'&eacute;v&egrave;nements. Par contre, la configuration la plus &eacute;lev&eacute;e, "Expert", donne l'acc&egrave;s &agrave; toutes les fonctionnalit&eacute;s de d&eacute;coration, y compris le positionnement de plugin, et les arguments d'expressions ordinaires; elle permet aussi l'enregistrement de l'int&eacute;gralit&eacute; des messages lors de la construction de la collection. Pour changer ou revoir les modes, cliquez sur le bouton radio situ&eacute; &agrave; c&ocirc;t&eacute; du mode qui vous int&eacute;resse. Vous pouvez contr&ocirc;ler rapidement le mode dans lequel vous vous trouvez en regardant la barre de titre de Librarian Interface.</p>
<p>L'Interface Biblioth&eacute;caire est capable de supporter diff&eacute;rents flux de travail en d&eacute;terminant lesquels des diff&eacute;rents onglets d'affichage sont visibles. Utiliser l'onglet "Workflow" pour adapter les fen&ecirc;tres d'affichage disponibles en cochant les bo&icirc;tes qui sont &agrave; c&ocirc;t&eacute; des affichages souhait&eacute;s. On peut aussi utiliser la liste d&eacute;roulante pour s&eacute;lectionner des configurations pr&eacute;d&eacute;termin&eacute;es. La fermeture du dialogue des pr&eacute;f&eacute;rences &eacute;tablit ces param&egrave;tres de workflow (flux de travail). Ces param&egrave;tres sont emmagasinn&eacute;s dans la collection, et non dans le fichier de configuration de l'Interface Biblioth&eacute;caire.</p>
<p>L'onglet "Connexion" permet changer le chemin vers le serveur de biblioth&egrave;que local bas&eacute; sur Greenstone et utilis&eacute; dans l'aper&ccedil;u des collections. Vous pouvez aussi pr&eacute;ciser le proxy de connection internet (c.a.d. pour l&eacute;l&eacute;charger les fichiers; voir la "T&eacute;l&eacute;chargement de fichiers de lIinternet" section pour les details). Cochez la case pour une connection proxy et donnez l'addresse du proxy et son num&eacute;ro de port. La connection proxy sera &eacute;tablie apr&egrave;s fermeture du dialogue.</p>
<p>En cours de session, l'Interface Biblioth&eacute;ccaire peut d&eacute;livrer des messages d'avertissement qui informent sur d'&eacute;ventuelles cons&eacute;quences d'une action. On peut d&eacute;sactiver le message en cochant la case "Ne pas afficher cet avertissement de nouveau" ("Do not show this warning again"). On peut r&eacute;activer les messages d'avertissement en utilisant l'onglet "Avertissement" ("Warning"). Cocher la bo&icirc;te situ&eacute;e &agrave; c&ocirc;t&eacute; des messages d'avertissement que l'on souhaite reconsulter. </p>
<p>
<b>
<i>Associations de fichiers </i>
</b>
</p>
<p>L'Interface Biblioth&eacute;caire utilise des programmes d'application particuli&egrave;res pour ouvrir des types de fichiers particuliers. Pour modifier des associations ouvrez le menu "Fichier" et cliquer sur "Association de fichiers". </p>
<p>Pour ajouter une association, s&eacute;lectionner l'extension du fichier cible dans la liste d&eacute;roulant, ou taper dans une nouvelle extension (n'y incluer pas le ".") Ensuite soit taper la commande qui lance l'application voulue dans la champ appropri&eacute;, soit choisir l'application dans le dialogue "Navigation". "%1" Peut &ecirc;tre utilis&eacute; dans la commande de lancement pour ins&eacute;rer le nom du fichier qu'on veut ouvrir. Une fois cela, "Ajouter" est activ&eacute;. Cliquer dessus pour ajouter l'association.</p>
<p>Pour &eacute;diter une association, s&eacute;lectionner une extension de fichier existante. Toute commande existante associ&eacute;e est affich&eacute;e dans le champ de la commande de lancement. Corriger-la, et puis cliquer sur "Remplacer".</p>
<p>Pour enlever une association, s&eacute;lectionner une extension de fichier existante et cliquer sur "Supprimer". (L'extension du fichier reste dans la liste d&eacute;roulante "For Files Ending").</p>
<p>Les associations de fichiers sont stock&eacute;es dans le dossier principal du r&eacute;pertoire principal de l'Interface Biblioth&eacute;caire, dans un fichier appel&eacute; "associations.xml".</p>
<p>
<b>
<i>Exportation de collections vers CD/DVD </i>
</b>
</p>
<p>Greenstone peut exporter une ou plusieurs collections vers un CD/DVD d'auto-installation pour Windows. Pour ce faire, le paquetage Greenstone "Export to CD-ROM" doit &ecirc;tre install&eacute;. Il n'est pas inclut par d&eacute;faut, donc vous aurez peut &ecirc;tre &agrave; modifier votre installation pour l'inclure.</p>
<p>Pour exporter une collection, ouvrir le menu "Fichier" et choisir "Exporter la Collection vers un CD-ROM". Une liste de collections Greenstone appara&icirc;t; cliquez sur n'importe laquelle pour obtenir une description. Cochez la case des collections &agrave; exporter. Vous pouvez entrer le nom du CD/DVD dans la case: c'est ce qui va appara&icirc;tre dans le menu de d&eacute;marrage lorsque le CD/DVD aura &eacute;t&eacute; install&eacute;. Puis cliquez sur "Exporter". Ce processus implique la copie de plusieurs fichiers et peut durer quelques minutes.</p>
<p>A la fin de l'op&eacute;ration, Greenstone va afficher le nom d'un dossier contenant les collections export&eacute;es. Utilisez un graveur de CD/DVD pour copier le contenu dans un CD/DVD vierge.</p>
<p>
<a name="Section_tagging_document_files"/>
<b>3.3&nbsp;Le balisage des fichiers de documents</b>
</p>
<p>Les documents source ont souvent besoin d'&ecirc;tre structur&eacute;s en sections et sous-sections, et il faut communiquer cette information &agrave; Greenstone de sorte qu'il puisse puisse conserver la structure hi&eacute;rarchique des documents. On peut &eacute;galement associer des m&eacute;ta-donn&eacute;es -- telles que son titre -- &agrave; chaque section et sous-section.</p>
<p>Les documents source d'un processus de reconnaissance optique de caract&egrave;res (ROC) sont typiquement un ensemble de fichiers de traitement de texte, y compris des images. S'ils sont repr&eacute;sent&eacute;s sous la forme de fichiers Microsoft Word, on peut les importer dans Greenstone en utilisant le greffon Word. On peut aussi les convertir en HTML et les importer dans Greenstone en utilisant le greffon HTML.</p>
<p>Dans les deux cas, on peut indiquer la structure hi&eacute;rarchique d'un document en ins&eacute;rant des balises dans le texte comme suit:</p>
<p>&lt;!--</p>
<p>&lt;Section&gt;</p>
<p>&lt;Description&gt;</p>
<p>&lt;Metadata name="Title"&gt; Assurer le respect des droits de l'homme pour les pauvres: strat&eacute;gies pour atteindre les cibles de d&eacute;veloppement international &lt;/Metadata&gt;</p>
<p>&lt;/Description&gt;</p>
<p>--&gt;</p>
<p>
<i>(texte de la section)</i> </p>
<p>&lt;!--</p>
<p>&lt;/Section&gt;</p>
<p>--&gt;</p>
<p>On utilise les marqueurs<i>&lt;!-- ... --&gt;</i>car ils d&eacute;notent des commentaires en HTML; ces balises de section n'auront donc aucun impact sur la mise en forme du document. Il faut inclure ces autour des balises de sections, m&ecirc;me si le document sur lequel on travaille n'est pas de l'HTML (si par exemple il s'agit d'un fichier de type Microsoft Word).</p>
<p>On peut sp&eacute;cifier d'autres types de m&eacute;ta-donn&eacute;es dans la portion Description (situ&eacute;e entre les balises<i>&lt;Description&gt;</i>et<i>&lt;/Description&gt;</i>), mais ce n'est pas le cas du style de collection d&eacute;crit ici.</p>
<p>Il est important de se rappeler que l'on cr&eacute;e une table des mati&egrave;res hi&eacute;rarchique lorsque l'on ins&egrave;re des balises de sections dans le document. Cela signifie qu'on peut imbriquer des sections dans d'autres sections. En fait, il faut imbriquer toutes les sections dans une grande section qui recouvre l'ensemble du document.</p>
<p>L'exemple suivant illustre le cas d'un document compos&eacute; de deux chapitres, dont le second contient deux sous-sections. Vous trouverez des exemples concrets de documents source balis&eacute;s de cette mani&egrave;re dans les documents source des collections Demo et DLS. </p>
<p>&lt;!-- &lt;Section&gt; &lt;Description&gt; &lt;Metadata name="Title"&gt;Mon document&lt;/Metadata&gt; &lt;/Description&gt; &lt;Section&gt; &lt;Description&gt; &lt;Metadata name="Title"&gt;Chapitre 1&lt;/Metadata&gt; &lt;/Description&gt; --&gt;</p>
<p>(text du chapitre 1)</p>
<p>&lt;!-- &lt;/Section&gt; &lt;Section&gt; &lt;Description&gt; &lt;Metadata name="Title"&gt;Chapitre 2&lt;/Metadata&gt; &lt;/Description&gt; &lt;Section&gt; &lt;Description&gt; &lt;Metadata name="Title"&gt;Sous-section 1&lt;/Metadata&gt; &lt;/Description&gt; --&gt;</p>
<p>(texte de la sous-section 1)</p>
<p>&lt;!-- &lt;/Section&gt; &lt;Section&gt; &lt;Description&gt; &lt;Metadata name="Title"&gt;Sous-section 2&lt;/Metadata&gt; &lt;/Description&gt; --&gt;</p>
<p>(texte de la sous-section 2)</p>
<p>&lt;!-- &lt;/Section&gt; &lt;/Section&gt; &lt;/Section&gt; --&gt;</p>
<p>Il faut noter que des m&eacute;ta-donn&eacute;es assign&eacute;es &agrave; partir dun onglet de section dans un document source prend le pas sur celle assign&eacute;e au document tout entier. Ceci signifie que vous ne devez pas sp&eacute;cifier explicitement la m&eacute;ta-donn&eacute;e "Title" ("Titre") pour la section de plus haut niveau &agrave; l'int&eacute;rieur d'un document source &agrave; moins que vous ne veuilliez &eacute;craser le titre que vous lui avez donn&eacute; en sp&eacute;cifiant la m&eacute;ta-donn&eacute;e. Dans l'exemple ci-dessus, &agrave; moins de vouloir &eacute;craser le titre du document existant, vous devriez omettre la ligne o&ugrave; on peut lire:</p>
<p>&lt;Metadata name="Title"&gt;Mon document&lt;/Metadata&gt;</p>
<p>
<a name="Section_the_collector"/>
<b>3.4&nbsp;Le Collector</b>
</p>
<p>Le Collector est un outil d'assistance qui vous aidera &agrave; cr&eacute;er de nouvelles collections, &agrave; modifier ou ajouter &agrave; des collections existantes, ou &agrave; effacer des collections. Pour ce faire vous serez guid&eacute;s &agrave; travers un ensemble de pages web qui vous demanderont les informations n&eacute;cessaires. Ces pages web parlent d'elles-m&ecirc;mes, et la pr&eacute;sente section vous les d&eacute;crira. Au lieu d'utiliser le Collector, on peut aussi construire des collections depuis la ligne de commande&nbsp;--&nbsp;les premi&egrave;res pages du Guide du d&eacute;veloppeur d&eacute;taillent ce processus pas &agrave; pas.</p>
<p>Avant de construire et de distribuer des collections d'informations num&eacute;riques, il faut r&eacute;fl&eacute;chir aux cons&eacute;quences et aux responsabilit&eacute;s que cela implique. On trouve des aspects l&eacute;gaux relatifs aux droits: pouvoir acc&eacute;der &agrave; des documents n'implique pas forc&eacute;ment qu'on puisse les distribuer &agrave; des tiers. On trouve aussi des aspects sociaux: les collections devraient respecter les coutumes de la communaut&eacute; dont leurs documents proviennent. Enfin, on trouve des aspects &eacute;thiques: il existe des documents qu'il vaut mieux ne pas communiquer. La plume est plus puissante que l'&eacute;p&eacute;e! Soyez sensible au pouvoir de l'information, et faites-en sage usage.</p>
<p>Pour acc&eacute;der au Collector, cliquez sur le lien appropri&eacute; depuis la page d'accueil de la biblioth&egrave;que num&eacute;rique. </p>
<p>Dans Greenstone, la structure d'une collection est d&eacute;termin&eacute;e lors de sa mise en place. Cela comprend aussi bien le format des documents source, la mani&egrave;re de les repr&eacute;senter &agrave; l'&eacute;cran, les sources de m&eacute;ta-donn&eacute;es, quelles possibilit&eacute;s de navigation offrir, quels index de recherche dans le corps du texte fournir, et comment afficher les r&eacute;sultats des recherches. Apr&egrave;s la mise en place de la collection, il est facile d'y inclure de nouveaux documents&nbsp;--&nbsp;pour peu qu'ils soient dans le m&ecirc;me format que les documents existants, et que les m&ecirc;mes m&eacute;ta-donn&eacute;es soient fournies, exactement de la m&ecirc;me mani&egrave;re.</p>
<p>Le Collector dispose des fonctions de base suivantes:</p>
<p>cr&eacute;er une nouvelle collection de m&ecirc;me structure qu'une collection existante; </p>
<p>cr&eacute;er une nouvelle collection d'une structure diff&eacute;rente de celle des collections existantes; </p>
<p>ajouter du contenu &agrave; une collection existante; </p>
<p>modifier la structure d'une collection existante; </p>
<p>effacer une collection; et </p>
<p>exporter une collection existante sur un c&eacute;d&eacute;rom autonome et auto-installable. </p>
<p>Les figures&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16a</a> et suivantes illustrent l'utilisation du Collector pour la cr&eacute;ation d'une nouvelle collection, &agrave; partir d'un ensemble de fichiers HTML stock&eacute;s localement dans le cas de cet exemple. Il faut d'abord d&eacute;cider de travailler sur une collection existante ou d'en construire une nouvelle. Dans le premier cas, vous vous trouverez dans les deux premiers points de la liste num&eacute;rot&eacute;e ci-dessus; dans le second, ce seront les quatre derniers points qui vous concerneront. Dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16a</a>, l'utilisateur opte pour la cr&eacute;ation d'une nouvelle collection.</p>
<p>
<b>Figure&nbsp;16 (a) &nbsp; Utiliser le Collector pour construire une nouvelle collection (&agrave; suivre)</b> </p>
<p>
<img src="embedded:image37.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16a.png"/>
</p>
<p>
<a name="Subsection_logging_in"/>

</p>
<p>
<b>Se connecter</b>
</p>
<p>Dans tous les cas, il est n&eacute;cessaire de se connecter avant de pouvoir faire quoi que ce soit. En g&eacute;n&eacute;ral, on utilise un navigateur web pour acc&eacute;der &agrave; l'outil de construction de collection sur un ordinateur distant, afin de construire une collection sur ce serveur. Il est bien s&ucirc;r hors de question d'autoriser n'importe qui &agrave; construire des collections (ne serait-ce que pour des raisons de droits), c'est pourquoi Greenstone renferme un syst&egrave;me de s&eacute;curit&eacute; qui oblige qui veut construire des collections &agrave; se connecter avant toute autre chose. Ceci permet &agrave; un syst&egrave;me central d'offrir un service &agrave; ceux qui souhaitent construire des collections d'informations et utiliser le serveur pour les rendre disponibles &agrave; d'autres. D'autre part, m&ecirc;me si vous utilisez Greenstone sur votre ordinateur local et y construisez des collections, il est n&eacute;cessaire de vous connecter car il ne faut pas autoriser des tiers utilisant Greenstone sur votre ordinateur &agrave; construire des collections sans autorisation pr&eacute;alable.</p>
<p>
<a name="Subsection_dialog_structure"/>
<b>Structure de dialogue</b>
</p>
<p>
<b>Figure&nbsp;16 (b) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite)</b> </p>
<p>
<img src="embedded:image38.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16b.png"/>
</p>
<p>

</p>
<p>Suite &agrave; la connexion, on voit appara&icirc;tre la page pr&eacute;sent&eacute;e figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16b</a>. Elle montre la suite d'&eacute;tapes impliqu&eacute;es dans la construction d'une collection, c'est-&agrave;-dire:</p>
<p>Informations sur la collection </p>
<p>Donn&eacute;es source </p>
<p>Configurer la collection </p>
<p>Construire la collection </p>
<p>Afficher la collection. </p>
<p>La premi&egrave;re &eacute;tape consiste &agrave; sp&eacute;cifier le nom de la collection et les informations associ&eacute;es. La deuxi&egrave;me &eacute;tape est de pr&eacute;ciser d'o&ugrave; proviendront les donn&eacute;es source. La troisi&egrave;me permet d'ajuster les options de configuration, une &eacute;tape que vous trouverez de plus en plus utile &agrave; mesure que vous serez plus exp&eacute;riment&eacute; avec Greenstone. La quatri&egrave;me &eacute;tape indique o&ugrave; se fera tout le travail (de l'ordinateur). Durant le processus de &laquo;construction&raquo; le syst&egrave;me construit tous les index et rassemble toutes les autres informations n&eacute;cessaires au bon fonctionnement de la collection. La cinqui&egrave;me &eacute;tape vous permettra de visualiser la collection nouvellement cr&eacute;&eacute;e.</p>
<p>Ces cinq &eacute;tapes sont repr&eacute;sent&eacute;es sous forme d'une suite de boutons gris au bas de l'&eacute;cran figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16b</a>, ainsi qu'au bas de toutes les autres pages g&eacute;n&eacute;r&eacute;es par le Collector. Cet affichage aide les utilisateurs &agrave; se rappeler o&ugrave; ils en sont dans le processus. Le bouton &agrave; cliquer pour passer &agrave; la suite est affich&eacute; en vert (informations sur la collection sur la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16b</a>). Les boutons gris (tous les autres, sur la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16b</a>) sont inactifs. Les boutons deviennent jaunes au fur et &agrave; mesure de la progression dans les &eacute;tapes, et l'utilisateur peut revenir &agrave; une &eacute;tape ant&eacute;rieure en cliquant sur le bouton jaune correspondant. Cet affichage est inspir&eacute; des &laquo;assistants&raquo; largement utilis&eacute;s dans les logiciels propri&eacute;taires pour guider les utilisateurs tout au long des diff&eacute;rentes &eacute;tapes de l'installation de nouveaux logiciels.</p>
<p>
<a name="Subsection_collection_information"/>
<b>Informations sur la collection</b>
</p>
<p>
<b>Figure&nbsp;16 (c) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite)</b> </p>
<p>
<img src="embedded:image39.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16c.png"/>
</p>
<p>

</p>
<p>La prochaine &eacute;tape, celle des informations de collection, est illustr&eacute;e figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16c</a>. Lorsqu'on cr&eacute;e une nouvelle collection, il est n&eacute;cessaire de donner certaines informations la concernant:</p>
<p>titre, </p>
<p>adresse de courrier &eacute;lectronique de contact, et </p>
<p>une br&egrave;ve description. </p>
<p>Le titre de la collection est une petite phrase utilis&eacute;e &agrave; travers la biblioth&egrave;que num&eacute;rique pour identifier le contenu de la collection. On peut citer comme exemples de titres &laquo;Biblioth&egrave;que de la nourriture et de la nutrition&raquo;, &laquo;Biblioth&egrave;que environnementale mondiale&raquo;, &laquo;Biblioth&egrave;que de d&eacute;veloppement pour l'humanit&eacute;&raquo;, etc. L'adresse &eacute;lectronique sp&eacute;cifie qui contacter pour tout probl&egrave;me rencontr&eacute; avec la collection. Si le logiciel Greenstone d&eacute;tecte un probl&egrave;me, il est possible qu'il y envoie un rapport d&eacute;crivant l'erreur. Enfin, la br&egrave;ve description est une phrase d&eacute;crivant les crit&egrave;res d'inclusion dans la collection. Elle appara&icirc;t sous l'en-t&ecirc;te &agrave; propos de la premi&egrave;re page, lors de la pr&eacute;sentation de la collection.</p>
<p>La position actuelle dans les &eacute;tapes de construction de la collection est d&eacute;not&eacute;e par une fl&egrave;che qui appara&icirc;t au bas de chaque page&nbsp;--&nbsp;dans ce cas, comme illustr&eacute; par la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16c</a>, nous nous trouvons &agrave; l'&eacute;tape des informations de la collection. On continue vers la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16d</a> en cliquant sur le bouton vert donn&eacute;es source.</p>
<p>
<a name="Subsection_source_data"/>
<b>Donn&eacute;es source</b>
</p>
<p>
<b>Figure&nbsp;16 (d) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite) </b>
</p>
<p>
<img src="embedded:image40.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16d.png"/>
</p>
<p>

</p>
<p>La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16d</a> est le moment o&ugrave; l'utilisateur sp&eacute;cifie le texte source qui constituera la collection. On peut soit baser sa collection sur l'une des structures par d&eacute;faut fournies, soit sur la structure d'une collection existante.</p>
<p>Si vous optez pour la structure par d&eacute;faut, la nouvelle collection pourra contenir des documents HTML (fichiers d'extensions .htm ou .html), des fichiers texte (fichiers d'extensions .txt ou .text), des fichiers au format Microsoft Word (fichiers d'extensions .doc), des documents PDF (fichiers d'extensions .pdf), ou des courriers &eacute;lectroniques (fichiers d'extensions .email). Vous trouverez plus d'informations sur les diff&eacute;rents formats de documents qu'on peut inclure dans la section&nbsp;3.4.9.</p>
<p>Si vous basez votre nouvelle collection sur une collection existante, les fichiers de la nouvelle collection devront avoir exactement le m&ecirc;me type que ceux utilis&eacute;s pour construire la collection existante. Vous remarquerez que certaines collections utilisent des formats de fichiers en entr&eacute;e non standard, et que d'autres utilisent des m&eacute;ta-donn&eacute;es stock&eacute;es dans des fichiers auxiliaires. Si ces informations sont absentes de vos nouvelles donn&eacute;es, certaines fonctionnalit&eacute;s de navigation pourront mal fonctionner. Si par exemple vous clonez la collection &laquo;Demo&raquo;, vous remarquerez peut-&ecirc;tre que les boutons th&egrave;mes, organisation, et comment faire ne fonctionnent pas bien.</p>
<p>La page web propose des bo&icirc;tes pour indiquer la localisation des documents source: on peut sp&eacute;cifier jusqu'&agrave; trois sources diff&eacute;rentes en entr&eacute;e dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16d</a>. Si cela ne vous suffit pas, cliquez sur le bouton intitul&eacute; More sources (&laquo;davantage de sources&raquo;).</p>
<p>Il existe trois types de sp&eacute;cifications:</p>
<p>un nom de r&eacute;pertoire dans le syst&egrave;me du serveur Greenstone (commen&ccedil;ant par &laquo;file://&raquo;); </p>
<p>une adresse commen&ccedil;ant par &laquo;http://&raquo;, pour les fichiers &agrave; t&eacute;l&eacute;charger depuis le web; </p>
<p>une adresse commen&ccedil;ant par &laquo;ftp://&raquo;, pour les fichiers &agrave; t&eacute;l&eacute;charger en FTP anonyme. </p>
<p>Si vous utilisez file:// ou ftp:// pour sp&eacute;cifier un fichier, ce fichier sera rapatri&eacute;.</p>
<p>Si vous utilisez http://, tout d&eacute;pend si l'URL correspondante fournit dans le navigateur une page web normale ou une liste de fichiers. Si elle fournit une page web normale, cette page sera t&eacute;l&eacute;charg&eacute;e&nbsp;--&nbsp;ainsi que toutes les pages vers lesquelles elle pointe, et les pages vers lesquelles pointent ces derni&egrave;res, etc., pourvu que toutes r&eacute;sident sur le m&ecirc;me site, sous cette URL.</p>
<p>Si vous utilisez file:// ou ftp:// pour sp&eacute;cifier un dossier ou un r&eacute;pertoire, ou si vous donnez une URL en http:// qui m&egrave;ne vers une liste de fichiers, tout le dossier et tous ses sous-dossiers seront inclus dans la collection.</p>
<p>Vous pouvez sp&eacute;cifier des sources de plusieurs types.</p>
<p>Dans le cas de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16d</a>, la nouvelle collection contiendra des documents copi&eacute;s depuis un syst&egrave;me de fichiers local ainsi que depuis un site web externe, qui sera copi&eacute; localement (une copie &laquo;miroir&raquo; en sera faite) pendant le processus de construction.</p>
<p>Quand on clique sur le bouton configurer la collection pour passer &agrave; la prochaine &eacute;tape de la construction, le Collector v&eacute;rifie que toutes les sources de donn&eacute;es sp&eacute;cifi&eacute;es sont joignables. Ceci peut prendre quelques secondes, ou m&ecirc;me quelques minutes si vous avez sp&eacute;cifi&eacute; plusieurs sources. Si l'une ou l'autre des sources sp&eacute;cifi&eacute;es ne sont pas disponibles, on obtient une page comme celle de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16e</a>, marquant d'une croix les sources non disponibles (dans le cas pr&eacute;sent, c'est le cas de toutes deux).</p>
<p>
<b>Figure&nbsp;16 (e) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite)</b> </p>
<p>
<img src="embedded:image41.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16e.png"/>
</p>
<p>

</p>
<p>Plusieurs raisons peuvent expliquer le fait que des sources soient non disponibles: </p>
<p>le fichier, le site FTP ou l'URL indiqu&eacute; n'existe pas; </p>
<p>il vous faut d'abord vous connecter &agrave; votre FAI; </p>
<p>vous tentez d'acc&eacute;der &agrave; une URL alors que vous vous trouvez derri&egrave;re un pare-feu. </p>
<p>Le dernier cas est potentiellement celui qui a l'air le plus myst&eacute;rieux. Il se produit si en temps normal il vous faut fournir un nom d'utilisateur et un mot de passe pour acc&eacute;der &agrave; l'Internet. Parfois, il est possible que votre navigateur web affiche correctement la page si on y en entre l'URL, alors que le Collector pr&eacute;tend que cette source n'est pas disponible. L'explication est que la version affich&eacute;e dans votre navigateur provient peut-&ecirc;tre d'une copie tampon (cache). Malheureusement, les copies tampon locales sont invisibles au Collector. Dans un tel cas de figure, nous vous recommandons de t&eacute;l&eacute;charger d'abord les pages &agrave; l'aide de votre navigateur.</p>
<p>
<a name="Subsection_configuring_the_collection"/>
<b>Configurer la collection</b>
</p>
<p>
<b>Figure&nbsp;16 (f) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite)</b> </p>
<p>
<img src="embedded:image42.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16f.png"/>
</p>
<p>

</p>
<p>La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16f</a> pr&eacute;sente l'&eacute;tape suivante. La construction et la pr&eacute;sentation de toutes les collections sont contr&ocirc;l&eacute;es par des sp&eacute;cifications enregistr&eacute;es dans un fichier de configuration de collection sp&eacute;cial (voir ci-dessous). Les utilisateurs exp&eacute;riment&eacute;s pourront utiliser cette page pour modifier les r&eacute;glages de configuration, mais la plupart passeront directement &agrave; la derni&egrave;re &eacute;tape. En fait, dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16d</a>, les boutons configurer la collection et construire la collection sont tous les deux affich&eacute;s en vert, ce qui signifie bien que l'on peut compl&egrave;tement court-circuiter la troisi&egrave;me &eacute;tape du processus.</p>
<p>Dans notre exemple, l'utilisateur a fait une petite modification au fichier de configuration par d&eacute;faut en incluant le drapeau file_is_url &agrave; l'aide du greffon (plugin) HTML. Ce drapeau provoque l'insertion des m&eacute;ta-donn&eacute;es d'URL dans chaque document, en se fondant sur la convention de nom de fichier adopt&eacute;e par l'outil qui cr&eacute;e le miroir. Ces m&eacute;ta-donn&eacute;es sont utilis&eacute;es dans la collection pour permettre aux utilisateurs de se r&eacute;f&eacute;rer &agrave; la version originale du document, plut&ocirc;t qu'&agrave; une copie locale.</p>
<p>
<a name="Subsection_building_the_collection_1"/>
<b>Construire la collection</b>
</p>
<p>
<b>Figure&nbsp;16 (g) &nbsp; Utiliser le Collector pour construire une nouvelle collection (Suite)</b> </p>
<p>
<img src="embedded:image43.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_16g.png"/>
</p>
<p>

</p>
<p>La figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16g</a> illustre l'&eacute;tape de &laquo;construction&raquo;. Jusqu'&agrave; pr&eacute;sent, les r&eacute;ponses fournies dans l'interface ont simplement &eacute;t&eacute; enregistr&eacute;es dans un fichier temporaire. L'&eacute;tape de construction est celle o&ugrave; tout le travail est r&eacute;ellement effectu&eacute;.</p>
<p>Lors de la construction, les index de navigation et de recherche sont construits en suivant les instructions du fichier de configuration de collection. Le processus de construction peut prendre de quelques minutes &agrave; quelques heures, selon la taille de la collection et la puissance de l'ordinateur. Certaines collections tr&egrave;s cons&eacute;quentes peuvent prendre plus d'un jour &agrave; construire.</p>
<p>Lorsque vous atteindrez cette &eacute;tape, une ligne d'&eacute;tat situ&eacute;e au bas de la page web vous donnera un suivi de la progression de l'op&eacute;ration, suivi mis &agrave; jour toutes les 5 secondes. Le message visible dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16g</a> indique que lors de la capture d'&eacute;cran, Greenstone effectuait une conversion de format de document de PDF vers HTML.</p>
<p>Des avertissements seront affich&eacute;s si certains fichiers ou URL requis en entr&eacute;e n'existent pas, ou existent mais qu'aucun greffon (plugin) ne peut les traiter, ou que le greffon ne peut pas trouver un fichier associ&eacute;, telle qu'une image incrust&eacute;e dans un document HTML. L'objectif est que vous suiviez cette progression en laissant cette fen&ecirc;tre ouverte dans votre navigateur. Si des erreurs provoquent la fin pr&eacute;matur&eacute;e du processus, elles seront enregistr&eacute;e dans cette zone d'&eacute;tat.</p>
<p>Vous pouvez arr&ecirc;ter le processus de construction &agrave; tout instant en cliquant sur le bouton Arr&ecirc;t de la construction, visible figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16g</a>. Si vous quittez la page web (sans avoir annul&eacute; le processus de construction &agrave; l'aide du bouton Arr&ecirc;t de la construction), la construction continuera &agrave; s'effectuer, et la nouvelle collection sera install&eacute;e &agrave; la fin de l'op&eacute;ration. </p>
<p>
<a name="Subsection_viewing_the_collection"/>
<b>Afficher la collection</b>
</p>
<p>Quand la collection est construite et install&eacute;e, la suite de boutons visibles aux bas des figures&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16b</a> &agrave; <a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16f</a> appara&icirc;t au bas de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16g</a>, avec le bouton afficher la collection activ&eacute;. Ce bouton emm&egrave;ne directement l'utilisateur vers la collection nouvellement construite.</p>
<p>Enfin, il existe une fonctionnalit&eacute; d'envoi de courrier d'&eacute;lectronique &agrave; l'adresse &eacute;lectronique de contact de la collection ainsi qu'&agrave; l'administrateur syst&egrave;me, &agrave; chaque cr&eacute;ation (ou modification) d'une collection. Ceci permet aux responsables de v&eacute;rifier tout changement prenant place et de surveiller ce qui se passe sur le syst&egrave;me. Cette fonctionnalit&eacute; est d&eacute;sactiv&eacute;e par d&eacute;faut mais elle peut &ecirc;tre activ&eacute;e en &eacute;ditant le fichier de configuration main.cfg (voir &agrave; ce sujet le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone, section&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/Develop_fr_all.html">4</a>).</p>
<p>
<a name="Subsection_working_with_existing_collect"/>
<b>Travailler avec des collections existantes</b>
</p>
<p>Lorsque l'on d&eacute;marre le Collector, il faut sp&eacute;cifier si on souhaite cr&eacute;er une collection enti&egrave;rement nouvelle, ou travailler avec une collection existante, en y ajoutant ou en en effa&ccedil;ant des donn&eacute;es. &Eacute;tant donn&eacute; qu'il cr&eacute;e automatiquement toutes les structures de recherche et de navigation &agrave; partir des documents eux-m&ecirc;mes, Greenstone facilite l'ajout de nouvelles informations &agrave; des collections existantes. Aucun lien n'&eacute;tant ins&eacute;r&eacute; manuellement, il est possible de fusionner automatiquement au reste de la collection de nouveaux documents disponibles, s'ils sont au m&ecirc;me format.</p>
<p>Pour travailler avec une collection existante, il faut d'abord s&eacute;lectionner la collection au sein d'une liste fournie par le logiciel. Certaines collections sont &laquo;prot&eacute;g&eacute;es en &eacute;criture&raquo; et ne peuvent pas &ecirc;tre modifi&eacute;es: de telles collections n'appara&icirc;tront pas dans la liste de s&eacute;lections. Avec la collection retenue, vous pourrez:</p>
<p>Ajouter de nouvelles donn&eacute;es et reconstruire la collection; </p>
<p>&Eacute;diter le fichier de configuration de la collection; </p>
<p>Effacer enti&egrave;rement la collection; </p>
<p>Exporter la collection sur un c&eacute;d&eacute;rom. </p>
<p>
<b>
<i>Ajouter de nouvelles donn&eacute;es </i>
</b>
</p>
<p>Les fichiers sp&eacute;cifi&eacute;s par vous seront ajout&eacute;s &agrave; la collection. Assurez-vous de ne pas sp&eacute;cifier &agrave; nouveau des fichiers d&eacute;j&agrave; pr&eacute;sents dans la collection, sans quoi deux copies en seraient incluses. Les fichiers sont identifi&eacute;s par leur chemin d'acc&egrave;s complet, et les pages web par leur adresse web absolue. On peut sp&eacute;cifier des r&eacute;pertoires et des fichiers de la m&ecirc;me mani&egrave;re que lors de la construction d'une nouvelle collection.</p>
<p>Si vous souhaitez ajouter des donn&eacute;es &agrave; une collection et que pour l'une ou l'autre raison, le processus de construction &eacute;choue, l'ancienne version de la collection demeurera inchang&eacute;e.</p>
<p>
<b>
<i>&Eacute;diter le fichier de configuration </i>
</b>
</p>
<p>Les utilisateurs exp&eacute;riment&eacute;s peuvent &eacute;diter le fichier de configuration de la collection, de la m&ecirc;me mani&egrave;re que lors de la construction d'une nouvelle collection. La section&nbsp;4explique les r&eacute;glages de configuration.</p>
<p>
<b>
<i>Effacer la collection </i>
</b>
</p>
<p>On vous demandera de confirmer le fait que vous souhaitez vraiment effacer la collection. Une fois la collection effac&eacute;e, Greenstone ne pourra pas la r&eacute;cup&eacute;rer!</p>
<p>
<b>
<i>Exporter la collection </i>
</b>
</p>
<p>Vous pouvez exporter la collection sous une forme qui lui permette d'&ecirc;tre &eacute;crite sur un c&eacute;d&eacute;rom Windows autonome et auto-installable. Les logiciels propri&eacute;taires cr&eacute;ant des c&eacute;d&eacute;roms auto-installables &eacute;tant on&eacute;reux, cette fonctionnalit&eacute; comprend un module d'installation maison.</p>
<p>Lors de l'export de la collection, la bo&icirc;te de dialogue vous informe du nom du r&eacute;pertoire o&ugrave; se trouve le r&eacute;sultat de l'op&eacute;ration. Ce r&eacute;pertoire doit int&eacute;gralement &ecirc;tre grav&eacute; sur le c&eacute;d&eacute;rom en utilisant un logiciel standard de gravage.</p>
<p>L'immense vari&eacute;t&eacute; des diff&eacute;rentes configurations Windows possibles nous a emp&ecirc;ch&eacute; de tester et de d&eacute;boguer l'installeur de Greenstone dans toutes les conditions possibles. Bien qu'il produise des c&eacute;d&eacute;roms qui fonctionneront sur la plupart des syst&egrave;mes Windows, il est toujours en cours de d&eacute;veloppement. Si vous rencontrez des probl&egrave;mes et que vous disposez d'un logiciel d'installation propri&eacute;taire (tel qu'InstallShield, par exemple), vous pouvez utiliser ce dernier pour cr&eacute;er des c&eacute;d&eacute;roms &agrave; partir des informations fournies par Greenstone. Le r&eacute;pertoire d'export mentionn&eacute; ci-dessus contient quatre fichiers relatifs au processus d'installation, et trois sous-r&eacute;pertoires qui contiennent la collection et le logiciel au complet. &Ocirc;tez les quatre fichiers et utilisez InstallShield pour cr&eacute;er une image de c&eacute;d&eacute;rom qui installera ces r&eacute;pertoires et cr&eacute;era un raccourci vers le programme gsdlserver.exe.</p>
<p>
<a name="Subsection_document_formats_1"/>
<b>Formats de documents</b>
</p>
<p>Lors de la construction de collections, Greenstone traite chaque format de document source en recherchant un &laquo;greffon&raquo; (plugin) qui est capable de le traiter. Les greffons sont sp&eacute;cifi&eacute;s dans le fichier de configuration de la collection. Greenstone utilise en g&eacute;n&eacute;ral le nom de fichier pour d&eacute;terminer le format de document&nbsp;--&nbsp;par exemple, toto.txt sera trait&eacute; comme un fichier texte, toto.html comme un fichier HTML, et toto.doc comme un fichier Word.</p>
<p>Voici un r&eacute;sum&eacute; des greffons disponibles pour les formats de documents les plus courants. Vous trouverez plus de d&eacute;tails sur ces greffons ainsi que des greffons suppl&eacute;mentaires, capables de traiter des formats moins courants, dans le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone.</p>
<p>
<b>
<i>TEXTPlug (*.txt, *.text) </i>
</b>
</p>
<p>TEXTPlug interpr&egrave;te un fichier texte comme un simple document. Il ajoute des m&eacute;ta-donn&eacute;es de titre en se fondant sur la premi&egrave;re ligne du fichier.</p>
<p>
<b>
<i>HTMLPlug (*.htm, *.html; et aussi .shtml, .shm, .asp, .php, .cgi) </i>
</b>
</p>
<p>HTMLPlug traite les fichiers HTML. Il extrait les m&eacute;ta-donn&eacute;es de titre en se fondant sur la balise<i>&lt;title&gt;</i>, et peut aussi extraire toute autre m&eacute;ta-donn&eacute;e exprim&eacute;e dans la syntaxe de la balise<i>&lt;meta&gt;</i>de HTML. Ce greffon dispose de nombreuses options, document&eacute;es dans le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone.</p>
<p>
<b>
<i>WORDPlug (*.doc) </i>
</b>
</p>
<p>WORDPlug importe des fichiers au format Microsoft Word. Il en existe de nombreuses variantes diff&eacute;rentes&nbsp;--&nbsp;et m&ecirc;me les programmes de Microsoft sont coutumiers d'erreurs de conversion. Greenstone utilise des programmes ind&eacute;pendants pour convertir les fichiers Word en HTML. Pour certains anciens formats Word, le syst&egrave;me utilise un simple algorithme d'extraction qui trouve toutes les portions de texte incluses dans le fichier en entr&eacute;e.</p>
<p>
<b>
<i>PDFPlug (*.pdf) </i>
</b>
</p>
<p>PDFPlug importe des documents au format PDF d'Adobe (&laquo;format de document portable&raquo;). Comme WORDPlug, il utilise un programme ind&eacute;pendant, qui s'appelle pdftohtml dans le cas pr&eacute;sent, pour convertir des fichiers PDF en HTML.</p>
<p>Comme dans le cas de WORDPlug, les collections afficheront par d&eacute;faut l'&eacute;quivalent HTML du fichier lorsque l'utilisateur cliquera sur l'icone document; cependant, on peut modifier les cha&icirc;nes de format dans le fichier de configuration de la collection pour donner plut&ocirc;t acc&egrave;s &agrave; l'utilisateur au fichier PDF original, et nous vous recommandons de proc&eacute;der ainsi. Contentez-vous de remplacer les balises<i>&lt;link&gt; ... &lt;/link&gt;</i>par des balises<i>&lt;srclink&gt; ... &lt;/srclink&gt;</i>.</p>
<p>Le programme pdftohtml ne parvient pas &agrave; traiter certains fichiers PDF. Le processus de conversion prend un temps exponentiellement long, et on voit souvent appara&icirc;tre &agrave; l'&eacute;cran un message traitant de ce processus. Si cela se produit, la seule solution que nous puissions proposer est d'&ocirc;ter le document concern&eacute; de la collection. PDFPlug ne peut pas non plus traiter les fichiers PDF chiffr&eacute;s.</p>
<p>
<b>
<i>PSPlug (*.ps) </i>
</b>
</p>
<p>PSPlug importe des documents au format PostScript. Il fonctionne au mieux si votre ordinateur dispose d&eacute;j&agrave; d'un programme standard sous Linux et appel&eacute; ps2ascii. Ce programme est disponible sur la plupart des installations Linux, mais pas sous Windows. Si ce programme n'est pas disponible, PSPlug se limite &agrave; un simple algorithme d'extraction de texte.</p>
<p>
<b>
<i>EMAILPlug (*.email) </i>
</b>
</p>
<p>EMAILPlug importe des fichiers contenant du courrier &eacute;lectronique, et traite les formats de courrier &eacute;lectronique courants tels que ceux utilis&eacute;s par Netscape, Eudora, et les lecteurs de courrier &eacute;lectronique sous Unix. Chaque document source est examin&eacute; &agrave; la recherche d'un ou de plusieurs courriers &eacute;lectroniques mis bout &agrave; bout, et si cette recherche aboutit le contenu du document est trait&eacute;. Le greffon extrait les m&eacute;ta-donn&eacute;es des champs Subject (&laquo;objet&raquo;), To (&laquo;destinataire&raquo;), From (&laquo;exp&eacute;diteur&raquo;), et Date. Cependant, ce greffon ne traite pas encore correctement les courriers &eacute;lectroniques encod&eacute;s au format MIME&nbsp;--&nbsp;bien que lisibles, ils ont souvent un aspect &eacute;trange.</p>
<p>
<b>
<i>ZIPPlug (.gz, .z, .tgz, .taz, .bz, .zip, .tar) </i>
</b>
</p>
<p>Le greffon ZIPPlug traite les formats d'entr&eacute;e compact&eacute;s et/ou d'archives suivants: gzip (.gz, .z, .tgz, .taz), bzip (.bz), zip (.zip .jar), et tar (.tar). Il repose sur les programmes gunzip, bunzip, unzip, et tar, qui sont des outils standard sous Linux. ZIPPlug est d&eacute;sactiv&eacute; sur les ordinateurs employant Windows.</p>
<p>
<b>4&nbsp;Administration</b>
</p>
<p>Chaque installation de Greenstone comprend un outil d'&laquo;administration&raquo;, auquel on acc&egrave;de en cliquant sur le lien appropri&eacute; de la page d'accueil.</p>
<p>La premi&egrave;re page, pr&eacute;sent&eacute;e figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">17</a>, donne des informations sur chacune des collections propos&eacute;es par le syst&egrave;me. Remarquez qu'il est possible que certaines collections &laquo;priv&eacute;es&raquo; n'apparaissant pas sur la page d'accueil de Greenstone soient list&eacute;es ici:<i>toutes</i>les collections sont ici pr&eacute;sentes. Chaque collection est accompagn&eacute;e de son nom court, de son nom complet, du fait qu'elle est ou non publique, et du fait qu'elle est ou non en fonctionnement. Cliquer sur l'abr&eacute;viation (abbrev.) d'une collection (la premi&egrave;re colonne de liens dans la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">17</a>) fournira des informations sur cette collection, informations synth&eacute;tis&eacute;es &agrave; partir du fichier de configuration de cette collection ainsi qu'&agrave; partir d'autres structures internes cr&eacute;&eacute;es pour elle. Si la collection est publique et en cours de fonctionnement, cliquer sur le nom complet de la collection (le deuxi&egrave;me lien) vous emm&eacute;nera sur la collection &agrave; proprement parler. </p>
<p>Une collection appel&eacute;e wohiex, pour women's history excerpt, est visible pr&egrave;s du bas de la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">17</a>. Figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">18</a> montre l'information qui est affich&eacute;e quand on appuie sur ce lien. Quand on choisit une collection, la premi&egrave;re section donne des informations sur le fichier de configuration et sur la taille de la collection (dans le cas pr&eacute;sent, elle comprend environ 1000 documents, un million de mots, et plus de 6 m&eacute;ga-octets de donn&eacute;es). Les sections suivantes contiennent des informations internes relatives au protocole de communication utilis&eacute; pour acc&eacute;der aux collections. Par exemple, les options de filtre pour &laquo;QueryFilter&raquo; montrent les options et les valeurs possibles qu'on peut utiliser lors de l'interrogation de la collection par requ&ecirc;tes.</p>
<p>L'outil d'administration pr&eacute;sente &eacute;galement des informations de configuration relatives &agrave; l'installation et permet de modifier cette derni&egrave;re. Il facilite l'examen du journal d'erreurs (qui enregistre les erreurs internes) et du journal utilisateur (qui consigne l'utilisation de la collection). Il permet &agrave; un ou plusieurs utilisateurs sp&eacute;cifi&eacute;s d'en autoriser d'autres &agrave; construire des collections et &agrave; ajouter du contenu &agrave; des collections existantes. On acc&egrave;de &agrave; toutes ces fonctionnalit&eacute;s de mani&egrave;re interactive &agrave; partir d'&eacute;l&eacute;ments du menu situ&eacute; &agrave; gauche sur la figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">17</a>.</p>
<p>
<b>Figure&nbsp;17&nbsp; Outil d'administration de Greenstone</b> </p>
<p>
<img src="embedded:image44.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_17.png"/>
</p>
<p>

</p>
<p>
<b>Figure&nbsp;18&nbsp; Informations relatives &agrave; une collection particuli&egrave;re</b> </p>
<p>
<img src="embedded:image45.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_18a.png"/>
<img src="embedded:image46.png" alt="http://www.greenstone.org/manuals/gsdl2/fr/images/User_Fig_18b.png"/>
</p>
<p>
<a name="Section_configuration_files"/>

</p>
<p>
<b>4.1&nbsp;Fichiers de configuration</b>
</p>
<p>Deux fichiers de configuration contr&ocirc;lent le fonctionnement de Greenstone: le fichier de configuration de site gsdlsite.cfg et le fichier de configuration principal main.cfg.</p>
<p>Le fichier gsdlsite.cfg sert &agrave; configurer Greenstone pour le site particulier sur lequel il est install&eacute;. Il est con&ccedil;u pour enregistrer les options de configuration propres &agrave; un site donn&eacute;, comme par exemple le nom du r&eacute;pertoire abritant le logiciel, l'adresse HTTP du syst&egrave;me Greenstone, et si l'option &laquo;Fast-CGI&raquo; est utilis&eacute;e ou non. Les entr&eacute;es de ce fichier sont d&eacute;crites dans le Guide d'installation de la biblioth&egrave;que num&eacute;rique Greenstone</p>
<p>Le fichier main.cfg contient des informations communes &agrave; l'interface et &agrave; toutes les collections servies sur un site Greenstone. Il comprend l'adresse &eacute;lectronique du mainteneur du syst&egrave;me, le fait que les pages d'&eacute;tat et de Collector sont activ&eacute;es ou non, le fait qu'on conserve ou non des journaux de l'activit&eacute; utilisateur, et si l'on utilise ou non des &laquo;cookies&raquo; web pour identifier les utilisateurs.</p>
<p>
<a name="Section_logs"/>
<b>4.2&nbsp;Journaux</b>
</p>
<p>On peut examiner trois types de journaux: journaux d'utilisation, d'erreur, et d'initialisation. Les deux derniers types de journaux ne pr&eacute;senteront r&eacute;ellement d'int&eacute;r&ecirc;t qu'aux yeux des mainteneurs du logiciel.</p>
<p>Le logiciel Greenstone peut consigner toute l'activit&eacute; utilisateur, c'est-&agrave;-dire toutes les pages visit&eacute;es par chaque utilisateur, bien qu'aucune information nominative ne soit stock&eacute;e dans les journaux. On active la journalisation (qui est d&eacute;sactiv&eacute;e par d&eacute;faut) en incluant les lignes suivantes:</p>
<p>logcgiargs true usecookies true</p>
<p>dans le fichier de configuration principal du syst&egrave;me. Ces deux options ayant par d&eacute;faut la valeur fausse false, aucune journalisation n'a lieu tant qu'elles ne re&ccedil;oivent pas la valeur vraie true. C'est la ligne logcgiargs qui a pour effet d'activer ou de d&eacute;sactiver la journalisation. En activant usecookies, on affecte &agrave; chaque utilisateur un code d'identification unique, ce qui permet de suivre dans le journal les interactions de chaque utilisateur.</p>
<p>Chaque ligne du journal utilisateur repr&eacute;sente une page visit&eacute;e&nbsp;--&nbsp;m&ecirc;me les pages g&eacute;n&eacute;r&eacute;es pour la consultation des journaux sont ainsi consign&eacute;es! Elle comprend (a) l'adresse IP de l'ordinateur de l'utilisateur, (b) une estampille temporelle entre crochets, (c) les arguments CGI entre parenth&egrave;ses, et (d) le nom du navigateur de l'utilisateur (sachant que le navigateur de Netscape s'appelle &laquo;Mozilla&raquo;). Voici un exemple d'une telle ligne, &eacute;chantillon ventil&eacute; et annot&eacute; pour en faciliter la lecture:</p>
<p>/fast-cgi-bin/niupepalibrary (a) its-www1.massey.ac.nz (b) [Thu Dec 07 23:47:00 NZDT 2000] (c) (a=p, b=0, bcp=, beu=, c=niupepa, cc=, ccp=0, ccs=0, cl=, cm=, cq2=, d=, e=, er=, f=0, fc=1, gc=0, gg=text, gt=0, h=, h2=, hl=1, hp=, il=l, j=, j2=, k=1, ky=, l=en, m=50, n=, n2=, o=20, p=home, pw=, q=, q2=, r=1, s=0, sp=frameset, t=1, ua=, uan=, ug=, uma=listusers, umc=, umnpw1=, umnpw2=, umpw=, umug=, umun=, umus=, un=, us=invalid, v=0, w=w, x=0, z=130.123.128.4-950647871) (d) "Mozilla/4.08 [en] (Win95; I ;Nav)" </p>
<p>Le dernier argument CGI, &laquo;z&raquo;, est un code d'identification ou &laquo;cookie&raquo; engendr&eacute; par le navigateur de l'utilisateur: il comprend le num&eacute;ro IP suivi d'une estampille temporelle portant la date de la premi&egrave;re visite de cet utilisateur &agrave; la biblioth&egrave;que num&eacute;rique.</p>
<p>Le journal usage.txt est plac&eacute; dans le r&eacute;pertoire etc de la structure de fichiers de Greenstone (voir &agrave; ce sujet le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone). Lorsque la journalisation est activ&eacute;e, chaque action de chaque utilisateur est consign&eacute;e. Cependant, seules les 100 derni&egrave;res entr&eacute;es du journal sont affich&eacute;es par le lien Journal de l'utilisation visible figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">17</a>.</p>
<p>
<a name="Section_user_management"/>
<b>4.3&nbsp;Gestion des utilisateurs</b>
</p>
<p>Greenstone incorpore un syst&egrave;me d'authentification qu'on peut utiliser pour contr&ocirc;ler l'acc&egrave;s &agrave; certaines fonctionnalit&eacute;s. Pour le moment, il ne sert qu'&agrave; restreindre l'acc&egrave;s au Collector et &agrave; certaines fonctions d'administration. Si pour une collection particuli&egrave;re il s'av&eacute;rait n&eacute;cessaire d'authentifier les utilisateurs avant de leur renvoyer des informations, cela serait &eacute;galement possible. On pourrait par exemple prot&eacute;ger individuellement des documents de telle sorte que seuls des utilisateurs enregistr&eacute;s puissent y acc&eacute;der en tapant un mot de passe. Cependant, aucune collection n'utilise cette possibilit&eacute; actuellement. L'authentification se fait en requ&eacute;rant un nom d'utilisateur et un mot de passe, comme illustr&eacute; figure&nbsp;<a href="http://www.greenstone.org/manuals/gsdl2/fr/html/User_fr_all.html">16g</a>.</p>
<p>La page d'administration permet de lister les utilisateurs, d'en ajouter de nouveaux, et d'en effacer d'anciens. &Eacute;videmment, ce pouvoir est lui aussi prot&eacute;g&eacute;: seuls les utilisateurs disposant de privil&egrave;ges d'administration peuvent ajouter de nouveaux utilisateurs. Il est &eacute;galement possible &agrave; chaque utilisateur d'appartenir &agrave; diff&eacute;rents &laquo;groupes&raquo;. Actuellement, il n'existe que deux groupes, qui sont &laquo;administrator&raquo; (administrateur) et &laquo;colbuilder&raquo; (constructeur de collection). Les membres du premier groupe peuvent ajouter et effacer des utilisateurs, et modifier leurs groupes. Les membres du second peuvent acc&eacute;der aux fonctionnalit&eacute;s d&eacute;crites plus haut pour construire de nouvelles collections et modifier (ou effacer) des collections existantes. </p>
<p>Lors de l'installation de Greenstone, il existe un utilisateur, appel&eacute; admin, qui appartient aux deux groupes. Son mot de passe est mis en place pendant le processus d'installation. Cet utilisateur peut cr&eacute;er de nouveaux identifiants et mots de passe associ&eacute;s pour des utilisateurs qui n'appartiendraient qu'au groupe colbuilder, ce qui est la m&eacute;thode conseill&eacute;e pour donner &agrave; d'autres utilisateurs la possibilit&eacute; de construire des collections. Les informations utilisateur sont stock&eacute;es dans deux bases de donn&eacute;es plac&eacute;es dans la structure de fichiers de Greenstone (voir &agrave; ce sujet le Guide du d&eacute;veloppeur de la biblioth&egrave;que num&eacute;rique Greenstone).</p>
<p>
<a name="Section_technical_information"/>
<b>4.4&nbsp;Informations techniques</b>
</p>
<p>Les liens situ&eacute;s sous l'en-t&ecirc;te Informations techniques fournissent davantage d'informations sur l'installation. Le lien G&eacute;n&eacute;ral donne acc&egrave;s aux informations techniques, y compris les r&eacute;pertoires de stockage. L'&eacute;l&eacute;ment de menu Protocoles donne, pour chaque type de protocole, des informations sur les collections accessibles par ce protocole.</p>
<p>Enfin, le code de l'interface utilisateur (appel&eacute; le &laquo;r&eacute;ceptionniste&raquo;) utilise des<i>actions</i>pour communiquer les souhaits de l'utilisateur au syst&egrave;me. Ces actions correspondent &agrave; l'argument CGI libell&eacute; &laquo;a&raquo;. Si par exemple<i>a=status</i>, le r&eacute;ceptionniste invoque l'action status, qui affiche la page d'&eacute;tats. Un &eacute;l&eacute;ment de menu donne acc&egrave;s aux listes de toutes les actions propos&eacute;es par le syst&egrave;me, et un autre m&egrave;ne aux arguments accept&eacute;s par ces actions.</p>
<p>
<b>&nbsp;Fonctionnalit&eacute;s du logiciel</b>
</p>
<table>
<tbody>
<tr>	<td>
<p>
<i>Accessible &agrave; travers un navigateur web</i> </p>
</td>	<td>
<p>On acc&egrave;de aux collections &agrave; travers un navigateur web standard (tel que Netscape ou Internet Explorer), ce qui fournit &agrave; la fois une navigation facile et des fonctionnalit&eacute;s de recherche puissantes. </p>
</td>
</tr>
<tr>	<td>
<p>
<i>Fonctionnalit&eacute;s du logiciel</i> </p>
</td>	<td>
<p>L'utilisateur peut effectuer des recherches dans le corps du texte des documents, ou choisir parmi plusieurs index construits &agrave; partir de diff&eacute;rentes portions des documents. Certaines collections proposent par exemple un index des documents complets, un index des sections, un index des titres, et un index des auteurs, qu'on peut tous s&eacute;lectionner pour rechercher certains mots ou groupes de mots. Les r&eacute;sultats peuvent &ecirc;tre ordonn&eacute;s par leur pertinence ou en utilisant une m&eacute;ta-donn&eacute;e.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Souplesse de la navigation</i> </p>
</td>	<td>
<p>L'utilisateur peut naviguer dans les listes des auteurs, des titres, des dates, des structures de classification, etc. Des collections diff&eacute;rentes pourront proposer des fonctionnalit&eacute;s de navigation diff&eacute;rentes et m&ecirc;me au sein d'une collection, on trouvera un large spectre d'interfaces de navigation. Les interfaces de recherche et de navigation sont pr&eacute;par&eacute;es pendant le processus de construction, en se fondant sur les informations de configuration de la collection.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Cr&eacute;ation automatique de structures d'acc&egrave;s</i> </p>
</td>	<td>
<p>Le logiciel Greenstone cr&eacute;e des collections d'informations tr&egrave;s faciles &agrave; maintenir. Toutes les structures de recherche et de navigation sont directement construites &agrave; partir des documents eux-m&ecirc;mes. Aucun lien n'est ins&eacute;r&eacute; manuellement, mais tous les liens existant dans les originaux sont conserv&eacute;s. Cela signifie que si de nouveaux documents du m&ecirc;me format sont disponibles, ils peuvent &ecirc;tre automatiquement fusionn&eacute;s au reste de la collection. En fait, pour la plupart des collections, tout ceci est pris en charge par des processus qui s'ex&eacute;cutent r&eacute;guli&egrave;rement, partent &agrave; la recherche de nouveaux contenus, et reconstruisent les index~---~le tout sans aucune intervention manuelle. </p>
</td>
</tr>
<tr>	<td>
<p>
<i>Utilisation des m&eacute;ta-donn&eacute;es disponibles</i> </p>
</td>	<td>
<p>On peut associer &agrave; chaque document ou &agrave; chaque section de document des m&eacute;ta-donn&eacute;es, c'est-&agrave;-dire des informations de description telles que l'auteur, le titre, la date, des mots-clefs, etc. Les m&eacute;ta-donn&eacute;es forment la mati&egrave;re premi&egrave;re des index de navigation. Elles doivent &ecirc;tre explicitement fournies, ou bien il doit &ecirc;tre possible de les obtenir automatiquement &agrave; partir des documents eux-m&ecirc;mes. La plupart des documents &eacute;lectroniques utilisent le sch&eacute;ma de m&eacute;ta-donn&eacute;es<i>Dublin Core</i>, mais il est &eacute;galement possible d'utiliser d'autres sch&eacute;mas.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Extension des possibilit&eacute;s du syst&egrave;me par greffons (&laquo;plugins&raquo;)</i> </p>
</td>	<td>
<p>Pour pouvoir utiliser plusieurs types de documents source, le logiciel est organis&eacute; d'une mani&egrave;re telle qu'on peut &eacute;crire des &laquo;greffons&raquo; (plugins) pour de nouveaux formats de documents. Il existe actuellement des greffons pour les formats texte brut, HTML, Word, PDF, PostScript, courrier &eacute;lectronique, certains formats propri&eacute;taires, et pour l'exploration r&eacute;cursive de structures de fichiers arborescentes et d'archives compact&eacute;es contenant de telles structures. Une collection peut proposer des documents de plusieurs formats source. On utilise un sch&eacute;ma semblable de &laquo;classificateurs&raquo; pour construire des index de navigation &agrave; partir des m&eacute;ta-donn&eacute;es: les classificateurs cr&eacute;ent des index de navigation de divers types en se fondant sur les m&eacute;ta-donn&eacute;es.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Con&ccedil;u pour g&eacute;rer des collections de plusieurs m&eacute;ga-octets</i> </p>
</td>	<td>
<p>Les collections peuvent contenir plusieurs millions de documents, ce qui fait du syst&egrave;me Greenstone un logiciel adapt&eacute; aux collections de taille allant jusqu'&agrave; plusieurs giga-octets.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Les documents peuvent &ecirc;tre &eacute;crits dans n'importe quelle langue</i> </p>
</td>	<td>
<p>Le logiciel utilise Unicode partout, ce qui permet de traiter tous les langages d'une mani&egrave;re consistante. &Agrave; l'heure actuelle, on a construit des collections contenant du fran&ccedil;ais, de l'espagnol, du maori, du chinois, de l'arabe, et de l'anglais. C'est une conversion &agrave; la vol&eacute;e qui traduit le format Unicode utilis&eacute; en interne en un alphabet reconnu par le navigateur web de l'utilisateur.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>L'interface utilisateur est disponible dans de nombreuses langues</i> </p>
</td>	<td>
<p>L'interface peut &ecirc;tre affich&eacute;e en de nombreuses langues. Elle est actuellement disponible en allemand, anglais, arabe, chinois, espagnol, fran&ccedil;ais, hollandais, maori, et portugais. On peut facilement ajouter de nouvelles langues &agrave; cette liste de traductions.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Les collections peuvent contenir du texte, des images, du son, et de la vid&eacute;o</i> </p>
</td>	<td>
<p>Les collections Greenstone peuvent comprendre du texte, des images, des contenus audio et vid&eacute;o. La plupart des contenus non textuels sont reli&eacute;s aux documents textuels ou accompagn&eacute;s de descriptions textuelles (telles que les l&eacute;gendes des figures) pour pouvoir &ecirc;tre accessibles depuis une recherche dans le corps du texte ou la navigation. Cependant, l'architecture du logiciel rend possible l'impl&eacute;mentation de greffons (plugins) et de classificateurs pour des donn&eacute;es non textuelles.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Utilisation de techniques de compression avanc&eacute;es</i> </p>
</td>	<td>
<p>Greenstone utilise des techniques de compression pour r&eacute;duire la taille des index et du texte. La r&eacute;duction de taille des index par voie de compression a de plus l'avantage d'acc&eacute;l&eacute;rer la vitesse de rapatriement du texte.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Fourniture d'une fonction d'administration</i> </p>
</td>	<td>
<p>Une fonction d'&laquo;administration&raquo; permet &agrave; des utilisateurs sp&eacute;cifi&eacute;s d'en autoriser de nouveaux &agrave; construire des collections, &agrave; prot&eacute;ger des documents de telle sorte que seuls des utilisateurs enregistr&eacute;s puissent y acc&eacute;der en tapant un mot de passe, &agrave; examiner la composition de toutes les collections, etc. Les journaux d'activit&eacute; utilisateur peuvent enregistrer toutes les requ&ecirc;tes effectu&eacute;es vers chaque collection Greenstone.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Les nouvelles collections apparaissent dynamiquement</i> </p>
</td>	<td>
<p>On peut mettre des collections &agrave; jour et en proposer de nouvelles &agrave; tout moment, sans devoir arr&ecirc;ter le syst&egrave;me: le processus en charge de l'interface utilisateur remarquera (gr&acirc;ce &agrave; un syst&egrave;me de sondages r&eacute;guliers) que de nouvelles collections sont apparues et les ajoutera &agrave; la liste propos&eacute;e &agrave; l'utilisateur.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Les collections peuvent &ecirc;tre publi&eacute;es sur l'Internet ou sur un c&eacute;d&eacute;rom</i> </p>
</td>	<td>
<p>On peut utiliser le logiciel pour servir des collections sur le web. Mais les collections Greenstone peuvent &ecirc;tre diffus&eacute;es, sous une forme exactement semblable, sur c&eacute;d&eacute;rom. L'interface utilisateur utilisera un navigateur web standard (Netscape est inclus sur chaque disque), et l'interaction se d&eacute;roulera de la m&ecirc;me mani&egrave;re que sur le web, &agrave; ceci pr&egrave;s que les temps de r&eacute;ponse seront plus faciles &agrave; pr&eacute;dire, et plus reproductibles car moins soumis aux al&eacute;as du r&eacute;seau. Les c&eacute;d&eacute;roms fonctionnent sous toutes les versions du syst&egrave;me d'exploitation Windows.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Les collections peuvent &ecirc;tre distribu&eacute;es sur plusieurs ordinateurs</i> </p>
</td>	<td>
<p>Une structure de processus souple permet de faire servir diff&eacute;rentes collections par des ordinateurs diff&eacute;rents, bien que tout soit pr&eacute;sent&eacute; &agrave; l'utilisateur de mani&egrave;re unifi&eacute;e, sur la m&ecirc;me page web, comme faisant partie de la m&ecirc;me biblioth&egrave;que num&eacute;rique.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Fonctionne sous Windows comme sous Unix</i> </p>
</td>	<td>
<p>Greenstone fonctionne &agrave; la fois sous Windows (versions 3.1/3.11, 95/98/Me, NT/2000) et sous Unix (Linux et SunOS). On peut utiliser n'importe lequel de ces syst&egrave;mes comme serveur web. On ne peut pas construire des collections sur des syst&egrave;mes Windows de bas de gamme, mais on peut y transf&eacute;rer des collections pr&eacute;-construites ailleurs.</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Ce que Greenstone apporte</i> </p>
</td>	<td>
<p>La biblioth&egrave;que num&eacute;rique Greenstone est un logiciel libre, disponible depuis le site web de la biblioth&egrave;que num&eacute;rique de Nouvelle-Z&eacute;lande (nzdl.org) sous les termes de la licence publique g&eacute;n&eacute;rale de GNU. le logiciel comprend tout ce qui est d&eacute;crit ci-dessus: service web, cr&eacute;ation de c&eacute;d&eacute;roms, construction de collection, possibilit&eacute;s multilingues, greffons (plugins) et classificateurs permettant d'accepter un grand nombre de formats de documents source. Il comprend une fonctionnalit&eacute; d'installation automatique pour faciliter cette op&eacute;ration sur les syst&egrave;mes Windows comme Unix. Dans l'esprit du logiciel libre, les utilisateurs sont encourag&eacute;s &agrave; nous communiquer tout rapport de bogue, correction, modification ou am&eacute;lioration.</p>
</td>
</tr>
</tbody>
</table>
<p>
</p>
<p>
<b>&nbsp;Glossaire des termes</b>
</p>
<table>
<tbody>
<tr>	<td>
<p>
<b>Terme</b> </p>
</td>	<td>
<p>
<b>Signification</b> </p>
</td>
</tr>
<tr>	<td>
<p>
<i>autoconf</i> </p>
</td>	<td>
<p>Programme Unix utilis&eacute; pour configurer le paquetage d'installation du logiciel Greenstone et l'adapter &agrave; votre syst&egrave;me</p>
</td>
</tr>
<tr>	<td>
<p>
<i>Autorun</i> </p>
</td>	<td>
<p>Fonctionnalit&eacute; de Windows qui d&eacute;marre un programme automatiquement lors de l'insertion d'un c&eacute;d&eacute;rom</p>
</td>
</tr>
<tr>	<td>
<p>Bool&eacute;enne, requ&ecirc;te</p>
</td>	<td>
<p>Requ&ecirc;te dans un syst&egrave;me de rapatriement d'informations qui peut contenir des ET, OU, et NON bool&eacute;ens </p>
</td>
</tr>
<tr>	<td>
<p>Navigation</p>
</td>	<td>
<p>Acc&egrave;s &agrave; une collection en parcourant une liste organis&eacute;e de valeurs de m&eacute;ta-donn&eacute;es associ&eacute;es aux documents (telles que l'auteur, le titre, la date, des mots-clefs)</p>
</td>
</tr>
<tr>	<td>
<p>
<i>buildcol.pl</i> </p>
</td>	<td>
<p>Programme de Greenstone utilis&eacute; pour construire des collections</p>
</td>
</tr>
<tr>	<td>
<p>Construction</p>
</td>	<td>
<p>Processus de cr&eacute;ation des structures d'indexation et de navigation utilis&eacute;es pour acc&eacute;der &agrave; une collection</p>
</td>
</tr>
<tr>	<td>
<p>C++</p>
</td>	<td>
<p>Langage de programmation dans lequel est &eacute;crit la majorit&eacute; des logiciels Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>Casse, ignorer la</p>
</td>	<td>
<p>Faire en sorte que les op&eacute;rations de recherche ne distinguent pas les majuscules des minuscules</p>
</td>
</tr>
<tr>	<td>
<p>CGI</p>
</td>	<td>
<p>Common Gateway Interface (interface commune de passerelle), syst&egrave;me qui permet &agrave; des utilisateurs d'activer des programmes sur l'ordinateur h&ocirc;te (ou serveur) en cliquant sur des pages web</p>
</td>
</tr>
<tr>	<td>
<p>CGI, script</p>
</td>	<td>
<p>Code associ&eacute; &agrave; un bouton, un menu, ou &agrave; un lien sur une page web qui sp&eacute;cifie ce que l'ordinateur h&ocirc;te (ou serveur) doit faire lorsque l'utilisateur clique sur cet objet</p>
</td>
</tr>
<tr>	<td>
<p>
<i>cgi-bin</i> </p>
</td>	<td>
<p>R&eacute;pertoire de stockage des scripts CGI</p>
</td>
</tr>
<tr>	<td>
<p>Classificateur</p>
</td>	<td>
<p>Module de code de Greenstone qui examine les m&eacute;ta-donn&eacute;es d'un document et cr&eacute;e un index de navigation</p>
</td>
</tr>
<tr>	<td>
<p>Collection</p>
</td>	<td>
<p>Ensemble de documents rassembl&eacute;s sous une interface de recherche et de navigation homog&egrave;ne</p>
</td>
</tr>
<tr>	<td>
<p>Collection, fichier de configuration</p>
</td>	<td>
<p>Fichier qui sp&eacute;cifie comment importer et construire une collection, quels index et quelles interfaces de langue fournir, etc.</p>
</td>
</tr>
<tr>	<td>
<p>Collection, serveur de</p>
</td>	<td>
<p>Programme fournissant l'acc&egrave;s &agrave; une collection en cours d'utilisation</p>
</td>
</tr>
<tr>	<td>
<p>Configuration, fichier de</p>
</td>	<td>
<p>Voir &laquo;Collection, fichier de configuration&raquo;, &laquo;Principal, fichier de configuration&raquo;, et &laquo;Site, fichier de configuration de&raquo;</p>
</td>
</tr>
<tr>	<td>
<p>CVS</p>
</td>	<td>
<p>Concurrent Versioning System (syst&egrave;me de versions concurrentes), syst&egrave;me permettant de maintenir le code source utilis&eacute; par Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>
<i>db2txt</i> </p>
</td>	<td>
<p>Outil Greenstone permettant de visualiser une base de donn&eacute;es GDBM sous forme textuelle (voir &laquo;GDBM&raquo;)</p>
</td>
</tr>
<tr>	<td>
<p>&laquo;Demo&raquo;, collection</p>
</td>	<td>
<p>Sous-ensemble de la biblioth&egrave;que de d&eacute;veloppement pour l'humanit&eacute;, distribu&eacute; avec le logiciel Greenstone &agrave; des fins d'illustration et de didacticiel</p>
</td>
</tr>
<tr>	<td>
<p>Biblioth&egrave;que num&eacute;rique</p>
</td>	<td>
<p>Collection d'objets num&eacute;riques (textes, extraits audio ou vid&eacute;o) ainsi que de m&eacute;thodes d'acc&egrave;s et de rapatriement, de s&eacute;lection, d'organisation, et de maintenance</p>
</td>
</tr>
<tr>	<td>
<p>
<i>HDL</i> </p>
</td>	<td>
<p>Humanity Development Library (biblioth&egrave;que de d&eacute;veloppement pour l'humanit&eacute;), collection Greenstone d'informations humanitaires pour les pays en voie de d&eacute;veloppement</p>
</td>
</tr>
<tr>	<td>
<p>Document</p>
</td>	<td>
<p>Unit&eacute; de base servant &agrave; construire des collections de biblioth&egrave;ques num&eacute;riques; elle peut contenir du texte, des graphiques, du son, de la vid&eacute;o, etc.</p>
</td>
</tr>
<tr>	<td>
<p>Dublin core</p>
</td>	<td>
<p>Mani&egrave;re standardis&eacute;e de d&eacute;crire les m&eacute;ta-donn&eacute;es</p>
</td>
</tr>
<tr>	<td>
<p>Fast CGI</p>
</td>	<td>
<p>Outil qui permet aux scripts CGI de demeurer actifs en permanence, de mani&egrave;re &agrave; &eacute;viter de les red&eacute;marrer de z&eacute;ro &agrave; chacune de leurs invocations</p>
</td>
</tr>
<tr>	<td>
<p>Filtre, programme de</p>
</td>	<td>
<p>La portion d'un serveur de collection Greenstone qui impl&eacute;mente les op&eacute;rations de requ&ecirc;te et de navigation</p>
</td>
</tr>
<tr>	<td>
<p>Format, cha&icirc;ne de</p>
</td>	<td>
<p>Cha&icirc;ne qui sp&eacute;cifie comment afficher les documents et autres listes dans Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>GB, encodage</p>
</td>	<td>
<p>Mani&egrave;re standardis&eacute;e d'encoder le chinois</p>
</td>
</tr>
<tr>	<td>
<p>GDBM</p>
</td>	<td>
<p>GNU DataBase Manager (gestionnaire de bases de donn&eacute;es de GNU), programme utilis&eacute; par le logiciel Greenstone pour stocker les m&eacute;ta-donn&eacute;es de chaque document</p>
</td>
</tr>
<tr>	<td>
<p>GIMP</p>
</td>	<td>
<p>GNU Image-Manipulation Program (programme de manipulation d'images de GNU), utilis&eacute; (sur Unix) pour cr&eacute;er les icones de Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>GML</p>
</td>	<td>
<p>Greenstone Markup Language (langage de balisage de Greenstone), un format compatible XML utilis&eacute; pour stocker les documents de mani&egrave;re interne</p>
</td>
</tr>
<tr>	<td>
<p>GNU, licence publique g&eacute;n&eacute;rale (GPL)</p>
</td>	<td>
<p>licence de logiciels qui permet aux utilisateurs de copier et de distribuer librement les programmes d'ordinateurs qu'elle couvre, ainsi que de les modifier, pour peu que toutes les modifications soient rendues publiques</p>
</td>
</tr>
<tr>	<td>
<p>Greenstone</p>
</td>	<td>
<p>Nom de ce logiciel de biblioth&egrave;que num&eacute;rique </p>
</td>
</tr>
<tr>	<td>
<p>GSDL</p>
</td>	<td>
<p>Abr&eacute;viation de \lang{Greenstone Digital Library} (biblioth&egrave;que num&eacute;rique Greenstone)</p>
</td>
</tr>
<tr>	<td>
<p>
<i>%GSDLHOME%</i> </p>
</td>	<td>
<p>Variable pour le syst&egrave;me d'exploitation (Windows) repr&eacute;sentant le r&eacute;pertoire racine o&ugrave; tous les programmes et collections Greenstone sont stock&eacute;s (<i>$GSDLHOME</i>sur des syst&egrave;mes Unix)</p>
</td>
</tr>
<tr>	<td>
<p>
<i>%GSDLOS%</i> </p>
</td>	<td>
<p>Variable pour le syst&egrave;me d'exploitation (Windows) repr&eacute;sentant le syst&egrave;me d'exploitation en cours d'utilisation (<i>$GSDLOS</i>sur des syst&egrave;mes Unix)</p>
</td>
</tr>
<tr>	<td>
<p>
<i>hashfile</i>DL</p>
</td>	<td>
<p>Programme Greenstone utilis&eacute; au moment de l'import ou de la construction pour g&eacute;n&eacute;rer l'OID de chaque document</p>
</td>
</tr>
<tr>	<td>
<p>HTML</p>
</td>	<td>
<p>HyperText Markup Language (langage de balisage pour l'hypertexte), le langage dans lequel la plupart des documents web sont &eacute;crits</p>
</td>
</tr>
<tr>	<td>
<p>
<i>import.pl</i> </p>
</td>	<td>
<p>Programme Greenstone utilis&eacute; pour importer des documents</p>
</td>
</tr>
<tr>	<td>
<p>Importing</p>
</td>	<td>
<p>Processus de rassemblement de collections de documents dans le syst&egrave;me Greenstone </p>
</td>
</tr>
<tr>	<td>
<p>Index</p>
</td>	<td>
<p>Structure d'information utilis&eacute;e pour la recherche ou la navigation au sein d'une collection</p>
</td>
</tr>
<tr>	<td>
<p>InstallShield</p>
</td>	<td>
<p>Programme Windows, utilis&eacute; par les c&eacute;d&eacute;roms Greenstone, qui permet &agrave; un syst&egrave;me d'&ecirc;tre install&eacute; &agrave; partir d'un c&eacute;d&eacute;rom</p>
</td>
</tr>
<tr>	<td>
<p>M&eacute;ta-donn&eacute;es</p>
</td>	<td>
<p>Informations de description telles que l'auteur, le titre, la date, des mots-clefs, etc., associ&eacute;es &agrave; un document (ou &agrave; une collection de documents)</p>
</td>
</tr>
<tr>	<td>
<p>MG</p>
</td>	<td>
<p>Managing Gigabytes (g&eacute;rer les giga-octets), programme utilis&eacute; par le syst&egrave;me Greenstone pour l'indexation du corps du texte, embarquant des techniques de compression (voir &agrave; ce sujet le livre de Witten, I.H., Moffat, A., et Bell, T. intitul&eacute; \mytitle{Managing Gigabytes: compressing and indexing documents and images} (g&eacute;rer les giga-octets: compression et indexation des documents et des images), Morgan Kaufmann, deuxi&egrave;me &eacute;dition, 1999)</p>
</td>
</tr>
<tr>	<td>
<p>
<i>mgbuild</i> </p>
</td>	<td>
<p>Programme MG utilis&eacute; pour construire un index de corps du texte</p>
</td>
</tr>
<tr>	<td>
<p>
<i>mgquery</i> </p>
</td>	<td>
<p>Programme MG utilis&eacute; pour effectuer des requ&ecirc;tes dans un index compress&eacute; de corps du texte</p>
</td>
</tr>
<tr>	<td>
<p>
<i>mkcol.pl</i> </p>
</td>	<td>
<p>Programme Greenstone qui cr&eacute;e et initialise la structure de r&eacute;pertoire d'une nouvelle collection</p>
</td>
</tr>
<tr>	<td>
<p>Nouvelle-Z&eacute;lande, projet de biblioth&egrave;que num&eacute;rique de</p>
</td>	<td>
<p>Projet de recherche du d&eacute;partement d'informatique de l'universit&eacute; de Waikato en Nouvelle-Z&eacute;lande, qui a cr&eacute;&eacute; le logiciel Greenstone (nzdl.org)</p>
</td>
</tr>
<tr>	<td>
<p>OID</p>
</td>	<td>
<p>Object Identifier (identifiant d'objet), code d'identification unique associ&eacute; &agrave; un document</p>
</td>
</tr>
<tr>	<td>
<p>Perl</p>
</td>	<td>
<p>Langage de programmation utilis&eacute; pour une grande partie des op&eacute;rations de manipulation de texte se d&eacute;roulant lors du processus de construction</p>
</td>
</tr>
<tr>	<td>
<p>Ping</p>
</td>	<td>
<p>Message envoy&eacute; &agrave; un syst&egrave;me pour d&eacute;terminer s'il est en fonctionnement ou non</p>
</td>
</tr>
<tr>	<td>
<p>Greffon (&laquo;plugin&raquo;)</p>
</td>	<td>
<p>Module de code qui g&egrave;re des documents de divers formats, utilis&eacute; lors des processus d'import et de construction</p>
</td>
</tr>
<tr>	<td>
<p>Protocole</p>
</td>	<td>
<p>Ensemble de conventions par lesquelles le r&eacute;ceptionniste de Greenstone communique avec un serveur de collection</p>
</td>
</tr>
<tr>	<td>
<p>Ordonn&eacute;e, requ&ecirc;te</p>
</td>	<td>
<p>Requ&ecirc;te &agrave; un syst&egrave;me de rapatriement d'informations effectu&eacute;e en langage naturel, et ordonnant les documents trouv&eacute;s par ordre de pertinence</p>
</td>
</tr>
<tr>	<td>
<p>R&eacute;ceptionniste</p>
</td>	<td>
<p>Programme qui organise l'interface utilisateur de Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>RTF</p>
</td>	<td>
<p>Rich Text Format (format de texte enrichi), format standard pour l'&eacute;change de documents texte</p>
</td>
</tr>
<tr>	<td>
<p>Recherche</p>
</td>	<td>
<p>Acc&egrave;s &agrave; une collection &agrave; travers une recherche dans le corps du texte de ses contenus (ou d'une partie de ses contenus, telle que les titres de sections)</p>
</td>
</tr>
<tr>	<td>
<p>Serveur</p>
</td>	<td>
<p>Voir &laquo;Collection, serveur de&raquo; et &laquo;Web, serveur&raquo;</p>
</td>
</tr>
<tr>	<td>
<p>
<i>setup.bat, setup.sh, setup.csh</i> </p>
</td>	<td>
<p>Script utilis&eacute; pour mettre en place l'environnement n&eacute;cessaire &agrave; la reconnaissance du logiciel Greenstone</p>
</td>
</tr>
<tr>	<td>
<p>Site, fichier de configuration de</p>
</td>	<td>
<p>Fichier contenant les sp&eacute;cifications utilis&eacute;es pour configurer le logiciel Greenstone pour le site particulier sur lequel il est install&eacute;. </p>
</td>
</tr>
<tr>	<td>
<p>Troncature</p>
</td>	<td>
<p>&Ocirc;ter la terminaison d'un mot dans un terme de requ&ecirc;te pour g&eacute;n&eacute;raliser la requ&ecirc;te</p>
</td>
</tr>
<tr>	<td>
<p>STL</p>
</td>	<td>
<p>
<i>Standard template library</i> (biblioth&egrave;que standard de patrons), biblioth&egrave;que tr&egrave;s r&eacute;pandue de code C++, d&eacute;velopp&eacute;e par Silicon Graphics</p>
</td>
</tr>
<tr>	<td>
<p>txt2db</p>
</td>	<td>
<p>Programme Greenstone utilis&eacute; au moment de la construction pour cr&eacute;er la base de donn&eacute;es GDBM</p>
</td>
</tr>
<tr>	<td>
<p>Unicode</p>
</td>	<td>
<p>Syst&egrave;me standard de repr&eacute;sentation des ensembles de caract&egrave;res utilis&eacute;s dans les langues du monde</p>
</td>
</tr>
<tr>	<td>
<p>UNU</p>
</td>	<td>
<p>L'universit&eacute; des Nations-Unies; on utilise &eacute;galement ce sigle pour &eacute;voquer une collection Greenstone cr&eacute;&eacute;e pour cette organisation</p>
</td>
</tr>
<tr>	<td>
<p>Web, serveur</p>
</td>	<td>
<p>Programme standard utilis&eacute; par les ordinateurs pour publier de l'information sur le web</p>
</td>
</tr>
<tr>	<td>
<p>XML</p>
</td>	<td>
<p>Format standard pour les documents et les donn&eacute;es structur&eacute;s sur le web (le langage de balisage de Greenstone&mdash;voir &agrave; ce sujet &laquo;GML&raquo;&mdash;est un format compatible XML)</p>
</td>
</tr>
</tbody>
</table>
<p/>
<p/>
<p>[1] N.D.T. : Respectivement &laquo;et&raquo;, &laquo;ou&raquo;, et &laquo;non&raquo; en anglais. </p>
</td>
</tr>
</tbody>
</table>
<p/>
<p>Copyright &copy; 2002 2003 2004 2005 2006 2007 by the <a href="http://www.nzdl.org">New Zealand Digital Library Project</a> at <a href="http://www.waikato.ac.nz">the University of Waikato</a>, New Zealand.</p>
<p>Permission is granted to copy, distribute and/or modify this document under the terms of the <a href="http://www.gnu.org/licenses/fdl.html">GNU Free Documentation License</a>, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled <a href="http://greenstonewiki.cs.waikato.ac.nz/wiki/gsdoc/GNUFDL.html">&ldquo;GNU Free Documentation License.&rdquo;</a> </p>
<p/>
</body>
</html>
