<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>PRESENTACI&Oacute;N DE ABCD</title>
</head>
<body>
<p>ABCD 3.0
Automatizaci&oacute;n de Bibliotecas y Centros de Documentaci&oacute;n
</p>
<p>Project 3 &ndash; ELINF 

</p>
<p>Avances hacia una version 3.0 en el desarrollo de abcd para la educaci&oacute;n superior cubana</p>
<p>1</p>
<p>Resultados</p>
<p>ABCD 3.0</p>
<p>Se desarroll&oacute; una aplicaci&oacute;n web en Java con tecnolog&iacute;as de c&oacute;digo abierto, que informatiza los procesos bibliotecarios.

El sistema presenta una arquitectura modular, que facilita su personalizaci&oacute;n, extensi&oacute;n y mantenimiento.

Para la catalogaci&oacute;n de materiales se utiliza JISIS y la Norma de Catalogaci&oacute;n MARC 21.
</p>
<p>Resultados ABCD 3.0</p>
<p>El sistema es configurable, desde la administraci&oacute;n y desde el despliegue de sus m&oacute;dulos.

Brinda soporte de localizaci&oacute;n en espa&ntilde;ol e ingl&eacute;s y permite incluir otros idiomas.

Soporta seguridad basada en roles que son definidos por cada biblioteca.</p>
<p>Resultados ABCD 3.0</p>
<p>Resultados ABCD 3.0</p>
<p>Brinda retroalimentaci&oacute;n al usuario de sus acciones en el sistema.

Aplica validaciones a los datos que se registran para garantizar que la informaci&oacute;n almacenada sea correcta y est&eacute; completa.

Permite exportar informaci&oacute;n en formatos PDF y XLS y  la configuraci&oacute;n de los reportes estad&iacute;sticos que necesite la organizaci&oacute;n donde se implante.</p>
<p>Automatiza tareas del negocio: pol&iacute;ticas de sanciones, plazos de pr&eacute;stamos, env&iacute;o de notificaciones v&iacute;a correo electr&oacute;nico.

Cuenta con materiales de autoaprendizaje, manual de usuario y ayuda del sistema.

Es adaptable a varias resoluciones de pantalla, por lo que puede ser utilizado desde varios dispositivos. 
</p>
<p>Resultados ABCD 3.0</p>
<p>Oportunidades</p>
<p>ABCD 3.0</p>
<p>ABCD 1.2 vs ABCD 3.0</p>
<div class="embedded" id="slide8_rId3"/>
<p>8</p>
<p>ABCD 3.0 es un sistema de c&oacute;digo abierto.

Migraci&oacute;n tecnol&oacute;gica, en bibliotecas o centros de documentaci&oacute;n que almacenen la informaci&oacute;n en ISIS o que cumplan alguna de las normas: MARC 21, MARCXML.

Automatizaci&oacute;n de tareas de la biblioteca mediante el sistema.</p>
<p>Oportunidades de ABCD 3.0</p>
<p>Soluci&oacute;n a la medida, a partir del despliegue de los m&oacute;dulos que sean pertinentes a la instituci&oacute;n,  con configuraci&oacute;n propia y la personalizaci&oacute;n de la misma mediante la creaci&oacute;n de nuevos componentes.

Evaluaci&oacute;n y control de procesos, a partir de la generaci&oacute;n de reportes estad&iacute;sticos configurables.</p>
<p>Oportunidades ABCD 3.0</p>
<p>Preguntas

Dudas

Sugerencias</p>
<p>ABCD 3.0
Automatizaci&oacute;n de Bibliotecas y Centros de Documentaci&oacute;n
</p>
<p>Project 3 &ndash; ELINF 

</p>
<p>Avances hacia una version 3.0 en el desarrollo de abcd para la educaci&oacute;n superior cubana</p>
<p>12</p>
</body>
</html>
