<h3><strong>Solicita&ccedil;&atilde;o de Licita&ccedil;&otilde;es</strong></h3>
<p>Neste processo s&atilde;o mostradas tanto as sugest&otilde;es que s&atilde;o aprovadas como aquelas que est&atilde;o em processo de licita&ccedil;&atilde;o. A f&oacute;rmula de busca que se aplica sobre a base de dados &eacute; :<strong>&nbsp;STA_1 or STA_3</strong>, a qual mostra os registros cujo status seja <strong>1=aprovado</strong> ou <strong>3=em licita&ccedil;&atilde;o</strong> </p>
<p>Mostra as seguintes informa&ccedil;&otilde;es:</p>
<ul>
    <li>N&uacute;mero sequencial atribu&iacute;do de forma autom&aacute;tica &agrave; sugest&atilde;o</li>
    <li>Data de aprova&ccedil;&atilde;o da sugest&atilde;o</li>
    <li>N&uacute;mero de copias (exemplares) aprovadas</li>
    <li>T&iacute;tulo do objeto</li>
    <li>Data de in&iacute;cio do processo de licita&ccedil;&atilde;o</li>
    <li>Fornecedores selecionados:
    <ul>
        <li>Nome do fornecedor</li>
        <li>N&uacute;mero de exemplares solicitados</li>
        <li>Montante pago</li>
        <li>Observa&ccedil;&otilde;es</li>
        <li>Selecionado (Sim/N&atilde;o)</li>
        <li>Data da sele&ccedil;&atilde;o</li>
        <li>Data ISO da sele&ccedil;&atilde;o</li>
        <li>N&uacute;mero da nota emitida</li>
    </ul>
    </li>
</ul>
<p>Os registros obtidos podem ser classificados segundo tr&ecirc;s crit&eacute;rios,e para cada crit&eacute;rio existe um formato (PFT) que permite apresentar a informa&ccedil;&atilde;o na ordem selecionada e fornecer as etiquetas das colunas da tabela:</p>
<p>
<table width="90%" cellspacing="1" cellpadding="1" border="1" summary="">
    <tbody>
        <tr>
            <td bgcolor="#cc99ff"><font size="3"><strong> ordem  de apresenta&ccedil;&atilde;o</strong></font></td>
            <td bgcolor="#cc99ff"><font size="3"><strong>Formato de implanta&ccedil;&atilde;o</strong></font></td>
            <td bgcolor="#cc99ff"><font size="3"><strong>T&iacute;tulo das colunas</strong></font></td>
        </tr>
        <tr>
            <td>T&iacute;tulo do objeto</td>
            <td>ti_bidding.pft</td>
            <td>ti_bidding_tit.tab</td>
        </tr>
        <tr>
            <td>Recomendado por</td>
            <td>rb_bidding.pft</td>
            <td>rb_bidding_tit.tab</td>
        </tr>
        <tr>
            <td>Data de aprova&ccedil;&atilde;o</td>
            <td>da_bidding.pft</td>
            <td>da_bidding_tit.tab</td>
        </tr>
    </tbody>
</table>
</p>
<p>Clique sobre <img alt="" src="../../central/images/edit.png" />&nbsp; para editar uma solicita&ccedil;&atilde;o, para preencher os dados relativos ao pedido delicita&ccedil;&atilde;o do objeto.</p>
<p>Clique sobre<img alt="" src="../../central/images/zoom.png" />&nbsp; para apresentar os dados da sugest&atilde;o e aprova&ccedil;&atilde;o de compra&nbsp;do objeto</p>
<p>Voc&ecirc; pode enviar esta sa&iacute;da para um editor de texto, planilha eletr&ocirc;nica, utilizando os links que s&atilde;o apresentados no menu A&ccedil;&atilde;o,localizado no topo. Neste caso, a sa&iacute;da preparada exibe uma lista para cada fornecedor selecionado no processo de listagem de um objeto; isto &eacute;, se um objeto possu&iacute; tr&ecirc;s fornecedores o objeto apresentar&aacute; tr&ecirc;s linhas na tabela. Isso facilitar&aacute; o agrupamento das solicita&ccedil;&otilde;es com base no fornecedor.</p>