<h3><strong>Decis&atilde;o do processo de negocia&ccedil;&atilde;o</strong></h3>
<font face="Arial" size="2">
<p>Neste ponto do processo, as sugest&otilde;es aprovadas j&aacute; devem ter a lista de fornecedores para os quais se solicitou uma cota&ccedil;&atilde;o.&nbsp; Para localizar estas sugest&otilde;es aplica-se a seguinte express&atilde;o de pesquisa:&nbsp;<strong>STA_1 or STA_3</strong> <strong>or STA_4</strong>, recuperando assim as sugest&otilde;es aprovadas (estatus=1) ou sugest&otilde;es em&nbsp; processo de negocia&ccedil;&atilde;o (estatus=3), ou aquelas sugest&otilde;es que j&aacute; t&ecirc;m pelo menos um fornecedor selecionado (estatus=4).</p>
<p>A informa&ccedil;&atilde;o apresentada &eacute; a seguinte:</p>
<ul>
    <li> N&uacute;mero. sequencial da sugest&atilde;o </li>
    <li>Dados do objeto solicitado</li>
    <li>Data de aprova&ccedil;&atilde;o da sugest&atilde;o</li>
    <li>N&uacute;mero de copias (exemplares) aprovadas</li>
    <li>Dados dos fornecedores aprovados para a&nbsp;compra&nbsp;dos exemplares do objeto
    <ul>
        <li>Nome do fornecedor</li>
        <li>Data da aprova&ccedil;&atilde;o</li>
        <li>Pre&ccedil;o de cada exemplar do objeto</li>
        <li>N&uacute;mero de exemplares a serem adquiridos</li>
        <li>Observa&ccedil;&otilde;es</li>
    </ul>
    </li>
</ul>
<p>Clique sobre <img src="../../central/images/edit.png" alt="" />&nbsp;para inseriros dados dos fornecedores que tiveram aprovada a compra do objeto</p>
<p>Clique sobre <img src="../../central/images/zoom.png" alt="" />&nbsp;para revisaros dados da sugest&atilde;o.</p>
<p>A informa&ccedil;&atilde;o pode ser ordenada por <strong>T&iacute;tulo</strong>,<strong>&nbsp;data de aprova&ccedil;&atilde;o da sugest&atilde;o</strong>, &nbsp;<strong>nome da pessoa ou institui&ccedil;&atilde;o que fez a sugest&atilde;o</strong></p>
<p>Cada uma destas possibilidades est&aacute; associada a um formato definido, no qualse especifica o seguinte:</p>
<p>
<table width="400" cellspacing="1" cellpadding="1" border="1" summary="">
    <tbody>
        <tr>
            <td><strong>Orden de apresenta&ccedil;&atilde;o</strong></td>
            <td><strong>Formatos utilizados</strong></td>
        </tr>
        <tr>
            <td>T&iacute;tulo</td>
            <td>
            <p>ti_decision.pft<br />
            ti_decision_tit.tab</p>
            </td>
        </tr>
        <tr>
            <td>Data inicio licita&ccedil;&atilde;o </td>
            <td>da_decision.pft<br />
            da_decision_tit.tab</td>
        </tr>
        <tr>
            <td>Sugerido por</td>
            <td>rb_decision.pft<br />
            rb_decision_tit.tab</td>
        </tr>
    </tbody>
</table>
</p>
<p>Pode enviar o quadro resumo, em forma de documento ou de planilha eletr&ocirc;nica,utilizando as op&ccedil;&atilde;o <strong>Enviar a</strong></p>
<p>Uma vez que a sugest&atilde;o tem ao menos um fornecedor aprovado pode-se passar ao processo de emiss&atilde;o da ordem de compra. Para isso clique sobre o <strong>Menu</strong> e no sub-menu <strong>Ordens decompra </strong>selecione&nbsp; a op&ccedil;&atilde;o <strong>Criar ordem </strong>&nbsp;</p>
<br />
</font>