<html>

    <head>

        <title></title>

    </head>

<p>Antes de usar esta op&ccedil;&atilde;o, &eacute; necess&aacute;rio configurar as vari&aacute;veis da base de dados envolvidas nas estat&iacute;sticas e opcionalmente, nas tabelas de frequ&ecirc;ncia e/ou conting&ecirc;ncia, onde estas se aplicam.</p>
<p>Para configurar as vari&aacute;veis envolvidas nos processos de  estat&iacute;stica, use a op&ccedil;&atilde;o <strong>configura&ccedil;&atilde;o de estat&iacute;sticas</strong> ou <strong>Modificar defini&ccedil;&atilde;o de bases de dados </strong>do menu inicial do m&oacute;dulo de administra&ccedil;&atilde;o e execute<br />
</p>
<p><strong>Gera&ccedil;&atilde;o de estat&iacute;sticas</strong></p>
<p><em><strong>Usar uma tabela existente</strong></em></p>
<p>Se houver tabelas, &eacute; exibido um menu tipo pulldown com as tabelas previamente definidas na op&ccedil;&atilde;o <strong>Modificar defini&ccedil;&atilde;o de bases de
dados</strong>. Selecione a tabela que deseja utilizar.</p>
<p><strong><em>Criar uma tabela</em></strong></p>
<p>&eacute; exibida a  lista de&nbsp;campos da base de dados que tenham sido selecionados para a obten&ccedil;&atilde;o de  estat&iacute;sticas. Selecione o campo a utilizar nas linhas  e  opcionalmente,&nbsp;o campo a utilizar nas colunas.</p>
<p><em>Obs: </em>coloque como linhas o campo que possui a maior diversidade de valores.</p>
<p><strong><em>Gerar sa&iacute;da</em></strong></p>
<p>Nesta se&ccedil;&atilde;o  indique o m&eacute;todo de sele&ccedil;&atilde;o dos registros para os quais deseja obter uma matriz de frequ&ecirc;ncia ou de conting&ecirc;ncia.</p>
<ul>
    <li><em>Por faixa de Mfn</em></li>
    <li><em>Por pesquisa</em></li>
</ul>
<p>Se selecionar <em>por pesquisa</em> ser&aacute; exibida, numa janela pop-up,&nbsp;o formul&aacute;rio de pesquisa avan&ccedil;ada para ajudar na constru&ccedil;&atilde;o da express&atilde;o de pesquisa a
ser  aplicada &aacute; base de dados, para extrair os registros cujos campos ser&atilde;o quantificados. </p>
<p>Uma vez constru&iacute;da a express&atilde;o, clique em <img alt="" src="../../central/dataentry/img/barSearch.png" />&nbsp;
para<em> envia</em>r&nbsp; a express&atilde;o de pesquisa ao  formul&aacute;rio de estat&iacute;sticas.</p>
<p>Deve escolher somente um  m&eacute;todo de extra&ccedil;&atilde;o de registros: por Mfn ou por pesquisa.</p>
<p>Uma vez fornecidos os dados no formul&aacute;rio, clique em <strong>Enviar</strong> para obter os resultados correspondentes.</p>
<p>&nbsp;</p>
<hr />
&nbsp;
<p>&nbsp;</p>
<p><strong><a name="TABLE"></a>Gera&ccedil;&atilde;o da tabela</strong></p>
<p>Com os valores fornecidos no formul&aacute;rio de estat&iacute;sticas, cria-se a matriz de frequ&ecirc;ncia ou conting&ecirc;ncia solicitada.</p>
<p>Junto com o desdobramento do quadro, s&atilde;o desdobradas as op&ccedil;&otilde;es para enviar o resultado por um dos seguintes meios:</p>
<ul>
    <li>Uma planilha eletr&ocirc;nica (.xls)</li>
    <li>Um documento (.doc)</li>
    <li>Gerar um gr&aacute;fico animado</li>
    <li>Gerar um gr&aacute;fico n&atilde;o animado</li>
</ul>
<p><strong>Planilha eletr&ocirc;nica</strong></p>
<p>A tabela de estat&iacute;sticas &eacute; constru&iacute;da e &eacute; aberto o programa associado, no cliente, aos arquivos .xls.</p>
<p><strong>Documento</strong></p>
<p>A tabela de estat&iacute;sticas &eacute; constru&iacute;da e &eacute; aberto o programa associado, no cliente, aos arquivos .doc.</p>
<p><strong>Gr&aacute;fico animado</strong></p>
<p>Os resultados s&atilde;o enviados a um plug-in gerador de  gr&aacute;ficos animados</p>
<p><strong>Gr&aacute;fico n&atilde;o animado</strong></p>
<p>Os resultados s&atilde;o enviados a um plug-in gerador de gr&aacute;ficos n&atilde;o animados.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</html>