<p><strong>Gera&ccedil;&atilde;o automatica do n&uacute;mero de controle dos registros de uma base de dados<br />
<br />
</strong>Esta op&ccedil;&atilde;o permite atribuir de forma autom&aacute;tica um n&uacute;mero sequencial consecutivo aos registros de uma base de dados.<br />
<br />
Na FDT,  defina o campo de controle como tipo de campo &quot;Autoincrement&quot;. Na defini&ccedil;&atilde;o do campo inclua o prefixo com o qual o dado &eacute; indexado no arquivo invertido e nos formatos de exibi&ccedil;&atilde;o e extra&ccedil;&atilde;o correspondentes.<br />
<br />
A numera&ccedil;&atilde;o est&aacute; no arquivo <strong>control_number.cn</strong>, armazenado na pasta <strong>data</strong> da base de dados correspondente. Neste arquivo &eacute; armazenado o &uacute;ltimo n&uacute;mero atribu&iacute;do no processo de entrada de dados.</p>
<p>O n&uacute;mero de controle n&atilde;o pode ser inserido diretamente, no formul&aacute;rio de entrada do registro. A atribui&ccedil;&atilde;o do n&uacute;mero pode ser feita por um dos seguintes m&eacute;todos:</p>
<ol>
    <li>Se deixar o campo em branco, no momento de armazenar o registro, determina-se o pr&oacute;ximo n&uacute;mero a ser atribu&iacute;do e o mesmo &eacute; gravado no campo correspondente</li>
    <li>Se quiser atribuir diretamente um n&uacute;mero de controle, pode seguir o seguinte procedimento:
      <ul>
        <li>Clique no link <strong>Atribuir</strong> que &eacute; exibido ao lado do campo n&uacute;mero de controle</li>
        <li>&Eacute; &eacute;xibida uma nova janela para que se digite o novo n&uacute;mero a ser atribu&iacute;do</li>
        <li>Clique em <strong>Enviar</strong> para verificar se o novo n&uacute;mero de controle n&atilde;o existe </li>
        <li>Se o n&uacute;mero de controle ainda n&atilde;o existe, o valor &eacute; inserido no campo</li>
        <li>Se o n&uacute;mero de controle j&aacute; existe na base, na mesma janela &eacute; exibido o registro do documento que tem o n&uacute;mero. Clique em <strong>Voltar</strong> para atribuir outro n&uacute;mero ou em <strong>Fechar</strong> para fechar a janela</li>
    </ul>
  </li>
    <li>Para deixar o campo de n&uacute;mero de controle em branco,  clique em <strong>Atribuir</strong> e na janela aberta, deixe   a caixa do n&uacute;mero em branco, e em seguida clique em <strong>Enviar</strong>.</li>
</ol>
<p>&nbsp;</p>