<h4>Mudan&ccedil;as Globais</h4>
<p><font face="Comic Sans MS" size="2">Para executar mudan&ccedil;as globais siga a seguinte sequ&ecirc;ncia:</font></p>
<ol>
    <li><font face="Comic Sans MS" size="2">Escolha o m&eacute;todo de sele&ccedil;&atilde;o dos registros</font></li>
    <li><font face="Comic Sans MS" size="2">Selecione o campo ao qual ser&aacute; aplicada a mudan&ccedil;a</font></li>
    <li><font face="Comic Sans MS" size="2">Selecione o tipo de mudan&ccedil;a a realizar:</font>
    <ul>
        <li><font face="Comic Sans MS" size="2">Acrescentar</font></li>
        <li><font face="Comic Sans MS" size="2">Alterar</font></li>
        <li><font face="Comic Sans MS" size="2">Excluir</font></li>
        <li><font face="Comic Sans MS" size="2">Dividir</font></li>
    </ul>
    </li>
    <li><font face="Comic Sans MS" size="2">Informe o valor&nbsp;contido atualmente no campo para que a modifica&ccedil;&atilde;o seja aplicada, por exemplo, excluir o campo 30, quando o mesmo tiver o valor "Medicina".</font></li>
    <li><font face="Comic Sans MS" size="2">Se a mudan&ccedil;a for <strong>Alterar, </strong>selecione a abrang&ecirc;ncia da altera&ccedil;&atilde;o:</font>
    <ul>
        <li><font face="Comic Sans MS" size="2">A todo o campo</font></li>
        <li><font face="Comic Sans MS" size="2">A uma parte do campo</font></li>
    </ul>
    </li>
    <li><font face="Comic Sans MS" size="2">Selecione o novo valor a acrescentar ou a alterar</font></li>
    <li><font face="Comic Sans MS" size="2">Se a mudan&ccedil;a for <strong>Dividir</strong>, selecione:</font>
    <ul>
        <li><font face="Comic Sans MS" size="2">O caractere ou caracteres a ser(em) usado(s) como delimitador&nbsp;</font></li>
        <li><font face="Comic Sans MS" size="2">O campo para onde ser&aacute; movida a parte selecionada</font></li>
        <li><font face="Comic Sans MS" size="2">Qual parte do campo ser&aacute; movida para o campo selecionado</font></li>
    </ul>
    </li>
</ol>
<p><font face="Comic Sans MS" size="2">&nbsp;<a name="SEL"></a><strong>M&eacute;todo de sele&ccedil;&atilde;o dos registros</strong></font></p>
<p><font face="Comic Sans MS" size="2">Os registros, aos quais ser&aacute; aplicada a mudan&ccedil;a global, podem ser selecionados de duas formas:</font></p>
<ol>
    <li><font face="Comic Sans MS" size="2">Informando um intervalo de MFN</font></li>
    <li><font face="Comic Sans MS" size="2">Formulando e aplicando uma express&atilde;o de pesquisa. Neste caso ser&aacute; apresentado o formul&aacute;rio de pesquisa avan&ccedil;ada no qual deve ser formulada a express&atilde;o de pesquisa</font></li>
</ol>
<p><font face="Comic Sans MS" size="2">Escolha o m&eacute;todo de recupera&ccedil;&atilde;o que permita selecionar os registros aos quais ser&aacute; aplicada a mudan&ccedil;a.</font></p>
<p><a name="CAMPO"></a><strong><font face="Comic Sans MS" size="2">Campo no qual a mudan&ccedil;a ser&aacute; realizada.</font></strong></p>
<p><font face="Comic Sans MS" size="2">No menu &eacute; apresentada a lista de campos definidos na FDT. Selecione!</font></p>
<p><strong><font face="Comic Sans MS" size="2"><a name="TIPO_CAMBIO"></a>Tipo de mudan&ccedil;a</font></strong></p>
<p><font face="Comic Sans MS" size="2">Existem tr&ecirc;s tipos de mudan&ccedil;as:</font></p>
<ol>
    <li><font face="Comic Sans MS" size="2">Acrescentar campo</font></li>
    <li><font face="Comic Sans MS" size="2">Alterar o conte&uacute;do de um campo</font></li>
    <li><font face="Comic Sans MS" size="2">Excluir um campo</font></li>
</ol>
<p><font face="Comic Sans MS" size="2">A mudan&ccedil;a correspondente à op&ccedil;&atilde;o escolhida&nbsp;ser&aacute; aplicada&nbsp;ao campo selecionado dos registros recuperados, quer atrav&eacute;s de intervalo de MFN ou atrav&eacute;s de pesquisa.&nbsp;</font></p>
<p><font face="Comic Sans MS" size="2"><strong><a name="ALCANCE"></a>Abrang&ecirc;ncia da mudan&ccedil;a</strong></font></p>
<p><font face="Comic Sans MS" size="2">Se foi selecionada a op&ccedil;&atilde;o <strong>Alterar o conte&uacute;do de um campo</strong>, esta op&ccedil;&atilde;o indica se deve ser substitu&iacute;do o campo completo ou pode ser aplicado a uma parte do mesmo. Por exemplo, para substituir o conte&uacute;do de um subcampo em particular.</font></p>
<p><a name="VALOR"></a><strong><font face="Comic Sans MS" size="2">Aplicar a mudan&ccedil;a de acordo com o conte&uacute;do do campo</font></strong></p>
<p><font face="Comic Sans MS" size="2">Esta caixa permite informar uma lista de termos que ir&atilde;o condicionar a aplica&ccedil;&atilde;o da mudan&ccedil;a, isto &eacute;, se o conte&uacute;do atual do campo coincide pelo menos com&nbsp;um dos termos especificados, a mudan&ccedil;a ser&aacute; aplicada. Se n&atilde;o for especificado nenhum valor, a mudan&ccedil;a ser&aacute; realizada incondicionalmente.</font></p>
<p><a name="NUEVO_VALOR"></a><strong><font face="Comic Sans MS" size="2">Novo valor do campo</font></strong></p>
<p><font face="Comic Sans MS" size="2">Insira nesta caixa o valor que vai ser acrescentado ou substitu&iacute;do no campo solicitado.</font></p>
<p><a name="DIVIDIR"></a><strong><font face="Comic Sans MS" size="2">Dividir um campo</font></strong></p>
<p><font face="Comic Sans MS" size="2">Esta op&ccedil;&atilde;o permite localizar um sinal de pontua&ccedil;&atilde;o ou delimitador dentro de um campo, para:</font></p>
<ul>
    <li><font face="Comic Sans MS" size="2">Transferir uma parte&nbsp;para outro campo</font></li>
    <li><font face="Comic Sans MS" size="2">Excluir uma parte</font></li>
</ul>
<p><font face="Comic Sans MS" size="2">Pode selecionar qual parte do campo (antes ou ap&oacute;s o delimitador) que ser&aacute; exclu&iacute;da ou transferida para outro campo.</font></p>
<p><strong><font face="Comic Sans MS" size="2">Execu&ccedil;&atilde;o da mudan&ccedil;a.</font></strong></p>
<p><font face="Comic Sans MS" size="2">A mudan&ccedil;a ser&aacute; executada por lotes de registros. Ser&aacute; apresentado um v&iacute;nculo aos registros para que a execu&ccedil;&atilde;o do processo possa ser revisada.</font></p>
<p><strong><font face="Comic Sans MS" size="2">Nota importante: Certifique-se de obter um backup da base de dados antes de executar um processo de mudan&ccedil;a global.</font></strong></p>