

<center>

<table width="90%">

    <tbody>

        <tr>

            <td><font face="arial"><strong><font size="2">Tabela de convers&atilde;o para exporta&ccedil;&atilde;o da base de dados para um arquivo TXT com etiquetas</font></strong>

            <p><font face="arial"></font></p>

            <p align="justify"><font size="2">A tabela de convers&atilde;o &eacute; usada tanto para exportar como para importar registros, aplicando-se, em cada caso, as seguintes regras:</font></p>

            <p align="justify"><font size="2">Use a caixa <input type="checkbox" name="delimited" value="on" />&nbsp;<strong>Delimitada com tabuladores</strong>, para importar uma planilha Excel salva no formato TXT. Neste caso a coluna <strong>Etiqueta no arquivo TXT </strong> deverá conter o n&uacute;mero da coluna (come&ccedil;ando por 1), onde se encontra o campo correspondente na planilha Excel exportada.</font></p>

            <p><font size="2">Consta das seguintes colunas:</font>

            <table width="90%" bgcolor="#cccccc">

                <tbody>

                    <tr>

                        <td valign="top" nowrap="nowrap" bgcolor="#ffffff"><font face="arial" size="2">Etiqueta&nbsp;no arquivo TXT</font></td>

                        <td bgcolor="#ffffff"><font face="arial"><font size="2">Etiqueta&nbsp;com a qual se identifica o campo no arquivo TXT de entrada ou de sa&iacute;da. As&nbsp;etiquetas devem come&ccedil;ar com <strong>$$</strong> e terminar com <strong>:</strong></font></font></td>

                    </tr>

                    <tr>

                        <td valign="top" bgcolor="#ffffff"><font face="arial" size="2">Tag</font></td>

                        <td bgcolor="#ffffff"><font face="arial" size="2">Etiqueta (Tag) do campo na base de dados.</font></td>

                    </tr>

                    <tr>

                        <td valign="top" bgcolor="#ffffff"><font face="arial" size="2">Subcampos</font></td>

                        <td bgcolor="#ffffff"><font face="arial" size="2">Delimitadores de subcampos. Se o primeiro subcampo n&atilde;o tiver delimitador, deixar um espa&ccedil;o em branco.</font></td>

                    </tr>

                    <tr>

                        <td valign="top" bgcolor="#ffffff"><font face="arial" size="2">Substituir por</font></td>

                        <td bgcolor="#ffffff"><font face="arial" size="2">Se um campo tiver subcampos, indicar aqui os caracteres que ir&atilde;o substituir os subcampos do campo. O primeiro caractere desta lista irá substituir o primeiro subcampo da lista de subcampos. Se o primeiro subcampo n&atilde;o será substitu&iacute;do por nenhum delimitador, deixar um espa&ccedil;o em branco.</font></td>

                    </tr>

                    <tr>

                        <td valign="top" bgcolor="#ffffff"><font face="arial" size="2">Separador de ocorrências</font></td>

                        <td bgcolor="#ffffff"><font face="arial" size="2">Indique aqui o caractere com o qual s&atilde;o separadas as ocorrências de um campo repetitivo.</font></td>

                    </tr>

                    <tr>

                        <td valign="top" bgcolor="#ffffff"><font face="arial" size="2">Formato de extra&ccedil;&atilde;o</font></td>

                        <td bgcolor="#ffffff"><font face="arial" size="2">Este formato &eacute; aplicado ao registro para gerar a sa&iacute;da do campo associado. A aplica&ccedil;&atilde;o do formato de extra&ccedil;&atilde;o só &eacute; executada no processo de exporta&ccedil;&atilde;o. Se forem submetidos delimitadores de subcampo e o formato de extra&ccedil;&atilde;o, este &uacute;ltimo &eacute; aplicado no processo (n&atilde;o implementado).</font></td>

                    </tr>

                </tbody>

            </table>

            </p>

            </font></td>

        </tr>

    </tbody>

</table>

</center>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>