<html>

    <head>

        <title></title>

    </head>

    <body>

        <p><font face="Arial" size="2"></font></p>

        <p></p>

        <p><font face="Arial" size="2"><a target="_blank" href="http://bvsmodelo.bvsalud.org/download/cisis/CISIS-LinguagemFormato4-es.pdf"></a></font></p>

        <p><font face="Arial" size="2"></font></p>

        <font face="Arial" size="2">Este procedimento permite criar um formato de sa&iacute;da - ou utilizar um previamente criado - para enviar informa&ccedil;&atilde;o diretamente a um processador de texto.</font>

        <p></p>

        <p><font face="Arial" size="2">Os registros podem ser selecionados de duas formas: </font></p>

        <ol>

            <li><font face="Arial" size="2">Através de uma faixa de registros (de - at&eacute;)</font></li>

            <li><font face="Arial" size="2">Atrav&eacute;s de uma consulta &agrave;  base de dados. Para isso clique no &iacute;cone de busca e construa a express&atilde;o de busca correspondente</font></li>

        </ol>

        <p><font face="Arial" size="2">Uma vez selecionados os registros, deve selecionar um formato existente ou criar um novo formato.</font></p>

        <p><font face="Arial" size="2">Para <strong>selecionar um formato existente</strong>, revise a lista que &eacute; exibida em <font color="#ff0000">Selecione um formato j&aacute; definido:</font> e clique no formato que deseja utilizar. Em seguida, clique no &iacute;cone <img alt="" src="../../php/img/b_editar.gif" />, que exibir&aacute; uma janela com o formato selecionado. Se conhece as regrlas para elabora&ccedil;&atilde;o de formatos do <strong>Cds/isis</strong>, pode editar o formato para realizar mudan&ccedil;as ou ajustes; de outra forma, n&atilde;o modifique a sa&iacute;da j&aacute; que se gerar erros n&atilde;o obterá nenhum resultado ao ordenar a impress&atilde;o da listagem.</font></p>

        <p><font face="Arial" size="2">Clique em  <strong>enviar</strong> para mandar o formato para a tela de cria&ccedil;&atilde;o da sa&iacute;da. <font face="Arial" size="2">Pode testar o formato selecionando os registros tanto por faixa de Mfns ou realizando uma busca na base de dados. Uma vez realizada a sele&ccedil;&atilde;o, clique em&nbsp;<strong><em>Enviar ao Word</em></strong> (para enviar a listagem a um processador de textos)&nbsp; ou em&nbsp;<strong><em>Vista previa</em></strong> para ver o resultado do formato através de sua exibi&ccedil;&atilde;o na tela.</font></font>
        <p><font face="Arial" size="2">Para <strong>criar um novo formato</strong>, selecione da lista de campos aqueles que deseja incluir na sa&iacute;da. Para selecionar os campos, d&ecirc; um clique duplo sobre o nome ou arraste-os com o  "mouse" e clique nas setas correspondentes. Pode utilizar as teclas <strong><em>[Ctrl]</em></strong> e <strong><em>[Shift]</em></strong> para selecionar os campos. As setas simples transferem os campos selecionados de uma janela a outra e as setas duplas transferem todos os campos.</font></p>

        <p><font face="Arial" size="2">Pode utilizar os bot&otilde;es <strong>Subir </strong>ou <strong>Descer</strong>  para mudar a posi&ccedil;&atilde;o dos campos selecionados.</font></p>

        <p><font face="Arial" size="2">Ao terminar a sele&ccedil;&atilde;o, clique em <strong>Criar formato</strong> e aparecerá na janela o formato criado. Se conhece a linguagem de formata&ccedil;&atilde;o do <strong>Cds/isis</strong>, pode editar o formato para realizar mudan&ccedil;as ou ajustes; de outra forma, n&atilde;o modifique a sa&iacute;da j&aacute; que se gerar erros, n&atilde;o obter&aacute; nenhum resultado quando ordenar a impress&atilde;o da listagem.</font></p>

        <p><font face="Arial" size="2">Pode testar o formato selecionando os registros por faixa de Mfns ou atrav&eacute;s de uma consulta &agrave; base de dados. Uma vez realizada a sele&ccedil;&atilde;o, clique em&nbsp;<strong><em>Enviar ao Word</em></strong> (para enviar a amostra obtida a um processador de textos)&nbsp; ou sobre&nbsp;<strong><em>Vista previa</em></strong> para ver o resultado do formato através de sua exibi&ccedil;&atilde;o na tela.</font></p>

        <p><font face="Arial"><font size="2">Para salvar o formato criado, d&ecirc; um nome (utilizando letras e números unicamente e sem espa&ccedil;os em branco) e elabore a descri&ccedil;&atilde;o com a qual se apresentará este formato na lista de <font color="#ff0000">formatos j&aacute; definidos.</font></font></font></p>

        <p><font face="Arial" size="2">Para mais informa&ccedil;&otilde;es acerca da linguagem de formata&ccedil;&atilde;o consulte:</font></p>

        <p><font face="Arial" size="2"><a target="_blank" href="http://bvsmodelo.bvsalud.org/download/cisis/CISIS-LinguagemFormato4-en.pdf">Manual da linguagem de formatação do CDS/Isis (Inglês)</a></font></p>

        <p><font face="Arial" size="2"><a target="_blank" href="http://bvsmodelo.bvsalud.org/download/cisis/CISIS-LinguagemFormato4-es.pdf">Manual da linguagem de formatação do CDS/Isis (Espanhol)</a></font></p>

</body>

</html>