<p><font size="2"><strong>Configura&ccedil;&atilde;o de estatísticas - Lista de vari&aacute;veis</strong></font></p>

<p><font size="2">Esta op&ccedil;&atilde;o permite definir as vari&aacute;veis de uma base de dados que podem ser utilizadas para a emiss&atilde;o de estatísticas.</font></p>

<p><font size="2">S&atilde;o necess&aacute;rias tr&ecirc;s colunas de informa&ccedil;&otilde;es:</font></p>

<p>

<table cellspacing="1" cellpadding="1" width="95%" summary="" border="1">

    <tbody>

        <tr>

            <td><font size="2">Campo</font></td>

            <td><font size="2">Define o título do campo, tal qual como  se reportar&aacute; nas linhas ou colunas da tabela de frequ&ecirc;ncia ou de conting&ecirc;ncia</font></td>

        </tr>

        <tr>

<td><font size="2">Formato de <br />

            Extra&ccedil;&atilde;o</font></td>

            <td><font size="2">O</font><font size="2"> pft a aplicar para extrair o conte&uacute;do do campo da base de dados, a fim de refletir na tabela de frequ&ecirc;ncia ou de conting&ecirc;ncia. O valor produzido pelo PFT ser&aacute; utilizado como cabe&ccedil;alho da linha ou coluna correspondente e será acumulado para efeitos de totaliza&ccedil;&atilde;o</font></td>

        </tr>

        <tr>

            <td><font size="2">&nbsp;Prefixo</font></td>

            <td><font size="2">&nbsp;(Por implementar) Permite extrair as vari&aacute;veis diretamente do arquivo invertido, reduzindo portanto o tempo de leitura dos dados</font></td>

        </tr>

        <tr>

            <td><font size="2">&nbsp;</font></td>

            <td><font size="2">&nbsp;</font></td>

        </tr>

    </tbody>

</table>

</p>

<p><font size="2">Este arquivo &eacute; chamado de <strong>stats.cfg</strong> e &eacute; armazenado na pasta <strong>def </strong>da base de dados correspondente.</font></p>

<p>As vari&aacute;veis aqui definidas podem ser utilizadas em dois tipos de processos:</p>

<ul>

    <li>Para emitir tabelas de conting&ecirc;ncia e tabelas de frequ&ecirc;ncia, selecionando as vari&aacute;veis que estar&atilde;o nas linhas e as vari&aacute;veis que estar&atilde;o nas colunas</li>

    <li>Para a prepara&ccedil;&atilde;o de tabelas predefinidas onde s&atilde;o emitidos resultados selecionando o nome do quadro correspondente</li>

</ul>