<html>

    <head>

        <title></title>

    </head>

    <body>

        <p><font face="Arial"><strong>Tipos de Registro (Formato Marc)</strong></font></p>

        <p><font face="Arial" size="2">Esta op&ccedil;&atilde;o ajuda a definir os tipos de registro que ser&atilde;o manipulados pela base de dados quando esta utiliza o formato MARC.</font></p>

        <p><font face="Arial" size="2">O tipo de registro &eacute; obtido do campo <strong>3006 </strong>do Leader e ajuda a identificar o formato do campo fixo (008) a ser utilizado na descri&ccedil;&atilde;o bibliográfica do título.</font></p>

        <p><font face="Arial" size="2">Para definir os tipos de registro s&atilde;o necess&aacute;rios 2 componentes:</font></p>

        <ol>

            <li><font face="Arial" size="2">Identificar o campo (tag)&nbsp;da base de dasos do qual ser&aacute; obtido  (ou a armazenar no caso de um novo registro) o tipo de registro correspondente ao título. A vers&atilde;o atual do ABCD permite definir at&eacute; os campos de cujo valor dependerá o &nbsp;formato do campo fixo (008) a exibir na planilha de entrada</font></li>

            <li><font face="Arial" size="2">Descrever os tipos de registro levando em conta os seiguintes par&ecirc;metros:</font>
              
              <ul>
                  
                  <li><font face="Arial" size="2">Nome da tabela de defini&ccedil;&atilde;o (FDT) que cont&eacute;m os elementos a serem utilizados para construir o formul&aacute;rio de entrada que servirá de entrada ao campo fixo relacionado com o tipo de registro</font></li>
  
                <li><font face="Arial" size="2">Valor que tem os campos identificados em (1) para que sejan considerados pertencentes a esse tipo de registro</font></li>
  
                <li><font face="Arial" size="2">Descri&ccedil;&atilde;o do tipo de registro, o qual se exibir&aacute; ao operador no momento da entrada de dados para que proceda a sele&ccedil;&atilde;o do tipo correspondente</font></li>
              </ul>
            </li>
        </ol>

        <p><font face="Arial" size="2">A fim de manter a consist&ecirc;ncia na parametriza&ccedil;&atilde;o do ABCD, os campos fixos s&atilde;o definidos através de uma <strong>FDT</strong> que contenha a descri&ccedil;&atilde;o dos elementos de dados associados ao tipo de registro e com todas as características definidas no procedimento de cria&ccedil;&atilde;o da FDT da base de dados. Para editar a <strong>FDT </strong>associada ao campo fixo de um tipo de registro, clique no link <strong>editar</strong>. Como resultado, ser&aacute; aberta uma nova janela com as características dos elementos de dados que comp&otilde;em o campo fixo. </font></p>

    </body>

</html>