<html>
<head>
<title>Definici&oacute;n del campo 53</title>
<style type="text/css">
<!--
p.MsoNormal {
margin:0cm;
margin-bottom:.0001pt;
text-autospace:none;
font-size:10.0pt;
font-family:Arial;
}
-->
</style>
</head>

<body>
<font face="Arial" size="2"></font>
<table border="1" cellpadding="3" cellspacing="0" style="border-collapse: collapse" bordercolor="#111111" width="75%">
  <tr>
    <td width="26%" valign="top"><p><font size="2" face="Arial"><b> Etiqueta</b></font></td>
    <td width="74%">53</td>
  </tr>
  <tr>
    <td width="26%" valign="top" ><p><font size="2" face="Arial"><b> Nombre </b></font></td>
    <td width="74%"><p>Conferencia : Nombre </td>
  </tr>
  <tr>
    <td width="26%" valign="top"><p><font size="2" face="Arial"><b> Definición del dato</b></font></td>
    <td width="74%">Nombre,&nbsp; n&uacute;mero,&nbsp;  ciudad&nbsp; y&nbsp; fecha&nbsp;  de&nbsp; una&nbsp; conferencia,&nbsp;  reuni&oacute;n, congreso, simposio, curso, etc.</td>
  </tr>
  <tr>
    <td width="26%" valign="top"><p> <font size="2" face="Arial"><b> Propósito del campo</b></font></td>
    <td width="74%">Este campo se  utiliza para identificar la conferencia que ha sido tratada a nivel anal&iacute;tico, monogr&aacute;fico o colecci&oacute;n. </td>
  </tr>
  <tr>
    <td width="26%" valign="top"><p> <font size="2" face="Arial"><b> Descripción de los elementos</b></font></td>
    <td width="74%">Ocurrencias m&uacute;ltiples. Los elementos de este campo son:&nbsp;nombre, n&uacute;mero, ciudad y fecha, registrados en este orden, separados por coma y sin puntuaci&oacute;n final. <br>
      <strong>Nombre de la conferencia</strong>: El nombre de la conferencia se obtiene del documento y debe registrarse consignando con may&uacute;scula la primera letra de las palabras significativas.<br>
      <strong>N&uacute;mero de la conferencia</strong>: El n&uacute;mero de una conferencia, si lo hay, debe registrarse a continuaci&oacute;n del nombre, despu&eacute;s de coma y siempre en n&uacute;meros ar&aacute;bigos, omitiendo la expresi&oacute;n n&uacute;mero. <br>
      <strong>Ciudad</strong>: El nombre de la ciudad debe consignarse completo, en el idioma en que se registr&oacute; la conferencia. <br>
      <strong>Fecha</strong>: La fecha de una conferencia se registra omitiendo las<br>
    preposiciones y sin abreviaturas. El orden de los elementos debe ser: d&iacute;a, mes, a&ntilde;o. Las fechas inclusivas deben consignarse separadas por un gui&oacute;n. La informaci&oacute;n que se registra en este campo puede corresponder a la publicaci&oacute;n oficial que contiene todos los trabajos presentados a una conferencia (actas o &quot;proceedings&quot;) o a trabajos presentados individualmente a una reuni&oacute;n y publicados como una monograf&iacute;a, un cap&iacute;tulo de un libro o un art&iacute;culo en una publicaci&oacute;n seriada. Al registrar informaci&oacute;n sobre m&aacute;s de una conferencia, cada p&aacute;rrafo debe ingresar separado por el elemento que indica las ocurrencias m&uacute;ltiples.</td>
  </tr>
  <tr>
    <td width="26%" valign="top"><p><font size="2" face="Arial"><b> Ejemplo </b></font></td>
    <td width="74%">Conferencia Ministerial Regional  Preparatoria de Am&eacute;rica Latina y el Caribe para la Cumbre sobre la Sociedad de  la Informaci&oacute;n, B&aacute;varo, 29-31 enero 2003<br>      
      Taller  Regional Latinoamericano y Caribe&ntilde;o sobre Ciencia y Tecnolog&iacute;a para el  Desarrollo Sostenible, Santiago, 5-8 marzo 2002<br>      Seminario Latinoamericano de  Cuentas Nacionales: Avance de la Aplicaci&oacute;n del Sistema de Cuentas Nacionales  SCN 1993 en Am&eacute;rica Latina y el Caribe, Santo Domingo, 26-29 noviembre 2002 </td>
  </tr>
</table>
<font face="Arial" size="2">
<p>Tomado de: <i>Sistema de Información Bibliográfica de la CEPAL: manual de referencia.</br>
CEPAL: Santiago de Chile, 2003. (Serie manuales; 26).</i></p>
</font>
</body>

</html>
