<html>

    <head>

        <title></title>

    </head>

    <body>

        <p><font face="Arial"><strong>Tipos de materiais</strong></font></p>

        <p><font face="Arial" size="2">Esta tabela descreve as políticas que ser&atilde;o aplicadas para os diferentes tipos de materiais existentes na base de dados. O tipo de material referenciado na tabela deve ser gerado pelo  formato de extra&ccedil;&atilde;o  que &eacute; aplicado à base de dados com os materiais para empr&eacute;stimo. Este resultado, entre outros dados, deve conter o tipo de material a ser localizado na tabela para que sejam atribuídas  as respectivas políticas.</font></p>

        <p><font face="Arial" size="2">Se o formato de  extra&ccedil;&atilde;o n&atilde;o gerar nenhuma saída, o operador poder&aacute; decidir que tipo de empr&eacute;stimo  a ser aplicado, selecionando uma das op&ccedil;&otilde;es da tabela <strong>Tipos de Empr&eacute;stimo.</strong></font></p>

        <p><font face="Arial" size="2">Quando se grava o registro de empr&eacute;stimo, &eacute;  salvo o tipo de material ou de tipo de empr&eacute;stimo que foi atribuído para efeitos de aplicar corretamente as políticas de devolu&ccedil;&atilde;o/multa/suspens&atilde;o</font></p>

        <p><font face="Arial" size="2"><strong>Descri&ccedil;&atilde;o da tabela</strong></font></p>

        <p>

        <table cellspacing="1" cellpadding="1" width="80%" summary="" border="1">

            <tbody>

                <tr>

                    <td bgcolor="#99ccff"><font face="Arial" size="2"><strong>Campo</strong></font></td>

                    <td bgcolor="#99ccff"><font face="Arial"><font size="2"><strong>Utiliza&ccedil;&atilde;o na aplica&ccedil;&atilde;o das políticas</strong> </font></font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Tipo de material</font></td>

                    <td><font face="Arial" size="2">Valor retornado pelo formato de extra&ccedil;&atilde;o aplicado à bases de dados bibliogr&aacute;ficos. </font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Descri&ccedil;&atilde;o</font></td>

                    <td><font face="Arial" size="2">Denomina&ccedil;&atilde;o do tipo de material</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Tipo de usu&aacute;rio</font></td>

                    <td><font face="Arial" size="2">Escolha o tipo de usu&aacute;rio para quem a política do tipo de material se aplica. Se n&atilde;o selecionar nenhum usu&aacute;rio, a política se aplicar&aacute; a todos os usu&aacute;rios.</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Prazo de empr&eacute;stimo</font></td>

                    <td><font face="Arial" size="2">Número de dias/horas para o c&aacute;lculo da data de devolu&ccedil;&atilde;o.</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Unidade</font></td>

                    <td><font face="Arial" size="2">Unidade de medida do prazo empr&eacute;stimo (dias/horas)</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">No. de renova&ccedil;&otilde;es</font></td>

                    <td><font face="Arial" size="2">Número de renova&ccedil;&otilde;es permitidas</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Multa por dia de atraso</font></td>

                    <td><font face="Arial" size="2">Total de multa cobrado por cada dia/hora de atraso na devolu&ccedil;&atilde;o do empr&eacute;stimo.&nbsp;</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Dias de suspens&atilde;o por dia de atraso</font></td>

                    <td><font face="Arial" size="2">Indica quantos dias o usu&aacute;rio deve ser suspenso por cada dia/hora de atraso na devolu&ccedil;&atilde;o.</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Em reserva. Multa por dia de atraso</font></td>

                    <td><font face="Arial" size="2">Se o material est&aacute; reservado, especifica a multa que deve ser aplicada por cada dia de atraso na devolu&ccedil;&atilde;o.</font></td>

                </tr>

                <tr>

                    <td><font face="Arial" size="2">Em reserva.&nbsp;Suspens&atilde;o por dia de atraso</font></td>

                    <td><font face="Arial" size="2">Se o material est&aacute; reservado, especifica os dias de suspens&atilde;o que devem ser aplicados para cada dia de atraso na devolu&ccedil;&atilde;o.</font></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

                <tr>

                    <td></td>

                    <td></td>

                </tr>

            </tbody>

        </table>

        </p>

    </body>

</html>