Nesta tabela representa a pol&iacute;tica de empr&eacute;stimo a ser aplicada, em fun&ccedil;&atilde;o do tipo de usu&aacute;rio e do tipo de material solicitado.<br />
<br />
Para modificar uma política j&aacute; estabelecida, clique no link correspondente e insira a informa&ccedil;&atilde;o solicitada. Quando terminar, clique em  <strong>Aceitar.<br />
<br />
</strong>Para adicionar uma nova  política clique em  <strong>Adicionar</strong> e forne&ccedil;a os dados solicitados. Ao finalizar clique em <strong>Aceitar</strong>.<br />
<br />
Para eliminar uma politica clique no &iacute;cone de dele&ccedil;&atilde;o que se encontra localizado no in&iacute;cio da linha que descreve a pol&iacute;tica.<br />
<br />
Para informar as políticas deve indicar, para cada combina&ccedil;&atilde;o de tipo de material e tipo de usu&aacute;rio, os siguintes valores
<p>
<table width="90%" cellspacing="1" cellpadding="1" border="1" align="" summary="">
    <tbody>
        <tr>
            <td>Tipo de item<br />
            </td>
            <td>&nbsp;Busca da tabela circulation/def/lang/items.tab<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Tipo de usu&aacute;rio<br />
            </td>
            <td>&nbsp;Busca da tabela circulation/def/lang/users.tab<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Quantidade de itens permitidos<br />
            </td>
            <td>&nbsp;Quantos objetos diferentes podem ser emprestados a um usu&aacute;rio<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Prazo de empréstimo<br />
            </td>
            <td>&nbsp;Quantos dias, meses, horas, etc. pode um usu&aacute;rio permanecer com um objeto emprestado<br />
            </td>
        </tr>
        <tr>
            <td>Prazo de  reserva<br />
            </td>
            <td>&nbsp;Quantos dias, meses, horas, etc. pode um usuario manter um objeto emprestado se o mesmo está reservado<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Unidade de medida dos prazos<br />
            </td>
            <td>&nbsp;Indica se o prazo mencionado se refere a dias, meses, horas, etc.<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Número de renova&ccedil;&otilde;es permitidas<br />
            </td>
            <td>&nbsp;Quantas vezes se pode renovar o objeto antes de vencer<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Unidades de multa por dia de atraso (empréstimo normal)<br />
            </td>
            <td>&nbsp;Quantas unidades de multa ser&atilde;o cobradas ao usu&aacute;rio por cada dia de atraso<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Unidade de multa por dia de atraso se o item tem reservas<br />
            </td>
            <td>&nbsp;Quantas unidades de multa ser&atilde;o cobradas ao usu&aacute;rio por cada dia de atraso se o objeto está reservado<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Dias de suspens&atilde;o por dia de atraso (empréstimo normal)<br />
            </td>
            <td>&nbsp;Quantos dias se suspende o usuario por cada dia de atraso na devolu&ccedil;&atilde;o de um objeto<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Dias de suspens&atilde;o por dia de atraso se o item tem reservas<br />
            </td>
            <td>&nbsp;Quantos dias se suspende o usu&aacute;rio por cada dia de atraso na devolu&ccedil;&atilde;o de um objeto reservado<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Dias de espera em reserva<br />
            </td>
            <td>&nbsp;Por quantos dias pode permanecer um objeto reservado<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Permitir empréstimo se o usuario está em mora<br />
            </td>
            <td>&nbsp;Continuar emprestando mesmo que o usu&aacute;rio tenha um objeto atrasado<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Permitir renova&ccedil;&atilde;o se o usu&aacute;rio está em mora<br />
            </td>
            <td>&nbsp;Permitir a renova&ccedil;&atilde;o de um objeto mesmo que esteja em atraso<br />
          </td>
        </tr>
        <tr>
            <td>&nbsp;Permitir emprestar múltiplas c&oacute;pias de um mesmo objeto<br />
            </td>
            <td>&nbsp;Permitir emprestar v&aacute;rios exemplares de um mesmo objeto (Nota: o volume e tomo cria exemplares diferentes)<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Data limite para o usu&aacute;rio<br />
            </td>
            <td>&nbsp;Data at&eacute; a qual &eacute; permitido emprestar ao usu&aacute;rio<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;Data limite para o objeto<br />
          </td>
            <td>&nbsp;Data at&eacute; a qual &eacute; permitido emprestar o objeto<br />
            </td>
        </tr>
        <tr>
            <td>&nbsp;</td>
            <td>&nbsp;</td>
        </tr>
    </tbody>
</table>
</p>