<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 3.0  (Win32)">
	<META NAME="CREATED" CONTENT="0;0">
	<META NAME="CHANGEDBY" CONTENT="Liliana Melgar">
	<META NAME="CHANGED" CONTENT="20090203;8195000">
	<META NAME="Informaci&oacute;n 1" CONTENT="">
	<META NAME="Informaci&oacute;n 2" CONTENT="">
	<META NAME="Informaci&oacute;n 3" CONTENT="">
	<META NAME="Informaci&oacute;n 4" CONTENT="">
	<META NAME="CHANGEDBY" CONTENT="Liliana Melgar">
	<META NAME="CHANGEDBY" CONTENT="Liliana Melgar">
</HEAD>
<BODY LANG="en-US" DIR="LTR">
<P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Options pour la gestion de base de donn&eacute;es</FONT></FONT></STRONG></P>
<OL>
	<LI>
	  <P STYLE="margin-bottom: 0in"><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>D&eacute;verrouiller la base </FONT></FONT></STRONG> 
	</P>
	<LI>
	  <P STYLE="margin-bottom: 0in"><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Liste des enregistrements verrouill&eacute;s </FONT></FONT></STRONG>	</P>
	<LI>
	  <P STYLE="margin-bottom: 0in"><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>D&eacute;verrouiller des enregistrements </FONT></FONT></STRONG> 
	</P>
	<LI>
	  <P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Changements globaux </FONT></FONT></STRONG> 
	</P>
</OL>
<P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>D&eacute;verrouiller la base.</FONT></FONT></STRONG></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Si la base ou le fichier invers&eacute; ne peut pas &ecirc;tre mis &agrave; jour, il se peut que la base soit verrouill&eacute;. Ceci survient, en g&eacute;n&eacute;ral, apr&egrave;s la panne du syst&egrave;me ou l'annulation de la cr&eacute;ation de la liste invers&eacute;e,  un arr&ecirc;t par l'utilisateur </FONT><font face="Arial, sans-serif"><font size=2> ou un arr&ecirc;t inattendu, </font></font><FONT SIZE=2>ou par suite d'une erreur dans la TSC (Table de S&eacute;lection des Champs). </FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Utiliser cette option pour d&eacute;verrouiller la base, ainsi le fichier ma&icirc;tre et/ou le fichier invers&eacute; seront pr&ecirc;ts &agrave; &ecirc;tre mis &agrave; jour. Relancer la g&eacute;n&eacute;ration du fichier invers&eacute; si vous n'arrivez pas &agrave; acc&eacute;der &agrave; l'index des termes, ou s'ils sont incomplets ou encore se pr&eacute;sentent en d&eacute;sordre. Si la TSC a &eacute;t&eacute; modifi&eacute;e, rev&eacute;rifier sa syntaxe.</FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Avant de d&eacute;verrouiller la base, assurez-vous qu'il n'y a aucun autre utilisateur qui y fait un ajout ou une modification d'enregistrements.</FONT></FONT></P>
<P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Liste des enregistrements verrouill&eacute;s </FONT></FONT></STRONG></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Il est recommand&eacute; de lancer cette proc&eacute;dure comme partie de la gestion quotidienne de la base. Si vous avez une liste des enregistrements verrouill&eacute;s, d&eacute;verrouillez-les comme il est indiqu&eacute; dans la proc&eacute;dure &quot;D&eacute;verrouiller les enregistrements&quot;.</FONT></FONT></P>
<P STYLE="margin-bottom: 0in"><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>D&eacute;verrouiller des enregistrements </FONT></FONT></STRONG></P>
<P STYLE="margin-bottom: 0in"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Comme m&eacute;canisme de protection de la mise &agrave; jour des donn&eacute;es, les enregistrements sont g&eacute;n&eacute;ralement verrouill&eacute;s pendant la saisie de donn&eacute;es. C'est-&agrave;-dire: s'il y a un utilisateur qui modifie un enregistrement, l'enregistrement est verrouill&eacute; pour &eacute;viter un acc&egrave;s simultan&eacute; par un autre utilisateur. Quand la mise &agrave; jour est termin&eacute;e, l'enregistrement est alors lib&eacute;r&eacute;, d&eacute;verrouill&eacute; et devient disponible pour d'autres utilisateurs. </FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Si le cycle de mise &agrave; jour n'est pas achev &eacute;, c'est-&agrave;-dire si l'enregistrement n'a pas accept&eacute; de donn&eacute;e ou si la mise &agrave; jour a &eacute;t&eacute; arr&ecirc;t&eacute;e (boutons Sauvegarder ou Annuler dans la barre d'outils), l'enregistrement reste verrouill&eacute; pendant un certain temps (4 heures) pour les autres utilisateurs. </FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>L'enregistrement peut &ecirc;tre d&eacute;verrouill&eacute; avant ce d&eacute;lai, de deux fa&ccedil;ons: </FONT></FONT></P>
<OL>
	<LI>
	  <P STYLE="margin-bottom: 0in"><FONT FACE="Arial, sans-serif"><FONT SIZE=2>L'utilisateur qui a verrouill&eacute; l'enregistrement peut le lib&eacute;rer (ou d&eacute;verrouiller) en faisant la mise &agrave; jour, l'&eacute;dition ou l'annulation de cette &eacute;dition.</FONT></FONT></P>
	<LI><FONT FACE="Arial, sans-serif"><FONT SIZE=2>En utilisant la prod&eacute;cure de d&eacute;verrouillage des enregistrements, qui consiste &agrave; visualiser la base et &agrave; d&eacute;verrouiller tous les enregistrements verrouill&eacute;s.</FONT></FONT>
</OL>
<FONT FACE="Arial, sans-serif"><FONT SIZE=2>Avant de lancer cette proc&eacute;dure, il est recommand&eacute; de v&eacute;rifier qu'il n'y a pas de saisie de donn&eacute;e ou une mise &agrave; jour d'enregistrement en cours.</FONT></FONT>
<P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Cr&eacute;er le fichier invers&eacute;</FONT></FONT></STRONG></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Cette proc&eacute;dure cr&eacute;e le fichier invers&eacute;, mais elle peut &ecirc;tre utilis&eacute;e seulement pour une base ayant moins de 2.000 enregistrements. Pour un fichier plus volumineux, il vaut </FONT><FONT FACE="Arial, sans-serif"><FONT SIZE=2>mieux </FONT></FONT><FONT SIZE=2>utiliser l'utilitaire MX. </FONT></FONT></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Le fichier invers&eacute; (dictionnaire) est mis &agrave; jour automatiquement que des enregistrements sont ajout&eacute;s, modifi&eacute;s ou supprim&eacute;s. Pourtant, si vous remarquez une erreur en acc&eacute;dant aux index, il vaut </FONT><FONT FACE="Arial, sans-serif"><FONT SIZE=2>mieux </FONT></FONT><FONT SIZE=2>recr&eacute;er le fichier index&eacute; pour corriger ces anomalies ou cette alt&eacute;ration. </FONT></FONT></P>
<P><STRONG><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Changements globaux </FONT></FONT></STRONG></P>
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=2>Voir l'instruction dans le menu correspondant. </FONT></FONT></P>
</BODY>
</HTML>