<p><strong><font size="2"><font face="Arial"><font size="3">Capture de termes normalis&eacute; &agrave; travers d&acute;un tableau</font><br />
</font></font></strong><font size="2"><font face="Arial"><br />
Cette option d'ABCD permet  cr&eacute;er des tableaux de valeurs qu'ils seront pr&eacute;sent&eacute;s au moment de l'entr&eacute;e du champ correspondant. La forme comme s&acute;expose le tableau d&eacute;pendra du Type d'entr&eacute;e assign&eacute; au champ dans la FDT (checkbox, option, select single, select multiple). Les tableaux de valeurs se trouvent dans le classeur <font size="2"><strong>def</strong></font> de la base de donn&eacute;es s&eacute;lectionn&eacute;e.<br />
<br />
Pour <strong>cr&eacute;er</strong> un nouveau tableau, placez le nom dans l&acute;etiquette <strong>Nom</strong>, avec l'extension <strong>.tab </strong>et cliquez sur <strong>&eacute;diter/cr&eacute;er.</strong><br />
Pour <strong>visualiser</strong> un tableau existant, cliquez sur l'image <img alt="" src="../../php/dataentry/img/preview.gif" /> ou sur le nom du tableau correspondant.<br />
<br />
Pour <strong>&eacute;diter</strong> <font size="2">un tableau existant, cliquez sur</font> le nom m&ecirc;me puis cliquez sur <strong>&eacute;diter/cr&eacute;er.<br />
<br />
</strong>Pour <strong>assigner </strong>&agrave; un champ un tableau existant, cliquez sur le nom m&ecirc;me puis cliquez sur <strong>metre &agrave; jour la  FDT</strong>.<br />
<br />
Pour <strong>&eacute;liminer</strong><font size="2"> un tableau existant, cliquez sur le nom m&ecirc;me puis cliquez sur</font><strong> &eacute;liminer</strong>. Le tableau sera &eacute;limin&eacute; du classeur, mais il restera associ&eacute; au champ respectif dans la FDT. Rappelez-vous alors, &eacute;liminer l'entr&eacute;e dans la FDT.<br />
<br />
La liste de tableaux disponibles pr&eacute;sente tous les dossiers avec l'extension <strong>.tab</strong>, ils sont localis&eacute; dans le classeur def de la base de donn&eacute;es s&eacute;lectionn&eacute;e.<br />
<br />
<strong>Cr&eacute;ation/&Eacute;dition de tableaux<br />
<br />
</strong>Une fois que le nom du dossier a &eacute;t&eacute; plac&eacute; dans le space <strong>Nom</strong>, cliquez sur <strong>cr&eacute;er/&eacute;diter</strong>. La s&eacute;lection appara&icirc;tra dans un tableau avec deux colonnes:  <strong>Code| Terme</strong><br />
<br />
Si est rempli seulement la </font><font size="2"><font face="Arial">colonne</font></font> <font face="Arial"><font size="2"><strong>terme</strong></font>, dans la proc&eacute;dure d'entr&eacute;e ils appara&icirc;tront les valeurs plac&eacute;es dans cette colonne, lequel seront transf&eacute;r&eacute; au champ correspondant en utilisant la m&eacute;thode de la s&eacute;lection appropri&eacute;e au type d'entr&eacute;e du champ d&eacute;fini dans FDT.<br />
<br />
Si vous voulez transf&eacute;rer le code et le terme associ&eacute;, alors la structure du champ qui recevra la valeur du tableau devrait contempler 2 sous-champs. Dans le premier sous-champ sera plac&eacute;e la valeur qui correspond au <font size="2"><strong>code</strong></font> et dans le deuxi&egrave;me sous-champ sera plac&eacute;e la valeur qui correspond au </font><font size="2"><font face="Arial"><font size="2"><strong>terme</strong></font></font></font><font face="Arial">. Dans la proc&eacute;dure d'entr&eacute;e ils appara&icirc;tront seulement les valeurs pr&eacute;sentes dans la colonne terme, mais le code sera entrepos&eacute; plus le terme en utilisant les sous-champs correspondantes.</font></font></p>
<p><font size="2"><font face="Arial">Quand l'&eacute;dition du tableau est finie, cliquez sur le bouton <strong>Metre &agrave;  jour</strong> pour entreposer  le tableau cr&eacute;&eacute;/modifi&eacute; et l'assigner au champ qui correspond de la FDT.</font></font></p>
<p><font size="2"><font face="Arial"><strong>Aide: </strong>Pour utiliser dans une base de donn&eacute;es A, un tableau d&eacute;j&agrave; d&eacute;fini pour une base de donn&eacute;es B, pr&eacute;c&eacute;dez le nom du Picklist avec le chemin absolu o&ugrave; le tableau que vous voulez utiliser est localis&eacute;.<br />
<br />
<br />
<br />
<br />
</font></font></p>
