<p><font face="Arial"><font size="2"><strong>Capture de termes &agrave; travers d&acute;un dossier d'autorit&eacute;s ou en utilisant la terminologie d&eacute;j&agrave; entr&eacute; dans la base de donn&eacute;es.</strong></font></font></p>
<p><font face="Arial"><font size="2">Au moyen de cet option les termes peuvent &ecirc;tre captur&eacute;s &agrave; partir d'une autre base de donn&eacute;es, par exemple, une base de donn&eacute;es d&acute;autorit&eacute;s, ou &agrave; partir de la  base de donn&eacute;es  m&ecirc;me, par exemple pour normaliser les auteurs, descripteurs, &eacute;ditoriaux, etc.<br />
</font></font></p>
<p><font face="Arial"><font size="2">L'acc&egrave;s aux termes de la base de donn&eacute;es associ&eacute; est fait &agrave; travers de la liste inverse.  Par cons&eacute;quent il faut d&eacute;finir des sous-dictionnaires &agrave; l'int&eacute;rieur du dictionnaire de termes</font></font><font face="Arial"><font size="2">, au moyen de pr&eacute;fixes aux champs index&eacute;s. <br />
</font></font></p>
<p><font face="Arial"><font size="2">&Agrave; travers le pr&eacute;fixe indiqu&eacute; dans la FDT vous accedez aux postings des clefs et vous obtenez les Mfn des registres. Le MFN du premier posting de la clef est utilis&eacute; pour acc&eacute;der au registre, sur lequel 2 formats sont appliqu&eacute;s:&nbsp; <br />
</font></font></p>
<ul>
    <li><strong><font size="2"><font face="Arial">format d&acute;exposition </font></font></strong></li>
    <li><font face="Arial"><font size="2"><strong>format d&acute;extraction</strong></font></font></li>
</ul>
<p><font size="2"><font face="Arial">Le <strong>format d´exposition</strong> est appliqué sur le registre obtenue à travers du posting,&nbsp;pour d&eacute;terminer la forme &agrave; exposer le champ dans la liste de la s&eacute;lection qui est montr&eacute;e &agrave; l'utilisateur, pendant que le <strong>format d&acute;extraction</strong> est utilis&eacute; pour extraire le champ et le transf&eacute;rer au registre. La liste est construite avec l'&eacute;l&eacute;ment &lt;select&gt; de la langue HTML et les options du menu de la s&eacute;lection sont remplis comme ci-dessous:<br />
&lt;option value="</font></font><font face="Arial"><font size="2"><strong>format d&acute;extraction</strong>"&gt;</font></font><strong><font size="2"><font face="Arial">format d&acute;exposition </font></font></strong><font size="2"><font face="Arial">&lt;/option&gt;</font></font></p>
<p><font size="2">Alors</font><font size="2">, quand l'utilisateur fait clic sur un terme, la cha&icirc;ne associ&eacute;e comme <strong>format d&acute;extraction</strong> est transf&eacute;r&eacute; au registre</font><br />
<font size="2"><font face="Arial"><br />
Les formats mentionn&eacute;s peuvent avoir toute la complexit&eacute; de la langue pour l'&eacute;laboration de formats de CDS/Isis. Pour les formats tr&egrave;s compliqu&eacute;s il est recommand&eacute; placer comme format de l'extraction un format (PFT) construit pr&eacute;c&eacute;demment, utilisant la forme @xxxxxx.pft pour incorporer le format o&ugrave; il est exig&eacute;. Dans ce cas le format d&acute;extraction et le format d&acute;exposition, </font><font size="2"><font face="Arial">s&eacute;par&eacute;s par $$$</font></font>, <font face="Arial">sont inclus dans le format @xxxxxx.pft. La phrase </font><font size="2"><font face="Arial"><strong>select</strong> </font></font><font face="Arial">devrait &ecirc;tre utilis&eacute;e du langue du format pour appliquer le format selon l&acute;ID du champ r&eacute;cuper&eacute; dans la liste inverse.<br />
<br />
Example:<br />
</font></font></p>
<p dir="ltr" style="MARGIN-RIGHT: 0px"><font face="Arial" size="2"><font face="Courier New">select e3<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; case 1:&nbsp;&nbsp; v1<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; case 100: v100^a,`$$$`v100^a<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 600: v600^a,`$$$`v600^a<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 700: v700^a,`$$$`v700^a</font></font><font face="Arial"><font face="Courier New"><br />
<font size="2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 110: v110^a,`$$$`v110<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; case 111: v111^a,`$$$`v111<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 245: v245^a,`$$$`f(mfn,1,0)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 260: v260^a," : "v260^b,</font></font></font><font face="Arial"><font face="Courier New" size="2">`$$$`v260</font></font><br />
<font face="Arial" size="2"><font face="Courier New">&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; case 270: v270<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; case 340: v340<br />
...<br />
<br />
...<br />
<br />
endsel</font></font></p>
<p><font face="Arial" size="2">La variable associ&eacute;e au case, identifie l&acute;ID assign&eacute; au champ dans la FST;alors le format est sp&eacute;cifi&eacute; &agrave; utiliser pour l&acute;exposition du champ dans la liste de la s&eacute;lection, ensuite, et pr&eacute;c&eacute;d&eacute; pour `$$$`, le format utilis&eacute; pour montrer le champ et le transf&eacute;rer &agrave; la feuille d'entr&eacute;e. Si le format d'extraction est omis, le format d&acute;exposition est utilis&eacute; comme format d'extraction.</font></p>
<p><font size="2">L&acute;ID du champ se obtient &agrave; travers du posting obtenu au moyen du pr&eacute;fixe. Pour cette raison, c'est possible de pr&eacute;senter une liste de s&eacute;lection qui contemple plusieurs champs, par exemple, tous les auteurs personnels du format Marc (100,600,700).</font></p>
<p><font size="2">Dans ce cas</font><font size="2">, tous les champs seront index&eacute;s avec le m&ecirc;me pr&eacute;fixe, mais l&acute;ID  devrait co&iuml;ncider avec l'&eacute;tiquette du champ afin qu'il extraie correctement de la base de donn&eacute;es, quand appliquer le correspondant format d'extraction.</font></p>
<p><font size="2">Par exemple, le format MARC pour montrer tous les auteurs, selon le format d&acute;extraction montr&eacute; pr&eacute;c&eacute;demment  (@xxxxx.pft)&nbsp;la FST pour l'indexation sp&eacute;cifiera:</font></p>
<p><font size="2">100 0 "AU_"v100^a/<br />
<font size="2">600 0 (| AU_| v600^a|%|/)<br />
<font size="2">700 0 (| AU_| v700^a|%|/)</font></font></font></p>
<p><font size="2">Faire l&acute;attention &agrave; l'usage du % dans le cas de champs r&eacute;p&eacute;tables pour produire le nombre de l'&eacute;v&eacute;nement, d&eacute;s que la pr&eacute;sentation des listes utilise le composant du posting, lequelle identifie le nombre de l&acute;&eacute;v&eacute;nement pour extraire le champ correctement.</font></p>
<p><font size="2"></font></p>
<br />
<p>&nbsp;</p>
<p>&nbsp;</p>