<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>Leader and Directory</TITLE>
</HEAD>
<BODY LINK="#0000ff">
<A name=top></A>
<hr><FONT FACE="Times New Roman" >
	<H2><b><em>Formato Bibliogr&aacute;fico MARC 21 LITE: Leader e Diret&oacute;rio</em></b></H2>
</FONT><hr>

<UL>
	<li type="disc"><a href="#mrcblea">LEADER (NR)</a> </LI>
	<LI type="disc"><a href="#mrcbdir">DIRET&Oacute;RIO (NR)</a></LI>
</UL>
<hr>
<h3><a name="#mrcblea"> <font face="Times New Roman, Times, serif">LEADER</font></a> <FONT FACE="Times New Roman">
</FONT>(NR)</h3>
<FONT size="3" FACE="Times New Roman">Um campo fixo que compreende as primeiras 24 posi&ccedil;&otilde;es (00-23) de cada registro&nbsp;
bibliogr&aacute;fico e consiste dos elementos de dados que cont&eacute;m n&uacute;meros ou valores de c&oacute;digos que definem os par&acirc;metros para processamento de um registro. </FONT>
<p align="justify">[Maiores informa&ccedil;&otilde;es em:&nbsp;<A href="http://www.loc.gov/marc/bibliographic/ecbdhome.html"><em>Formato MARC 21&nbsp;Conciso</em></a>]</p>
<hr />
<h3><font face="Times New Roman, Times, serif">Posi&ccedil;&otilde;es dos caracteres</font><FONT FACE="Times New Roman">
</FONT></h3>
<FONT FACE="Times New Roman"></FONT>
<UL>
	<LI type="disc"><font face="Times New Roman"><B>00-04 - Tamanho do registro</B><br>
	Esta informa&ccedil;&atilde;o &eacute; gerada por programa, tamanho de 5 caracteres, especifica
      o tamanho total do registro. O n&uacute;mero est&aacute; alinhado &agrave; direita
      e as posi&ccedil;&otilde;es n&atilde;o usadas &agrave; esquerda contem zeros.</font></LI>
	<LI><font face="Times New Roman"><B>05 - Estado (status) do registro</B><br>
	Um c&oacute;digo de caracter alfab&eacute;tico que indica a rela&ccedil;&atilde;o do registro com o arquivo</font></LI>
	<ul>
		<LI><font face="Times New Roman"><b>c</b> - corrigido ou revisado
		<br>
		Uma modifica&ccedil;&atilde;o a n&iacute;vel de codifica&ccedil;&atilde;o foi realizado no registro.</font></LI>
		<LI><font face="Times New Roman"><b>d</b> - registro apagado (delete).</font></LI>
		<LI><font face="Times New Roman"><b>n</b> - novo</font></LI>
	</UL>

	<LI><font face="Times New Roman"><B>06 - Tipo de registro</b><br>
      Um c&oacute;digo de caracter alfab&eacute;tico que define e indica as caracter&iacute;sticas dos componentes
      de um registro.	</font></LI>
	<UL>
		<LI><font face="Times New Roman"><b>a</b> - material textual (de idioma)
		<br>
		inclui  microformas e recursos eletr&ocirc;nicos que s&atilde;o basicamente de natureza textual </font>sejam reprodu&ccedil;&otilde;es de impress&atilde;o ou originalmente produzidos. </LI>
	  <LI><font face="Times New Roman"><b>c</b> - m&uacute;sica impressa<br>
          Inclui impressos, microformas e m&uacute;sica impressa ou eletr&ocirc;nica</font></LI>
		<LI><font face="Times New Roman"><b>d</b> - manuscritos de m&uacute;sica
		<BR>
		usado para  m&uacute;sica manuscrita ou em microforma de m&uacute;sica manuscrita. </font></LI>
		<LI><font face="Times New Roman"><b>e</b> - material cartogr&aacute;fico<BR>
          inclui mapas, atlas, globos, mapas digitais, e outros itens cartogr&aacute;ficos.</font></LI>
		<LI><font face="Times New Roman"><b>f</b> - manuscritos de material cartogr&aacute;fico<br>
          usado para manuscrito de material cartogr&aacute;fico ou uma microforma de manustrito de material cartogr&aacute;fico.</font></LI>
		<LI><font face="Times New Roman"><b>g</b> - material projet&aacute;vel<br>
          usado para imagens em movimento, grava&ccedil;&otilde;es de v&iacute;deo (incluindo v&iacute;deo digital), filmes, slides,  transpar&ecirc;ncias, ou material especificamente concebido para ser
          projetado.</font></LI>
	  <LI><font face="Times New Roman"><b>i</b> - registros sonoros n&atilde;o musicais<br>
			usado para uma grava&ccedil;&atilde;o sonora n&atilde;o musical (ex. discurso).</font></LI>
		<LI><font face="Times New Roman"><b>j</b> - registros musicais<br>
          usado para a grava&ccedil;&atilde;o de som musical (ex.: discos sonoros, compact discs, fitas cassetes).</font></LI>
		<LI><font face="Times New Roman"><b>k</b> - gr&aacute;ficos bidimensionais n&atilde;o projet&aacute;veis
		<br>
		usado para gr&aacute;ficos bidimensionais n&atilde;o projet&aacute;veis como: cart&otilde;es de visita, diagramas, colagens, gr&aacute;ficos de computador, fotografia digital, desenhos, matrizes para duplica&ccedil;&atilde;o, pinturas, gravuras, negativos e fotos
          impressos, figuras, cart&otilde;es postais, posters, desenhos t&eacute;cnicos,
          originais de transpar&ecirc;ncias, reprodu&ccedil;&otilde;es fotomecânicas e reprodu&ccedil;&otilde;es de qualquer destes citados. </font></LI>
		<LI><font face="Times New Roman"><b>m</b> - arquivos de computador
		<br>
		usado para as seguintes classes de recursos eletr&ocirc;nicos: software
          (incluindo programas, jogos, fontes tipogr&aacute;ficas), dados num&eacute;ricos,
          multim&iacute;dias em computador, sistemas ou servi&ccedil;os online. Para estas
          classes de materiais, se houver algum aspecto significativo que fa&ccedil;a
          o material cair em outra categoria do <I>Leader/06</I>, o c&oacute;digo para
          esse aspecto significativo deve ser usado em vez do c&oacute;digo <B>m</B> 
          (p.ex. dados vetoriais que s&atilde;o cartogr&aacute;ficos n&atilde;o se codifica como num&eacute;rico
          mas como cartogr&aacute;fico). Outras classes de recursos eletr&ocirc;nicos
          s&atilde;o codificados pelo seu aspecto mais significativo (p.ex. material de texto, gr&aacute;fico, material cartogr&aacute;fico,
          sonoro, m&uacute;sica, imagens em movimento). Em caso de d&uacute;vida, ou
          se o aspecto mais significativo n&atilde;o pode ser determinado, considere o
          item como um arquivo de computador</font>.</LI>
	<LI><font face="Times New Roman"><b>o</b> - kit 
	<br>
	usado para materiais que re&uacute;nem  v&aacute;rios componentes publicados como uma unidade, para fins de instru&ccedil;&atilde;o;  nenhuma das partes &eacute; identificada como predominante. Exemplo: materiais did&aacute;ticos que re&uacute;nem livro, caderno de atividades, guia, etc, ou pacotes de testes ou provas,  folha resposta, pontua&ccedil;&atilde;o de resultados, etc. </font></LI>
	<LI><font face="Times New Roman"><b>p</b> - material misto
	<br>
	usado quando h&aacute; materiais significativos em duas ou mais formas que est&atilde;o
      geralmente relacionadas em virtude de haverem sido acumulados por una
      pessoa ou
      entidade. Inclui fundos de arquivos e cole&ccedil;&otilde;es de manuscritos de
      materiais de formas mistas, tais como textos, fotografias, e registros sonoros.</font></LI>
	<LI><font face="Times New Roman"><b>r</b> - materiais tridimensionais, objetos naturais
	<br>
	utilizado para objetos feitos pelo homem, tais como: modelos, dioramas,
      jogos, quebra-cabe&ccedil;as, simula&ccedil;&otilde;es, esculturas e outras obras de arte
      tridimensionais e suas reprodu&ccedil;&otilde;es, exibi&ccedil;&otilde;es, m&aacute;quinas, roupas,&nbsp;brinquedos e
      bordado. Tamb&eacute;m inclui objetos naturais, tais como,  amostras de 
      microsc&oacute;pio (ou representa&ccedil;&otilde;es deles) e outros esp&eacute;cimes montados para exibi&ccedil;&atilde;o.</font></LI>
		<LI><font face="Times New Roman"><b>t</b> - textos manuscritos
		<br>
		utilizado tamb&eacute;m para microformas de manuscritos.</font></LI>
	</ul>
	<LI><font face="Times New Roman"><B>07 - Nivel bibliogr&aacute;fico</b>
	    <br>
     um c&oacute;digo de caracter alfab&eacute;tico que indica o n&iacute;vel bibliogr&aacute;fico de um registro.</font><br> 
<br>
<ul>
	    <li><font face="Times New Roman"><b>a</b> - parte de monografia</font>
	        <br>
	        <font face="Times New Roman"> unidade bibliogr&aacute;fica que est&aacute; fisicamente ligado ou &eacute;
            parte de outra unidade monogr&aacute;fica de tal forma que a recupera&ccedil;&atilde;o
	          do componente depende da  sua identifica&ccedil;&atilde;o e
	          localiza&ccedil;&atilde;o de um item de host ou recipiente. O registro contem campos que descrevem a
	          parte do componente e dados que identificam a obra no todo, campo 773 (Entrada de item (Host)). </font>      </li>
      </ul>
  </LI>
  <UL>
    <font face="Times New Roman"></font>
    <font face="Times New Roman"></font><LI><font face="Times New Roman"><b>c</b> - cole&ccedil;&atilde;o<br>
    &eacute; um grupo de &iacute;tems que n&atilde;o foram originalmente publicados,
        distribu&iacute;dos ou produzidos juntos. O registro descreve a unidade definida por
        uma proced&ecirc;ncia comum ou por conveni&ecirc;ncia administrativa para qual o registro
        &eacute; compreendido como o mais abrangente no sistema.
	</font></LI>
    <font face="Times New Roman"></font><LI><font face="Times New Roman"><b>m</b> - n&iacute;vel monogr&aacute;fico ou &iacute;tem<br>
    o item  &eacute; um documento  completo em uma &uacute;nica parte (monografia, mapa, manuscrito, etc) ou se prop&otilde;e
        a ser completado em um n&uacute;mero finito de partes separadas (ex. monografia
        com v&aacute;rios volumes, grava&ccedil;&otilde;es sonoras com m&uacute;ltiplas faixas, etc).	</font></LI>
    <font face="Times New Roman"></font><LI><font face="Times New Roman"><b>s</b> - serie<br>
    um item bibliografico  que &eacute; publicado em partes sucessivas com designa&ccedil;&atilde;o num&eacute;rica ou cronol&oacute;gica
        e que se prop&otilde;e continuar indefinidamente (ex. peri&oacute;dicos, jornais, anu&aacute;rios, relat&oacute;rios, trabalhos de sociedades, s&eacute;ries monogr&aacute;ficas numeradas, etc)	</font></LI>
  </UL>
  <LI><font face="Times New Roman"><B>08 - Tipo de controle</B></font></LI>
	<UL>
		<LI><font face="Times New Roman"><b># </b> - n&atilde;o especificado</font></LI>
	</UL>
	<LI><font face="Times New Roman"><B>09 – Esquema de codifica&ccedil;&atilde;o de caracteres</B></font><br>
	  <font face="Times New Roman"> Identifica o esquema de codifica&ccedil;&atilde;o de caracteres usado no registro </font>
	  <UL>
	    <LI><font face="Times New Roman"><b># </b> - MARC-8</font></LI>
	    <LI><font face="Times New Roman"><b>a</b> – UCS/Unicode</font></LI>
      </UL>
	</LI><LI><font face="Times New Roman"><b>10 - Contador de indicadores</b></font><br>
	  <font face="Times New Roman">o computador gera o n&uacute;mero 2, que indica o n&uacute;mero de  posi&ccedil;&otilde;es de caracteres usados para indicadores  em um campo de tamanho vari&aacute;vel. </font></LI>
    <font face="Times New Roman"></font><LI><font face="Times New Roman"><b>11 - Contador de c&oacute;digo de subcampos</b>
		<br>
		o computador gera o n&uacute;mero 2, que indica o n&uacute;mero de posi&ccedil;&otilde;es de caracteres usados para cada
      c&oacute;digo de subcampo em um campo de tamanho vari&aacute;vel.</font></li>
	<font face="Times New Roman"></font><LI><font face="Times New Roman"><b>12-16 - Endere&ccedil;o base dos dados</b>
		<br>
		o computador gera cinco caracteres num&eacute;ricos que indica a posi&ccedil;&atilde;o do primeiro caracter de um primeiro campo  vari&aacute;vel de controle em um registro. Este n&uacute;mero est&aacute; alinhado &agrave; direita
      e as  posi&ccedil;&otilde;es n&atilde;o utilizadas s&atilde;o completadas com  zeros &agrave; esquerda..</font></li>
	<font face="Times New Roman"><LI><b>17 - N&iacute;vel de codifica&ccedil;&atilde;o</b>
		<br>
		um c&oacute;digo de caracter alfanum&eacute;rico que indica o grau de descri&ccedil;&atilde;o da informa&ccedil;&atilde;o bibliogr&aacute;fica
      e/ou dos conte&uacute;dos do registro MARC.</li>
   </font>
   <ul>
		<LI><font face="Times New Roman"><b>#</b> - n&iacute;vel completo</font><br>
		  <font face="Times New Roman"> descri&ccedil;&atilde;o completa do registro MARC criado de informa&ccedil;&otilde;es derivadas da inspe&ccedil;&atilde;o f&iacute;sica do item descrito. </font>		</LI>
		<font face="Times New Roman"></font><LI><font face="Times New Roman"><b>5</b> - n&iacute;vel parcial (cataloga&ccedil;&atilde;o preliminar)<br>
		n&iacute;vel de cataloga&ccedil;&atilde;o preliminar do registro que n&atilde;o &eacute; considerado finalizado pela ag&ecirc;ncia que a produziu 
        (ex. os cabe&ccedil;alhos n&atilde;o podem refletir as formas estabelecidas; o registro
        n&atilde;o pode  atingir as especifica&ccedil;&otilde;es do n&iacute;vel de cataloga&ccedil;&atilde;o).
		</font></LI>
		<font face="Times New Roman"></font><LI><font face="Times New Roman"><b>u</b> – desconhecido<br>
		este c&oacute;digo &eacute; utilizado pelas ag&ecirc;ncias que recebem ou enviam
        dados para  um c&oacute;digo local de Leader/17 n&atilde;o pode determinar  adequadamente o n&iacute;vel de codifica&ccedil;&atilde;o apropriado
        de um registro. O c&oacute;digo <B>u</B> assim substitui o c&oacute;digo local. N&atilde;o &eacute; utilizado para
        novos registros ou atualiza&ccedil;&atilde;o de registros existentes.        </font></LI>
  </UL>

<LI><font face="Times New Roman"><b>18 - Descri&ccedil;&atilde;o da forma de cataloga&ccedil;&atilde;o</b>
<br>
um c&oacute;digo de caracter alfanum&eacute;rico que indica a forma de descri&ccedil;&atilde;o refletida no registro referente as normas de cataloga&ccedil;&atilde;o.
  O subcampo <B>^e</B>  (conven&ccedil;&otilde;es de descri&ccedil;&atilde;o) do campo 040 (fonte de
  cataloga&ccedil;&atilde;o) pode conter informa&ccedil;&atilde;o adicional sobre as conven&ccedil;&otilde;es utilizadas.</font></li>
	<UL>
		<LI><font face="Times New Roman"><b>a</b> - AACR2</font><br>
		  <font face="Times New Roman">parte</font><font face="Times New Roman"> descritiva do registro e da escolha e formas de entrada
        dos pontos de acesso. S&atilde;o formulados conforme a segunda edi&ccedil;&atilde;o das Regras de
        Cataloga&ccedil;&atilde;o Anglo-Americanas, 2&ordm; edi&ccedil;&atilde;o (AACR 2) ou conforme os manuais de cataloga&ccedil;&atilde;o baseados
        no AACR 2 o qual segue em ISBD suas se&ccedil;&otilde;es de  cataloga&ccedil;&atilde;o descritiva. A pontua&ccedil;&atilde;o ISBD &eacute; aplicada. </font></LI>
		<font face="Times New Roman"></font><LI><font face="Times New Roman"><b>i</b> – ISBD<br>
        parte descritiva do registro &eacute; formulada seguindo a descri&ccedil;&atilde;o e pontua&ccedil;&atilde;o dadas
        na ISBD. Os cabe&ccedil;alhos n&atilde;o est&atilde;o de acordo com a AACR2. Esta categoria
        inclui registros que utilizam pontua&ccedil;&atilde;o ISBD mas as outras conven&ccedil;&otilde;es utilizadas
        s&atilde;o desconhecidas.
		</font></LI>
		<font face="Times New Roman"><LI><b>u</b> – desconhecido<br>
		  uma organiza&ccedil;&atilde;o que recebe ou envia os dados  na posi&ccedil;&atilde;o de Leader/18&nbsp;
        n&atilde;o pode identificar a descri&ccedil;&atilde;o da forma de cataloga&ccedil;&atilde;o utilizada
        no registro. Pode ser usado em registros convertidos de outro formato de metadados </LI>
		</font></UL>
<LI><font face="Times New Roman"><b>19 - Nivel de registro de recurso em v&aacute;rias partes</b></font></LI>
	<ul>
		<LI><font face="Times New Roman"><b>#</b> -&nbsp; n&atilde;o especificados ou n&atilde;o se aplica </font></LI>
	</UL>
<LI><font face="Times New Roman"><b>20 - Tamanho da parte correspondente ao tamanho do campo</b></font>
  <ul>
    <li><font face="Times New Roman">Sempre cont&eacute;m um 4 </font></li>
    </ul>
</LI>
<li><font face="Times New Roman"><b>21 - Tamanho da posi&ccedil;&atilde;o do caracter de inicio</b></font>
  <ul>
    <li><font face="Times New Roman"> Sempre cont&eacute;m um 5 </font></li>
  </ul>
</li>
<li><font face="Times New Roman"><b>22 - Tamanho da parte de implementa&ccedil;&atilde;o </b></font>
    <ul>
      <li><font face="Times New Roman">Sempre cont&eacute;m um 0 </font></li>
    </ul>
</li>
<font face="Times New Roman"></font>
<li><font face="Times New Roman"><b>23- Entrada n&atilde;o definida</b></font>
    <ul>
      <li><font face="Times New Roman">Sempre cont&eacute;m um 0</font></li>
    </ul>
</li>
</UL>


<P><A href="#top">Ir ao in&iacute;cio da p&aacute;gina </A></P>
<hr>
<FONT FACE="Times New Roman" >
<H3><a name="mrcbdir">DIRET&Oacute;RIO</a> </H3>
</FONT>
<FONT FACE="Times New Roman">
</FONT>
<P><font face="Times New Roman">Um &iacute;ndice gerado pelo computador para a
localiza&ccedil;&atilde;o das vari&aacute;veis de controle e dos campos de dados dentro de um registro.
O diret&oacute;rio segue imediatamente ao Leader na posi&ccedil;&atilde;o 24 e consiste numa s&eacute;rie de entradas de
tamanho fixo (posi&ccedil;&otilde;es de 12 caracteres) que indicam a etiqueta (tag do
campo), tamanho, e a posi&ccedil;&atilde;o inicial de cada vari&aacute;vel do campo.</font></P>
<FONT FACE="Times New Roman"><H3></H3>
<H3>Posi&ccedil;&otilde;es dos caracteres</H3>

</FONT><UL>
	<LI><font face="Times New Roman">00-02 – Etiqueta (tag)<BR>
		Tres caracteres ASCII num&eacute;ricos ou ASCII alfab&eacute;ticos (mai&uacute;sculas ou min&uacute;sculas,
      mas n&atilde;o ambas) que identificam um campo variado associado. Tamanho do campo<BR>
      Quatro caracteres num&eacute;ricos que indicam o tamanho do campo vari&aacute;vel, incluindo
      os indicadores, c&oacute;digos de subcampos, dados, e o elemento de fim de campo.
      Um comprimento de campo com menos de quatro digitos &eacute;  alinhado &agrave; direita e as posi&ccedil;&otilde;es n&atilde;o utilizadas s&atilde;o preenchidas com zeros &agrave; esquerda.</font></LI>
	<LI><font face="Times New Roman">07-11 – Posi&ccedil;&atilde;o de in&iacute;cio dos dados<BR>
		Cinco caracteres ASCII num&eacute;ricos que indicam a posi&ccedil;&atilde;o do caracter
      inicial a partir do campo vari&aacute;vel relativo ao endere&ccedil;o base dos dados (Leader/12-16) do registro.
      O n&uacute;mero com menos de cinco algarismos &eacute; alinhado &agrave; direita e as posi&ccedil;&otilde;es n&atilde;o utilizadas s&atilde;o preenchidas com zeros &agrave; esquerda.</font></LI>
</UL>

<HR>
<P><font size="3" face="Times New Roman, Times, serif"><A href="#top">In&iacute;cio da p&aacute;gina</A></font></P>
<HR>
<p><font size="3" face="Times New Roman, Times, serif"><a href="ayuda_db.php?base=marc&campo=Indice.html"><STRONG>&Iacute;ndice geral</STRONG></a></font></p>
<HR>
<p><font size="3" face="Times New Roman, Times, serif"><a href="javascript:window.history.go(-1)"><b>Voltar</b></a></font></p>
<HR>
<P>&nbsp;</P>
</BODY>
</HTML>
