<p>Antes de usar esta op&ccedil;&atilde;o, &eacute; necess&aacute;rio configurar as vari&aacute;veis da base de dados envolvidas nas estat&iacute;sticas e opcionalmente, nas tabelas de frequ&ecirc;ncia e/ou conting&ecirc;ncia, onde estas se aplicam.</p>

<p>Para configurar as vari&aacute;veis envolvidas nos processos de  estatística, use a op&ccedil;&atilde;o <strong>Modificar defini&ccedil;&atilde;o de bases de dados </strong>do menu inicial do módulo de administra&ccedil;&atilde;o.</p>

<p><strong>Gera&ccedil;&atilde;o de estatísticas</strong></p>

<p><em><strong>Usar uma tabela existente</strong></em></p>

<p>&Eacute; exibido um menu suspenso com as tabelas previamente definidas na op&ccedil;&atilde;o <strong>Modificar defini&ccedil;&atilde;o de bases de datos</strong>. Selecione a tabela que deseja utilizar.</p>

<p><strong><em>Criar uma tabela</em></strong></p>

<p>&Eacute; exibida a  lista de&nbsp;campos da base de dados que tenham sido selecionados para a obten&ccedil;&atilde;o de  estatísticas. Selecione o campo a utilizar nas linhas  e  opcionalmente,&nbsp;o campo a utilizar nas colunas.</p>

<p><em>Tip: </em>coloque como linhas o campo que possui a maior diversidade de valores.</p>

<p><strong><em>Gerar sa&iacute;da</em></strong></p>

<p>Nesta se&ccedil;&atilde;o  indique o método de sele&ccedil;&atilde;o dos registros para os quais deseja obter uma matriz de frequ&ecirc;ncia ou de conting&ecirc;ncia.</p>

<ul>

    <li><em>Por faixa de Mfn</em></li>

    <li><em>Por busca</em></li>

</ul>

<p>Se selecionar <em>por busca</em> ser&aacute; exibido, numa janela pop-up,&nbsp;o formul&aacute;rio de busca avan&ccedil;ada para ajudar na constru&ccedil;&atilde;o da express&atilde;o de busca que,  aplicada na&nbsp; base de dados, extrairá os registros cujos campos ser&atilde;o quantificados. </p>

<p>Uma vez construída a express&atilde;o, clique em <img alt="" src="../../php/dataentry/img/barSearch.png" />&nbsp;para enviar a express&atilde;o de busca ao  formul&aacute;rio de estatísticas.</p>

<p>Deve escolher somente um  m&eacute;todo de extra&ccedil;&atilde;o de registros: por Mfn ou por busca.</p>

<p>Fornecidos os dados no formul&aacute;rio, clique em <strong>Enviar</strong> para obter os resultados correspondentes.</p>

<p>&nbsp;</p>

<hr />

&nbsp;

<p>&nbsp;</p>

<p><strong><a name="TABLE"></a>Gera&ccedil;&atilde;o da tabela</strong></p>

<p>Com os valores fornecidos no formul&aacute;rio de estat&iacute;sticas, se constr&oacute;i a matriz de frequ&ecirc;ncia ou conting&ecirc;ncia solicitada.</p>

<p>Junto com o desdobramento do quadro, s&atilde;o desdobradas as op&ccedil;&otilde;es para enviar o resultado por um dos seguintes meios:</p>

<ul>

    <li>Uma planilha de c&aacute;lculo (.xls)</li>

    <li>Um documento (.doc)</li>

    <li>Gerar um gráfico animado</li>

    <li>Gerar um gráfico n&atilde;o animado</li>

</ul>

<p><strong>Planilha de cálculo</strong></p>

<p>O quadro &eacute; constru&iacute;do e &eacute; aberto o programa associado, no cliente, aos arquivos .xls.</p>

<p><strong>Documento</strong></p>

<p>O quadro &eacute; constru&iacute;do e &eacute; aberto o programa associado, no cliente, aos arquivos .doc.</p>

<p><strong>Gráfico animado</strong></p>

<p>Os resultados s&atilde;o enviados a um plug-in gerador de  gráficos animados</p>

<p><strong>Gráfico n&atilde;o animado</strong></p>

<p>Os resultados s&atilde;o enviados a um plug-in gerador de gráficos n&atilde;o animados.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>